Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/001_overview_and_ref.po
Languages: fr

source: XSS attacks allow a user to inject client side scripts into the browsers of other users. This is usually achieved by storing the malicious scripts in the database where it will be retrieved and displayed to other users, or by getting users to click a link which will cause the attacker’s JavaScript to be executed by the user’s browser. However, XSS attacks can originate from any untrusted source of data, such as cookies or Web services, whenever the data is not sufficiently sanitized before including in a page.
fr: Les attaques XSS permettent à un utilisateur d'injecter des scripts côté client dans les navigateurs des autres utilisateurs. Ceci est habituellement réalisé en stockant les scripts malveillants dans la base de données où il sera récupéré et affiché aux autres utilisateurs, ou obligeant les utilisateurs à cliquer sur un lien qui va provoquer JavaScript de l'attaquant à être exécuté par le navigateur de l' utilisateur. Cependant, les attaques XSS peuvent provenir de toute source non fiable des données, telles que les cookies ou les services Web, chaque fois que les données ne sont pas suffisamment filtrées avant de s'inclure dans une page .

source: Cross site request forgery (CSRF)
fr: Demande du site de la Croix- faux ( CSRF)

source: CSRF attacks allow a malicious user to execute actions using the credentials of another user without that user’s knowledge or consent.
fr: Les attaques CSRF permettent à un utilisateur malveillant d'exécuter des actions en utilisant les informations d'identification d'un autre utilisateur sans la connaissance ou le consentement de l'utilisateur.

source: CSRF protection works by checking for a nonce in each POST request. This ensures that a malicious user cannot simply “replay” a form POST to your Web site and have another logged in user unwittingly submit that form. The malicious user would have to know the nonce, which is user specific (using a cookie).
fr: Protection CSRF fonctionne en vérifiant pour un nonce dans chaque requête POST . Cela garantit qu'un utilisateur malveillant ne peut pas simplement «rejouer» une forme POST à votre site Web et ont un autre utilisateur connecté à son insu qui soumet ce formulaire. L' utilisateur malveillant aurait à connaître le nonce, qui est spécifique de l'utilisateur (à l'aide d'un cookie ) .

source: SQL injection
fr: injection SQL

source: Host header validation
fr: Hôte validation d'en-tête

source: Django uses the **Host** header provided by the client to construct URLs in certain cases. While these values are sanitized to prevent Cross Site Scripting attacks, a fake **Host** value can be used for Cross-Site Request Forgery, cache poisoning attacks, and poisoning links in emails.
fr: Django utilise l' **Host** tête fourni par le client pour construire des URL dans certains cas . Bien que ces valeurs sont désinfectés pour prévenir les attaques de type Cross Site Scripting, un faux **Host** valeur peut être utilisée pour Cross-Site Request Forgery, les attaques par empoisonnement de cache, et des liens d'empoisonnement dans les emails .

source: Because even seemingly-secure web server configurations are susceptible to fake **Host** headers, Django validates **Host** headers against the **ALLOWED_HOSTS** setting in the ``django.http.HttpRequest.get_host()`` method.
fr: Parce que les configurations de serveur Web même apparemment sécurisées sont sensibles à de faux **Host** têtes, Django valide **Host** têtes contre le réglage **ALLOWED_HOSTS** dans le ``django.http.HttpRequest.get_host()`` procédé .

source: This validation only applies via **get_host()**; if your code accesses the Host header directly from **request.META** you are bypassing this security protection.
fr: Cette validation applique uniquement via **get_host()** ; si votre code accède à la tête de l'hôte directement à partir de **request.META** vous suspendez cette protection de la sécurité .

source: It is always better for security, though not always practical in all cases, to deploy your site behind HTTPS. Without this, it is possible for malicious network users to sniff authentication credentials or any other information transferred between client and server, and in some cases – active network attackers – to alter data that is sent in either direction.
fr: Il est toujours préférable pour la sécurité, mais pas toujours pratique dans tous les cas, de déployer votre site derrière HTTPS . Sans cela, il est possible pour les utilisateurs de réseau malicieus de renifler des informations d'authentification ou de toute autre information transférée entre le client et le serveur, et dans certains cas - attaquants actifs de réseau - de modifier ces données qui sont envoyées dans les deux sens .

source: Django provides some settings to secure your site unser SSL/HTTPS.
fr: Django fournit quelques paramètres pour sécuriser votre site unser SSL / HTTPS .

source: While Django provides good security protection out of the box, it is still important to properly deploy your application and take advantage of the security protection of the Web server, operating system and other components.
fr: Bien que Django offre une bonne protection à la boîte, il est toujours important de déployer correctement votre demande et profiter de la protection de la sécurité du système d'exploitation serveur Web et d'autres composants .

source: Make sure that your Python code is outside of the Web server’s root. This will ensure that your Python code is not accidentally served as plain text (or accidentally executed).
fr: Assurez-vous que votre code Python est en dehors de la racine du serveur Web . Cela permettra d'assurer que votre code Python est pas accidentellement servi sous forme de texte ( ou accidentellement exécuté ) .

source: Take care with any user uploaded files.
fr: Prenez soin de tous les fichiers téléchargés par l'utilisateur.

source: Django does not throttle requests to authenticate users. To protect against brute-force attacks against the authentication system, you may consider deploying a Django plugin or Web server module to throttle these requests.
fr: Django n' étrangle pas les demandes pour authentifier les utilisateurs . Pour se protéger contre la force brute des attaques contre le système d'authentification, vous pouvez envisager de déployer un module de plug-in ou un serveur Web Django pour étrangler ces demandes .

source: Keep your **SECRET_KEY** a secret.
fr: Gardez votre **secret_key** un secret

source: It is a good idea to limit the accessibility of your caching system and database using a firewall.
fr: C' est une bonne idée de limiter l'accessibilité de votre système de mise en cache et de base de données en utilisant un pare-feu .

source: More: `Security in Django <https://docs.djangoproject.com/en/stable/topics/security/>`_
fr: Plus: `Sécurité dans Django <https://docs.djangoproject.com/en/stable/topics/security/>`_

source: Django Overview
fr: Prèsentation de Django

source: This section introduces some basic concepts of DJango, the Python based web framework on top of which GeoNode has been developed.
fr: Cette section présente les concepts de base de Django, le framework web basé sur Python qui on a utilisé pur développé GeoNode.

source: Django's primary goal is to ease the creation of complex, database-driven websites. Django emphasizes reusability and "pluggability" of components, rapid development, and the principle of *don't repeat yourself*. Python is used throughout, even for settings, files, and data models.
fr: L'objectif principal de Django est de faciliter la création des web applications complexes qui utilise des bases de données. Django rend facile la réutilisation et " pluggability " de composants, de le développement rapide, et le principe de *Do not Repeat Yourself*. Python est utilisé partout, pour les paramètres de configuration, pour les fichiers et pour la interaction avec les modèles de données.

source: Django also provides an optional administrative create, read, update and delete interface that is generated dynamically through introspection and configured via admin models.
fr: Django fournit également creation administrative optionelle, lire, mettre à jour et supprimer l'interface qui est généré dynamiquement par l'introspection et configuré via des modèles d'administration.

source: GeoNode Overview & Reference
fr: GeoNode Aperçu et Reference

source: Welcome to the GeoNode Training `Overview & Reference` documentation v\ |release|.
fr: Bienvenue à la documentation de formation de GeoNode `Overview & Reference` documentation v\ |release|.

source: This module guides the user to an overview of GeoNode and its main components.
fr: Cette section guide l'utilisateur à une introduction de GeoNode et ses principales composantes .

source: At the end of this section you will have a clear view of what GeoNode is and can do. You will be able also to use the GeoNode main functionalities and understand some of the basic concepts of the system infrastructure.
fr: A la fin de cette section vous aurez une vue claire de ce qu vous pouvez fair avec GeoNode et de ce que est GeoNode meme
