Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/001_overview_and_ref.po
Languages: fr

source: The last method in this example is a `property <https://docs.djangoproject.com/en/1.8/glossary/#term-property>`_.
fr: La dernière méthode dans cet exemple est une `propriété <https://docs.djangoproject.com/en/1.8/glossary/#term-property>`_.

source: More: `Models Methods <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-methods>`_
fr: Plus : `Méthodes Modèles <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-methods>`_

source: Model inheritance
fr: Modèle d'héritage

source: Model inheritance in Django works almost identically to the way normal class inheritance works in Python, but the basics at the beginning of the page should still be followed. That means the base class should subclass ``django.db.models.Model``.
fr: Le modèle héritage dans Django fonctionne presque pareil à la façon normale du fonctionnement de l'héritage de classe en Python, mais les bases au début de la page doit toujours être suivie . Cela signifie que la classe de base devrait sous-classe ``django.db.models.Model`` .

source: The only decision you have to make is whether you want the parent models to be models in their own right (with their own database tables), or if the parents are just holders of common information that will only be visible through the child models.
fr: La seule décision que vous avez à faire est de savoir si vous voulez que les modèles de parents des modèles soit dans leur propre droit ( avec leurs propres tables de base de données ), ou si les parents sont seulement détenteurs d'informations commune qui ne seront visibles à travers les modèles de l'enfant .

source: There are three styles of inheritance that are possible in Django.
fr: Il existe trois styles d'héritage qui sont possibles dans Django .

source: Often, you will just want to use the parent class to hold information that you don’t want to have to type out for each child model. This class isn’t going to ever be used in isolation, so `Abstract base classes <https://docs.djangoproject.com/en/1.8/topics/db/models/#abstract-base-classes>`_ are what you’re after.
fr: Souvent, vous voudrez juste utiliser la classe parentée pour détenir des informations que vous ne voulez pas avoir à taper pour chaque modèle enfant . Cette classe ne va jamais être utilisé dans l'isolement, donc `classes de base abstraites <https://docs.djangoproject.com/en/1.8/topics/db/models/#abstract-base-classes>`_ sont ce que vous êtes après.

source: If you’re subclassing an existing model (perhaps something from another application entirely) and want each model to have its own database table, `Multi-table inheritance <https://docs.djangoproject.com/en/1.8/topics/db/models/#multi-table-inheritance>`_ is the way to go.
fr: Si vous sous-classer un modèle existant (peut-être quelque chose d'une autre application entièrement) et que vous voulez chaque modèle d'avoir sa propre table de base de données, `multi- héritage de table <https://docs.djangoproject.com/en/1.8/topics/db/models/#multi-table-inheritance>`_ est le chemin à parcourir .

source: Finally, if you only want to modify the Python-level behavior of a model, without changing the models fields in any way, you can use `Proxy models <https://docs.djangoproject.com/en/1.8/topics/db/models/#proxy-models>`_.
fr: Enfin, si vous voulez seulement modifier le niveau de comportement Python d'un modèle sans modifier les champs des modèles en aucune façon, vous pouvez utiliser des `Modèles de Proxy <https://docs.djangoproject.com/en/1.8/topics/db/models/#proxy-models>`_.

source: More: `Model Inheritance <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-inheritance>`_
fr: Plus: `Model Inheritance <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-inheritance>`_

source: `Making queries`_
fr: Faire des intérogations

source: Once you’ve created your data models, Django automatically gives you a database-abstraction API that lets you create, retrieve, update and delete objects.
fr: Une fois que vous avez créé vos modèles de données, Django vous donne automatiquement une base de données API - abstraction qui vous permet de créer, récupérer, mettre à jour et de supprimer des objets .

source: Throughout this guide (and in the reference), we’ll refer to the following models, which comprise a Weblog application:
fr: Tout au long de ce guide (et dans la référence), nous appelons les modèles suivants, qui comprennent une application Weblog :

source: Creating objects
fr: Créations d'objets

source: To represent database-table data in Python objects, Django uses an intuitive system: A model class represents a database table, and an instance of that class represents a particular record in the database table.
fr: Pour représenter les données de bases de données table en objets Python, Django utilise un système intuitif : Une classe de modèle représente une table de base de données, et une instance de cette classe représente un enregistrement particulier dans la table de base de données.

source: To create an object, instantiate it using keyword arguments to the model class, then call **save()** to save it to the database.
fr: Pour créer un objet, l'instancier en utilisant des arguments de mots clés pour la classe de modèle, puis d'appeler **save()** pour la sauvegarder la base de données.

source: Assuming models live in a file **mysite/blog/models.py**, here’s an example:
fr: En supposant que les modèles vivent dans un fichier **mysite/blog/models.py**, voici un exemple :

source: This performs an **INSERT SQL** statement behind the scenes. Django doesn’t hit the database until you explicitly call **save()**.
fr: Ceci effectue un **INSERT SQL** déclaration dans les coulisses. Django ne touche pas la base de données jusqu'à ce que vous appelez explicitement **save()**

source: The **save()** method has no return value.
fr: Le **save()** méthode n'a pas de valeur de retour .

source: Saving changes to objects
fr: Enregistrement des modifications aux objets

source: To save changes to an object that’s already in the database, use **save()**.
fr: Pour enregistrer les modifications apportées à un objet qui est déjà dans la base de données, utilisez **save()** .

source: Given a Blog instance b5 that has already been saved to the database, this example changes its name and updates its record in the database:
fr: Étant donné un b5 Blog de ​​l'instance qui a déjà été enregistré sur la base de données, cet exemple change de nom et met à jour son enregistrement dans la base de données :

source: This performs an **UPDATE SQL** statement behind the scenes. Django doesn’t hit the database until you explicitly call **save()**.
fr: Ceci effectue un **UPDATE SQL** déclaration dans les coulisses. Django ne touche pas la base de données jusqu'à ce que vous appelez explicitement **save()**

source: Retrieving objects
fr: Récupération des objets

source: To retrieve objects from your database, construct a **QuerySet** via a **Manager** on your model class.
fr: Pour récupérer des objets dans votre base de données, construire un **QuerySet** via un **Manager** sur votre classe de modèle.

source: A **QuerySet** represents a collection of objects from your database. It can have zero, one or many filters. Filters narrow down the query results based on the given parameters. In SQL terms, a **QuerySet** equates to a **SELECT** statement, and a filter is a limiting clause such as **WHERE** or **LIMIT**.
fr: A **QuerySet** représente une collection d'objets à partir de votre base de données . Il peut y avoir zéro, un ou plusieurs filtres. Filtres affiner les résultats de la requête sur la base des paramètres donnés. En termes SQL, un **QuerySet** équivaut à une déclaration **SELECT**, et un filtre est une clause limitant tels que **WHERE** ou **LIMIT** .

source: You get a **QuerySet** by using your model’s **Manager**. Each model has at least one **Manager**, and it’s called ``objects`` by default. Access it directly via the model class, like so:
fr: Vous obtenez un **QuerySet** en utilisant le gestionnaire de votre modèle **Manager**. Chaque modèle possède au moins un gestionnaire **Manager**, et il est appelé ``objects`` par défaut. Accéder directement via la classe de modèle, comme ceci:

source: **Managers** are accessible only via model classes, rather than from model instances, to *enforce a separation* between “table-level” operations and “record-level” operations. The **Manager** is the main source of **QuerySets** for a model. For example, ``Blog.objects.all()`` returns a **QuerySet** that contains all Blog objects in the database.
fr: **Managers** ne sont accessibles que via les classes du modèle, plutôt que d' instances de modèle, à appliquer une séparation entre les opérations de “table-level” et opérations de record-level” . Le **Managers** est la principale source de **QuerySets** pour un modèle. Par exemple, ``Blog.objects.all()`` renvoie une **QuerySet** qui contient tous les objets de blog dans la base.

source: Retrieving all objects
fr: Récupération des objets

source: The simplest way to retrieve objects from a table is to get all of them. To do this, use the **all()** method on a **Manager**:
fr: La façon la plus simple pour récupérer des objets à partir d'un tableau est d'obtenir chacun d'eux. Pour faire ca, utilisez le **all()** méthode sur un **Manager**:

source: The **all()** method returns a **QuerySet** of all the objects in the database.
fr: Le **all()** méthode renvoie une **QuerySet** de tous les objets dans la base de données.

source: Retrieving specific objects with filters
fr: Récupération des objets spécifiques avec des filtres

source: The **QuerySet** returned by **all()** describes all objects in the database table. Usually, though, you’ll need to select only a subset of the complete set of objects.
fr: Le **QuerySet** retourné par **all()** décrit tous les objets de la table de base de données . Habituellement, cependant, vous aurez besoin de sélectionner uniquement un sous-ensemble de l'ensemble des objets .

source: To create such a subset, you refine the initial **QuerySet**, adding filter conditions. The two most common ways to refine a **QuerySet** are:
fr: Pour créer un tel sous-ensemble, affinez l' initiale **QuerySet**, ajouter des conditions de filtrage . Les deux façons les plus courantes d'affiner un **QuerySet** sont :

source: Returns a new **QuerySet** containing objects that match the given lookup parameters.
fr: Retourne une nouvelle **QuerySet** contenant des objets qui correspondent aux paramètres de recherche donnés

source: Returns a new **QuerySet** containing objects that do not match the given lookup parameters. The lookup parameters (****kwargs** in the above function definitions) should be in the format described in **Field** lookups below.
fr: Renvoie un nouveau **QuerySet** contenant les objets qui ne correspondent pas aux paramètres de recherche donnés . Les paramètres de recherche ( **** ** kwargs dans les définitions de fonctions ci-dessus ) doivent être dans le format décrit dans le champ ci-dessous ** ** recherches .

source: For example, to get a **QuerySet** of blog entries from the year 2006, use **filter()** like so:
fr: Par exemple, pour obtenir un **QuerySet** QuerySet d'entrées de blog à partir de l'année 2006, utiliser **filter()** comme ceci:

source: With the default manager class, it is the same as:
fr: Avec la classe de gestionnaire par défaut, il est le même que :

source: Chaining filters
fr: Enchaînant les filtres

source: The result of refining a **QuerySet** is itself a **QuerySet**, so it’s possible to chain refinements together. For example:
fr: Le résultat du raffinage a **QuerySet** est lui-même un **QuerySet**, il est donc possible de raffinements de la chaîne ensemble. Par example:

source: This takes the initial **QuerySet** of all entries in the database, adds a filter, then an exclusion, then another filter. The final result is a **QuerySet** containing all entries with a headline that starts with “What”, that were published between January 30, 2005, and the current day.
fr: Cela prend la première **QuerySet** de toutes les entrées dans la base de données, ajoute un filtre, puis une exclusion, puis un autre filtre. Le résultat final est un **QuerySet** contenant toutes les entrées avec un titre qui commence par «quoi», qui ont été publiés entre le 30 Janvier, 2005, et de la journée en cours .

source: More: `Making queries <https://docs.djangoproject.com/en/1.8/topics/db/queries/#making-queries>`_
fr: Plus : `Faire des requêtes <https://docs.djangoproject.com/en/1.8/topics/db/queries/#making-queries>`_

source: URLs and views
fr: URL et vues

source: A clean, elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and doesn’t put any cruft in URLs, like .php or .asp.
fr: Un élégant schéma d'URL propre est un détail important dans une application Web de haute qualité . Django encourage un beau design URL et ne met pas de cochonneries dans les URL, comme .php ou .asp .

source: To design URLs for an application, you create a Python module called a URLconf. Like a table of contents for your app, it contains a simple mapping between URL patterns and your views.
fr: Pour concevoir les URL pour une application, vous créez un module Python appelé URLconf . Comme une table des matières pour votre application, il contient un mappage simple entre les schémas d'URL et vos points de vue

source: More: `URL dispatcher <https://docs.djangoproject.com/en/1.8/topics/http/urls/>`_
fr: Plus: `URL dispatcher <https://docs.djangoproject.com/en/1.8/topics/http/urls/>`_

source: Templates
fr: Modèles

source: Django’s template language is designed to strike a balance between power and ease. It’s designed to feel comfortable and easy-to-learn to those used to working with HTML, like designers and front-end developers. But it is also flexible and highly extensible, allowing developers to augment the template language as needed.
fr: Le langage de template de Django est conçu pour établir un équilibre entre la puissance et la facilité . Il est conçu pour se sentir confortable et facile à apprendre à ceux utilisés pour travailler avec HTML, comme concepteurs et les développeurs front-end . Mais il est aussi flexible et hautement extensible, permettant aux développeurs d' augmenter le language du template si nécessaire.

source: More: `Templates <https://docs.djangoproject.com/en/1.8/topics/templates/>`_
fr: Plus: `Modèles <https://docs.djangoproject.com/en/1.8/topics/templates/>`_

source: Forms
fr: Formulaires

source: Django provides a powerful form library that handles rendering forms as HTML, validating user-submitted data, and converting that data to native Python types. Django also provides a way to generate forms from your existing models and use those forms to create and update data.
fr: Django fournit une puissante bibliothèque de formulaires qui gère compte rendus HTML, la validation des données soumises par les utilisateurs, et la conversion de ces données pour les types de Python natives . Django fournit également un moyen pour générer des formes à partir de vos modèles existants et d'utiliser ces formes pour créer et actualiser les données .

source: **GET** and **POST** are the only HTTP methods to use when dealing with forms.
fr: **GET** et **POST** sont les seules méthodes de HTTP à utiliser lorsqu'ils traitent avec des formes .

source: Django’s login form is returned using the **POST** method, in which the browser bundles up the form data, encodes it for transmission, sends it to the server, and then receives back its response.
fr: Le formulaire de login de Django est renvoyé à l'aide du méthode **POST**, dans laquelle le navigateur bundles les données de formulaire, l'encode pour la transmission, l'envoie au serveur et reçoit en retour sa réponse alors.

source: **GET**, by contrast, bundles the submitted data into a string, and uses this to compose a URL. The URL contains the address where the data must be sent, as well as the data keys and values. You can see this in action if you do a search in the Django documentation, which will produce a URL of the form ``https://docs.djangoproject.com/search/?q=forms&release=1``.
fr: **GET**, en revanche, regroupe les données présentées dans une chaîne, et l'utilise pour composer une URL. L'URL contient l'adresse où les données doivent être envoyées, ainsi que les clés et les valeurs données. Vous pouvez voir dans cette action si vous effectuez une recherche dans la documentation de Django, qui va produire une URL de la forme ``https://docs.djangoproject.com/search/?q=forms&release=1``.

source: **GET** and **POST** are typically used for different purposes.
fr: **GET** et **POST** sont généralement utilisés à des fins différentes .

source: Any request that could be used to change the state of the system - for example, a request that makes changes in the database - should use **POST**. **GET** should be used only for requests that do not affect the state of the system.
fr: Toute demande qui pourrait être utilisée pour modifier l'état du système - par exemple, une requête qui effectue des modifications dans la base de données - devrait utiliser **POST**. **GET** doit être utilisé uniquement pour les demandes qui ne touchent pas l'état du système .

source: **GET** would also be unsuitable for a password form, because the password would appear in the URL, and thus, also in browser history and server logs, all in plain text. Neither would it be suitable for large quantities of data, or for binary data, such as an image. A Web application that uses **GET** requests for admin forms is a security risk: it can be easy for an attacker to mimic a form’s request to gain access to sensitive parts of the system. **POST**, coupled with other protections like Django’s CSRF protection offers more control over access.
fr: **GET** serait également impropre à une forme de mot de passe, parce que le mot de passe apparaît dans l'URL, et donc, aussi dans l'histoire de navigateur et le serveur, tous les journaux en texte brut. Il ne serait pas approprié pour de grandes quantités de données, ou pour des données binaires, comme une image . Une application Web qui utilise **GET** pour des formes d'administration est un risque de sécurité : il peut être facile pour un attaquant pour imiter la demande d'un formulaire pour accéder à des parties sensibles du système . **POST**, couplé avec d'autres protections comme la protection CSRF de Django qui offre plus de contrôle sur l'accès .

source: On the other hand, **GET** is suitable for things like a web search form, because the URLs that represent a **GET** request can easily be bookmarked, shared, or resubmitted.
fr: D'autre part, **GET** est adapté pour des choses comme un formulaire de recherche Web, parce que les URL qui représentent un les demandes de **GET** peuvent facilement être favorisés, partagées, ou soumise à nouveau .

source: More: `Working With Forms <https://docs.djangoproject.com/en/1.8/topics/forms/#working-with-forms>`_
fr: Plus: `Travailler avec les formes <https://docs.djangoproject.com/en/1.8/topics/forms/#working-with-forms>`_

source: Django comes with a full-featured and secure authentication system. It handles user accounts, groups, permissions and cookie-based user sessions. This lets you easily build sites that let users to create accounts and safely log in/out.
fr: Django est livré avec un système d'authentification complet et sécurisé . Il gère les comptes d'utilisateurs, les groupes, les autorisations et les sessions utilisateur basées sur les cookies . Cela vous permet de créer facilement des sites qui permettent aux utilisateurs de créer des comptes et de vous connecter / déconnecter en toute sécurité .

source: More: `User authentication in Django <https://docs.djangoproject.com/en/stable/topics/auth/>`_
fr: Plus : `Authentification des utilisateurs dans Django <https://docs.djangoproject.com/en/stable/topics/auth/>`_

source: Admin
fr: Aministrateur

source: One of the most powerful parts of Django is its automatic admin interface. It reads metadata in your models to provide a powerful and production-ready interface that content producers can immediately use to start managing content on your site. It’s easy to set up and provides many hooks for customization.
fr: Une des parties les plus puissantes de Django est son interface d'administration automatique. Elle lit les métadonnées dans vos modèles pour fournir une interface puissante et prête à la production que les producteurs de contenu peuvent utiliser immédiatement pour commencer à gérer le contenu sur votre site . Il est facile à configurer et fournit de nombreux crochets pour la personnalisation

source: The advanced workshop for Developers will provide more details on GeoNode specific models and admin interface
fr: Le cours avancé pour les développeurs va fournir plus de détails sur GeoNode modèles spécifiques et l'interface d'admin

source: More: `The Django admin site <https://docs.djangoproject.com/en/stable/ref/contrib/admin/>`_
fr: Plus : `Le site d'administration de Django <https://docs.djangoproject.com/en/stable/ref/contrib/admin/>`_

source: Internationalization
fr: Internationalisation

source: Django offers full support for translating text into different languages, plus locale-specific formatting of dates, times, numbers and time zones. It lets developers and template authors specify which parts of their apps should be translated or formatted for local languages and cultures, and it uses these hooks to localize Web applications for particular users according to their preferences.
fr: Django offre un support complet pour la traduction du texte dans différentes langues, ainsi que le formatage spécifique à la localisation des dates, des heures, des chiffres et des fuseaux horaires . Il permet aux développeurs et auteurs de gabarits précisent quelles parties de leurs applications devraient être traduits ou formatés pour les langues et les cultures locales, et il utilise ces crochets pour localiser les applications Web pour des utilisateurs particuliers en fonction de leurs préférences .

source: The advanced workshop for Developers will provide more details on how to create languages and translations on GeoNode using `Transifex <https://www.transifex.com/>`_
fr: Le séminaire avancé pour les développeurs fournira plus de détails sur la façon de créer des langues et des traductions sur GeoNode utilisant ` Transifex < https://www.transifex.com/ > ` _

source: More: `Internationalization and localization <https://docs.djangoproject.com/en/stable/topics/i18n/>`_
fr: Plus : `Internationalisation et la localisation <https://docs.djangoproject.com/en/stable/topics/i18n/>`_

source: Security
fr: Sécurité

source: Django provides multiple protections against:
fr: Django prévoit de multiples protections contre:

source: Clickjacking is a type of attack where a malicious site wraps another site in a frame. This attack can result in an unsuspecting user being tricked into performing unintended actions on the target site.
fr: Clickjacking est un type d'attaque, un site malveillant enroule un autre site dans un cadre. Cette attaque peut entraîner une méfiance l'utilisateur étant trompé en effectuant des actions involontaires sur le site cible .

source: The **X-Frame-Options middleware** contained in a form allow a supporting browser to prevent a site from being rendered inside a frame
fr: Le middleware **X-Frame-Options** est contenue dans une forme permettant à un navigateur supportant d'empêcher à un sitede se rendre dans un cadre
