Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/001_overview_and_ref.po
Languages: fr

source: Import and Manage
fr: Importation et gestion.

source: GeoNode allows users to upload and share geospatial data, securely. GeoNode makes it easy to upload and manage geospatial data on the web. Any user can upload and make content available via standard OGC protocols such as Web Map Service (WMS) and Web Feature Service (WFS). Data is available for browsing, searching, styling, and processing to generate maps which can be shared publicly or restricted to specific users only. Supported upload formats include ShapeFile, GeoTIFF, KML and CSV. In addition, it is possible to connect to existing external spatial databases and services.
fr: Geonode permet aux utilisateurs de télécharger et partager les données géospatiales en sécurité. Geonode rend les données géospatiales facile à gèrer et à télécharger. Chaque utilisateur peut télécharger et rendre des contenus disponibles via standard OGC protocols comme Web Map Service (WMS) et Web Feature Service ( WFS). La donnée est disponible pour naviguer, chercher, elaborer et traiter afin de générer des cartes pouvant être partagée publiquement ou limitée seulement à des utilisateurs spécifiques. Le format de téléchargement spécifié inclut ShapeFile, GeoTIFF, KML et CSV. En plus, il est possible de se connecter à des bases de données et services spatiaux externes existants.

source: Features include:
fr: Les fonctionnalités incluent:

source: Publish raster, vector, and tabular data
fr: Publier des données raster, vecteur et tabulaires

source: Manage metadata and associated documents
fr: Gérer des métadonées et des documents associés

source: Securely or publicly share data
fr: Donées partagées publiquement ou en toute sécurité

source: Versioned geospatial data editor
fr: Editeur de donées géospatiale versionnée

source: Users' Features
fr: Fonctionnalités pour les utilisateurs.

source: Open Source Geospatial Content Management System
fr: Système Open Source de gestion de contenu Geospatial

source: GeoNode is a web-based application and platform for developing geospatial information systems (GIS) and for deploying spatial data infrastructures (SDI).
fr: Geonode est une application web based et une plateforme pour le dévelopement de systéme d'informations géospatiales (SIG) et pour la creation d'infrastructures de données spatial (SDI).

source: What GeoNode can be used for… `GeoNode Demo <http://demo.geonode.org/>`_ (admin/admin)
fr: Geonode peut être utilisé pour certain but... `Geonode démo: <http://demo.geonode.org/>`_ (admin/admin)

source: Interactive Mapping
fr: Mapping Intéractive

source: GeoNode allows users to create and share interactive web maps. GeoNode comes with helpful cartography tools for styling and composing maps graphically. These tools make it easy for anyone to assemble a web-based mapping application with functionality traditionally found in desktop GIS applications. Users can gain enhanced interactivity with GIS-specific tools such as querying and measuring.
fr: Geonode permet aux utilisateurs de créer et partager des cartes web intéractives. Geonode fournit des outils de cartographie utiles pour composer des cartes graphiquement. Ses outils rendent facile d'assembler une web application de maping avec des fonctionnalités trouvée traditionnellement dans les applications de SIG desktop. Les utilisateurs peuvent avoir intéractivitée avancée en utilisant des outils spécifiques des applications SIG tels que l'interrogation et la mesure.

source: Graphical style editor
fr: Éditeur de style visuel

source: Create multi-layer interactive maps
fr: Abilitè de créer de cartes interactives multi-couches

source: Share and embed maps in web pages
fr: Abilitè de partager et intégrer des cartes dans des pages web.

source: Spatial Data Discovery
fr: Découverte de données spatiales

source: GeoNode allows users to browse and search for geospatial data. By combining collaboration found in social networks with specialized geospatial tools, GeoNode makes it easy to explore, process, style, and share maps and geospatial data. Spatial datasets can be imported and shared, all through a non-technical user interface.
fr: Geonode permet aux utilisateurs de naviguer et chercher des données geospatiales en combinant des collaborations trouvé dans des socials networks avec des outils geospatiaux spéciaux. Geonode rend facil explorer, élaborer, styliser et partager des cartes et des données géospatiales. Des ensembles de donées spatiales peuvent être importées et partagées à travers une interface graphique tres simplifié pour aider les utilisateurs même.

source: Powerful spatial search engine
fr: Moteur de recherche spatial tres puissant

source: Federated OGC services
fr: Services fédérés OGC

source: Metadata catalogue
fr: Catalogue de métadonnées.

source: In this Quickstart guide you will learn the following:
fr: Dans cette section, vous allez apprendre ce qui suit:

source: to register a new account to get started
fr: Enregistrer un nouveau compte

source: add a new layer
fr: Ajouter une nouvelle couche

source: create a map using your new layer
fr: Créer une carte en utilisant une nouvelle couche

source: share your map with others
fr: Partager votre carte avec d'autres personnes

source: Start GeoNode on your Live DVD or local VM and redirect your browser at `http://localhost:8000/ <http://localhost:8000/>`_ (this is the default port). The page will look like shown in the image below.
fr: Naviguez avec votre browser à `http://localhost:8000/ <http://localhost:8000/>`_ (cela est le port par défaut). La page ressemblera à l'image ci-dessous.

source: *Welcome page*
fr: Page de bienvenue

source: 1. Register a new account
fr: 1.Enregistrer un nouveau compte.

source: From the interface shown above, one can view and modify existing spatial layers and maps, as well as find information on other GeoNode users. But, without being logged in, you are limited to read-only access of public layers. In order to create a map and add layers to it, you have to have create an account first.
fr: A partir de l'interface montrée dessus, il est possible de voir et modifier des cartes et couches existants ainsi que de trouver des informations sur les autres utilisateurs de GeoNode. Sans s'identifier, vous vous limitez à lire l'accés des couches publics. Pour créer une carte et y ajouter des couches, on doit avoir créé d'abord un compte.

source: From any page in the web interface, you will see a *Sign in* link. Click that link, and in the dialog that displays, click the *Register now* link.
fr: Pour chaque page de l'interface web, vous voyez un lien " Sign in" . Cliquez ce lien et dans la boite de dialogue qui s'affiche, cliquez le lien " Register now".

source: *Sign in Form*
fr: Formulaire d'inscription.

source: On the next page, fill out the form. Enter a user name and password in the fields. Also, enter your email address for verification.
fr: Dans la prochaine page, remplissez le formulaire. Ecrivez un username et une password dans les cases. Ecrivez votre adresse email pour la vérification.

source: *Register Form*
fr: Formulaire d'enregistrement

source: You will be returned to the welcome page. An email will be sent confirming that you have signed up. While you are now logged in, you will need to confirm your account. Navigate to the link that was sent in the email.
fr: On va etre renvoyés à la page de bienvenue. Une email vous sera envoyée confirmant que vous êtes enregistrés. Alors que vous êtes identifié, vous devez confirmer votre compte. Naviguez au link envoyé à votre email pour la confirmation.

source: *Confirm*
fr: Confirmez

source: By clicking *Confirm* you will be returned to the homepage. Now you’ve registered an account, you are able to add layers to it as well as create maps and share those with other users.
fr: En cliquant "confirm", vous serez renvoyé à la homepage. Maintenat que vous avez enregistrés un compte, vous êtes capable d'y ajouter des couches, crèer des cartes et les partager avec d'autres utilisateurs.

source: 2. Add a new layer
fr: 2.Ajouter un nouveau couche

source: Layers are a published resource representing a raster or vector spatial data source. Layers also can be associated with metadata, ratings, and comments.
fr: Les couches sont des ressources publiées représentant un raster ou une source de données spatiale vectoriel

source: To add a layer to your account, navigate to the welcome page. There the following toolbar can be seen:
fr: Pour ajouter une nouvelle couche à votre compte, naviguez à partir de la page de bienvenue. D'ici on peut voir la barre d'outils:

source: *Toolbar*
fr: Barre d'outils

source: By clicking the *Layers* link you will be brought to the *Layers* menu where a new subtoolbar can be seen. This toolbar allows you to *Explore*, *Search* and *Upload* layers.
fr: En cliquant sur les *Layers* vous serez amené aux *Layers* menu où une nouvelle subtoolbar peut être vu. Cette barre d'outils vous permet de *Explorer*, *Rechercher* et *Ajouter* des couches.

source: *Upload Button*
fr: Bouton de Chargement

source: Now click *Upload Layers* and you’ll see the upload form.
fr: Maintenant cliquez " Upload Layers" et vous allez voir le formulaire pour charger le données.

source: *Upload Form*
fr: Formulaire de Chargement.

source: You have two possibilities to add your files. You can either do that by using *drag & drop* or you choose to *browse* them. Be aware that you have to upload a complete set of files, consisting of a **shp**, a **prj**, a **dbf** and a **shx** file. If one of them is missing, GeoNode will warn you before you upload them.
fr: Vous avez deux possibilitès pour ajouter vos fichiers. Vous pouvez faire cela en utilisant " drag & drop" ou en utilisant de les "browse". On doit savoir que vous devez charger un complet ensemble de données, qui consiste **shp**, a **prj**, a **dbf** and a **shx** file. si l'un d'eux manque, Geonode vous avertira avant que vous les chargiez.

source: You shold now be able to see all the files you want to upload.
fr: Vous devriez maintenant voir tout les fichiers que vous voulez télécharger.

source: *Files to be Uploaded*
fr: Fichiers à télécharger

source: GeoNode has the ability to restrict who can view, edit, and manage layers. On the right side of the page you can see the *Permission* section, where you can limit the access on your layer. Under **Who can view and download this data**, select **Any registered user**. This will ensure that *Anonymous* view access is disabled. In the same area, under **Who can edit this data**, select **your username**. This will ensure that *Only You* are able to edit the data in the layer.
fr: Geonode a l'abilité de limiter qui peut voir, éditer et gérer les couches. Sur le coté gauche de la page, vous pouvez voir la section " Permission, ou vous pouvez limiter l'accès à votre niveau. Sous **Who can view and download this data**, sélectionne *Any registered user*. Cela empechera la vue aux personnes anonymes. Dans la même aire, sous "Who can edit this data", sélectionnez votre username . Ceci assurera que seulement vous, êtes capable d'éditer les données dans le niveau.

source: To upload data, click the *Upload* button at the bottom.
fr: Pour charger des données, cliquez sur le bouton " charger" en bas de la page.

source: 3. Create a new map
fr: 3. Créer une nouvelle carte

source: The next step for you is to create a map and add the newly created layers to this map.
fr: La prochaine etape est de créer une carte et d'y ajouter le nouveau couche qu'on a créé.

source: Click the *Maps* link on the top toolbar. This will bring up the list of maps.
fr: Cliquez sur le link *Maps* en haut de la barre d'outils. Ceci va rapporter la liste des cartes.

source: *Create new Map Button*
fr: Bouton pour Créer une Nouvelle Carte.

source: Currently, there aren’t any maps here. To add one click the *Create a New Map* button and a map composition interface will display.
fr: Actuellement, il n'y a pas de cartes ici. Pour en ajouter une cliquez sur *Create a New Map* et une interface poula creation des cartes va s' afficher .

source: *Maps Editor*
fr: Carte editor

source: In this interface there is a toolbar, layer list, and map window. The map window contains the MapQuest OpenStreetMap layer by default. There are other service layers available here as well: Blue Marble, Bing Aerial With Labels, MapQuest, and OpenStreetMap.
fr: Dans cette interface, il y a une barre d'outils, une liste de couches et une fenêtre de la carte. La fenêtre de la carte contient la MapQuest OpenStreetMap par défaut. Il y a d'autre couches de service disponibles ici aussi: Blue Marble, Bing Aerial With Labels, MapQuest et OpenStreetMap.

source: Click on the *New Layers* button and select *Add Layers*.
fr: Cliquez sur le bouton *New Layers* et séléctionnez *Add layers*

source: *Add Layers*
fr: Ajoutez des couches

source: Now you should be able to see all the availabel layers. In your case, this should only be the ones you’ve added before (San Andreas?).
fr: Maintenant vous devriez voir tous les couches disponibles. Dans votre cas, il devraient être seulement ceux que vous avez ajouté avant. (San Andreas?)

source: Select all of the layers by clicking the top entry and **Shift-clicking** the bottom one. Click *Add Layers* to add them all to the map.
fr: Séléctionnez tous les couches en cliquant sur l'entrée supèrieure et **Shift-clicking** celui du bas. Cliquez *Add layers* pour les ajouter tous à la carte.

source: The layers will be added to the map. Click *Done* (right next to *Add Layers* at the bottom) to return to the main layers list.
fr: La couche sera ajouté à la carte. Cliquez *Done* (juste à coté de *Add Layers* en bas) pour retourner à la liste principale des couches.

source: To save the map click on the Map button in the toolbar, and select *Save Map*.
fr: Pour sauvegarder la carte cliquez sur le bouton de la carte dans la barre d'outils.

source: *Save Map*
fr: Sauvegarder la carte

source: Enter a title and abstract for your map.
fr: Entrez un titre et un résumé pour votre carte.

source: *Edit Map Metadata*
fr: Editez une carte de métadonnées.

source: Click *Save*. Notice that the link on the top right of the page changed to reflect the map’s name.
fr: Cliquez *Save*. Notez que le lien en haut de la page a changé pour refléter le nom de la carte

source: This link contains a permalink to your map. If you open this link in a new window, your map will appear exactly as it was saved.
fr: Ce lien contient un permalink à votre carte. Si vous ouvrez ce lien dans une nouvelle fenêtre, votre carte apparaîtra exactement comme elle a été enregistrée.

source: 4. Share your map
fr: 4. Partagez votre carte

source: Now let’s finish our map.
fr: Finissons notre carte.

source: Check the box next to the **highway** layer to activate it. If it is not below the **POI** layer in the list, click and drag it down.
fr: Vérifie la carte à coté de la couche *highway* pour l'activer. Si il n'est pas sous le niveau *POI* dans la liste, cliquez et faites-le glisser en bas.

source: *Activate Layers on Map*
fr: Activez les couches sur la carte.

source: Make any final adjustments to the map composition as desired, including zoom and pan settings.
fr: Faites chaques modifications finale à la composition de la carte en incluant des zooms et réglages du pan.

source: Click the *Map* button in the toolbar, and then click *Publish Map*.
fr: Cliquez sur le bouton * Carte * dans la barre d'outils, puis cliquez sur Publier * Carte * .

source: *Publish Map button*
fr: Publier le bouton Carte

source: The title and abstract as previously created should still be there. Make any adjustments as necessary, and click *Save*.
fr: Le titre et le résumé précédemment créés devraient être encore là. Faire les ajustements si nécessaire, et cliquez sur *Save*

source: A new dialog will appear with instructions on how to embed this map in a web page, including a code snippet. You can adjust the parameters as necessary.
fr: Une nouvelle boîte de dialogue apparaîtra avec des instructions sur la façon d'intégrer cette carte dans une page Web; cette instructions va comprende aussi un extrait de code. Vous pouvez régler les paramètres comme nécessaire.

source: *Publish the Map*
fr: *Publier la Carte*

source: Your map can now be shared!
fr: Votre carte peut maintenant être partagé!

source: To be continued
fr: À suivre

source: Now you’ve gotten a quick insight in the possibilities of GeoNode. To learn more about GeoNode and its features, visit the official webpage `www.geonode.org <www.geonode.org>`_.
fr: Vous avez juste obtenu un aperçu rapide dans les possibilités de GeoNode. Pour en savoir plus sur GeoNode et ses fonctionnalités, visiter le site officiel `www.geonode.org <www.geonode.org>`_.

source: Stay in touch with the GeoNode community through the #geonode IRC channel using `http://webchat.freenode.net/ <http://webchat.freenode.net/>`_ or by asking your question in our `google group <https://groups.google.com/forum/#!forum/geonode-users>`_!
fr: Restez en contact avec la communauté de GeoNode par la voie #geonode IRC en utilisant `cet adresse <http://webchat.freenode.net/>`_ ou en demandant à votre question dans notre groupe `google <https://groups.google.com/forum/#!forum/geonode-users>`_ !

source: A Tour Of GeoNode
fr: Une visite de GeoNode

source: In order to get started, let’s look at the GeoNode interface and get a feel for how to navigate around it.
fr: Pour commencer, on va voir l'interface de GeoNode afin d'obtenir une precise idée de ce que on peut fair avec lui-même.

source: The GeoNode web interface is the primary method of interacting with GeoNode as a user. From this interface, one can view and modify existing spatial layers and maps, as well as find information on other GeoNode users.
fr: L'interface web de GeoNode est la principale méthode d'interaction avec GeoNode meme pour un utilisateur. De cette interface, on peut voir et modifier couches spatiales et des cartes existantes, ainsi que trouver des informations sur les autres utilisateurs de GeoNode.

source: Without being logged in, you are limited to read-only access of public layers.
fr: Sans être connecté, vous êtes limité à accès en lecture seulement des couches publics.

source: Navigate to your GeoNode instance (online demo available `here <http://demo.geonode.org/>`_):
fr: Accédez à votre instance de GeoNode (démonstration en ligne disponible `ici <http://demo.geonode.org/>`_):

source: This page shows a variety of information about the current GeoNode instance. At the top of the page is a toolbar showing quick links to view `layers <http://docs.geonode.org/en/latest/tutorials/users/layers/index.html#layers>`_, `maps <http://docs.geonode.org/en/latest/tutorials/users/maps/index.html#maps>`_, documents (metadata), `people <http://docs.geonode.org/en/latest/tutorials/users/accounts/index.html#accounts>`_, and a search field. Below this is a listing of recently updated layers, including abstract, owner, rating, and download button (if available).
fr: Cette page montre une variété d'informations sur cette instance de GeoNode . En haut de la page il y a une barre d'outils montrant des liens rapides pour afficher les `couches < http://docs.geonode.org/en/latest/tutorials/users/layers/index.html#layers~~number=plural >`_, les`cartes < http : //docs.geonode.org/en/latest/tutorials/users/maps/index.html#maps >`_, les documents (métadonnées), les `gens <http://docs.geonode.org/en/latest/tutorials/users/accounts/index.html#accounts>`_, et une outil de recherche. En dessous se trouve une liste des couches récemment mise à jour, en comprenant le bouton de téléchargement (si disponible) et des autres informations relatives a les couches meme.

source: Click Explore button and choose Preview. Table data could be visualized as: Grid, Graph or Map.
fr: Maintenant, cliquez sur le bouton Explore et choisissez Preview. Des données qui ne sont pas geospatiales (**Table data**) peuvent être visualisées en: Grille, Graphique ou Carte.

source: *Explore Layers page*
fr: Explorez la page des Couches

source: This page shows all layers known to GeoNode, available in either List or Grid viewing. Layers can be sorted by Most Recent, Most Popular, or Most Shared. Also available are a list of categories, with which layers can be connected with.
fr: Cette page montre toutes les couches conneus pour GeoNode, il est disponibles en visualisation de Liste ou Grille. Les couches peuvent être triés par les plus récentes, les plus populaires, ou les plus partagée. Est également disponibles une liste de catégories, qui on peut utilisè pour classer le couches.

source: Find a layer and click on its name.
fr: Trouvez une couche et cliquez sur son nom .

source: *Viewing a layer*
fr: En regardant une couche

source: A layer viewing page will display, with the layer itself superimposed on a hosted base layer (in this case `MapQuest OpenStreetMap <http://open.mapquest.com/>`_). Explore this page, noting the various options available to you.
fr: Une page de visualisation de la couche affichera, avec la couche elle meme superposée à une couche de base hébergé (dans ce cas `MapQuest OpenStreetMap < http://open.mapquest.com/ >`_ ). Explorez cette page, en notant les diverses options disponibles pour vous.

source: Now click the Maps link in the tool bar to go to the Explore Maps page.
fr: Maintenant, cliquez sur les liens des cartes dans la barre d'outils pour accéder à la page **Explorer Maps**.

source: *Explore Maps page*
fr: *Page Découvrez des Cartes*

source: This page shows all maps known to GeoNode, available with similar viewing options as with the layers. Currently, there are no maps here, but we will create one later on in the workshop.
fr: Cette page montre toutes les cartes gérés par GeoNode, disponibles avec des options de visualisation similaire aus options disponibles pour le couches. Actuellement, il n'y a pas de cartes ici, mais nous allons en créer une plus tard dans ce Workshop.

source: Click the Search link in the toolbar to bring up the Search page.
fr: Cliquez sur le lien Search dans la barre d'outils pour faire apparaître la page de recherche.

source: *Search page*
fr: *Page de Recherche*

source: This page contains a wealth of options for customizing a search for various information on this GeoNode instance. While a simple search box is available at the top of every page, this search form allows for much more fine-tuned searches.
fr: Cette page contient une multitude d'options de personnalisation d'une recherche de diverses informations sur cette instance de GeoNode. Une boîte de recherche simple est disponible en haut de chaque page, ce formulaire de recherche permet de faire des recherches plus precise.

source: Now that you are familiar with the basic interface, the next step is to create your own account so you manage some GeoNode resources of your own.
fr: Maintenant que vous êtes familier avec l'interface de base, la prochaine étape est de créer votre propre compte afin de gérer certaines ressources GeoNode de votre propre.

source: This section introduces the GeoNode GUI and functionalities through a step-by-step workshop.
fr: Cette section présente la GUI de GeoNode et ses fonctionnalités à travers de plusieurs des étapes.

source: At the end of this module the users will be familiar with the GeoNode default GUI and objects.
fr: À la fin de cette section, les utilisateurs seront familiers avec l'interface graphique et les differents outils fourni par GeoNode.

source: The Big Picture
fr: An Aperçu

source: *GeoNode Component Architecture*
fr: *Architecture des composants de GeoNode*
