Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/001_overview_and_ref.po
Languages: fr

source: Since pycsw is embedded in GeoNode, layers published within GeoNode are automatically published to pycsw and discoverable via CSW. No additional configuration or actions are required to publish layers, maps or documents to pycsw.
fr: Alors que pycsw est intégré dans GeoNode, les couches publiées dans GeoNode sont automatiquement publiés à pycsw et détectable via CSW . Aucune configuration supplémentaire ou d'actions est tenus de publier des couches, des cartes ou des documents à pycsw .

source: Discovery
fr: Découverte

source: GeoNode’s CSW endpoint is deployed available at ``http://localhost:8000/catalogue/csw`` and is available for clients to use for standards-based discovery. See http://docs.pycsw.org/en/latest/tools.html for a list of CSW clients and tools.
fr: CSW le critère de GeoNode est déployé disponible à ``http://localhost:8000/catalogue/csw`` et est disponible pour les clients à utiliser pour la découverte basée sur des normes. Voir http://docs.pycsw.org/en/latest/tools.html pour une liste de clients et d'outils CSW .

source: Javascript in GeoNode
fr: Javascript dans GeoNode

source: GeoNode provides a number of facilities for interactivity in the web browser built on top of several high-quality JavaScript frameworks:
fr: GeoNode fournit un certain nombre d'installations pour l'interactivité dans le navigateur Web intégré sur le dessus de plusieurs frameworks JavaScript de haute qualité :

source: `Bootstrap <http://getbootstrap.com/>`_ for GeoNode's front-end user interface and common user interaction.
fr: `Bootstrap <http://getbootstrap.com/>`_ pour l'interface graphique de GeoNode et l'interaction commune avec l'utilisateur final.

source: `Bower <http://bower.io/>`_ for GeoNode's front-end package management.
fr: `Bower <http://bower.io/>`_ pour la gestion des paquets de l'interface graphique de GeoNode.

source: `ExtJS <http://extjs.com/>`_ for component-based UI construction and data access
fr: `ExtJS <http://extjs.com/>`_ pour la construction et les données interface utilisateur l'accès à base de composants

source: `OpenLayers <http://openlayers.org/>`_ for interactive mapping and other geospatial operations
fr: `OpenLayers <http://openlayers.org/>`_ pour la cartographie interactive et d'autres opérations géospatiales

source: `GeoExt <http://geoext.org/>`_ for integrating ExtJS with OpenLayers
fr: `GeoExt <http://geoext.org/>`_ pour intégrer ExtJS avec OpenLayers

source: `Grunt <http://gruntjs.com/>`_ for front-end task automation.
fr: `Grunt <http://gruntjs.com/>`_ pour l'automatisation des tâches frontal .

source: `GXP <http://projects.opengeo.org/gxp>`_ for providing some higher-level application building facilities on top of GeoExt, as well as improving integration with GeoServer.
fr: `GXP <http://projects.opengeo.org/gxp>`_ pour fournir certains de niveau supérieur la construction d'installations d'application sur le dessus de GeoExt, ainsi que l'amélioration de l'intégration avec GeoServer .

source: `jQuery <http://jquery.com>`_ to abstract javascript manipulation, event handling, animation and Ajax.
fr: `jQuery <http://jquery.com>`_ à la manipulation abstraite javascript, la gestion des événements, l'animation et l'Ajax

source: GeoNode uses application-specific modules to handle pages and services that are unique to GeoNode. This framework includes:
fr: GeoNode utilise des modules spécifiques à l'application pour gérer les pages et services qui sont uniques à GeoNode . Ce cadre comprend :

source: A `GeoNode mixin <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/js/extjs/GeoNode-mixin.js>`_ class that provides GeoExplorer with the methods needed to properly function in GeoNode. The class is responsible for checking permissions, retrieving and submitting the `CSRF token <https://docs.djangoproject.com/en/dev/ref/contrib/csrf/>`_, and user authentication.
fr: `GeoNode mixin <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/js/extjs/GeoNode-mixin.js>`_ classe qui fournit GeoExplorer avec les méthodes nécessaires pour fonctionner correctement dans GeoNode . La classe est responsable de la vérification des autorisations, la récupération et la présentation de la `CSRF jeton <https://docs.djangoproject.com/en/dev/ref/contrib/csrf>`_, l'authentification et de l'utilisateur.

source: A `search module <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/search>`_ responsible for the GeoNode's site-wide search functionality.
fr: Au `module de recherche <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/search>`_ responsable de la fonctionnalité de recherche de l'ensemble du site de la GeoNode .

source: An `upload and status module <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/upload>`_ to support file uploads.
fr: Un `téléchargement et l'etat du module <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/upload>`_ pour soutenir les téléchargements de fichiers .

source: `Template files <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/templates>`_ for generating commonly used html sections.
fr: `Template files <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/templates>`_ pour générer sections html couramment utilisés .

source: A `front-end testing module <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/tests>`_ to test GeoNode javascript.
fr: Un `front-end testing module <https://github.com/GeoNode/geonode/tree/master/geonode/static/geonode/js/tests>`_ pour tester GeoNode javascript .

source: The following concepts are particularly important for developing on top of the GeoNode's JavaScript framework.
fr: Les concepts suivants sont particulièrement importants pour le développement avec ​​le cadre JavaScript deGeoNode.

source: Components
fr: Composants

source: Ext components handle most interactive functionality in "regular" web pages. For example, the scrollable/sortable/filterable table on the default Search page is a Grid component. While GeoNode does use some custom components, familiarity with the idea of Components used by ExtJS is applicable in GeoNode development.
fr: Composants Ext gére la fonctionnalité la plus interactive dans les pages web «réguliers» . Par exemple, le tableau triable filtrables défilement / / sur la page de recherche par défaut est une composante de la grille . Alors que GeoNode fait utiliser certains composants personnalisés, la familiarité avec l'idée de composants utilisés par ExtJS est applicable dans le développement de GeoNode .

source: Viewers display interactive maps in web pages, optionally decorated with Ext controls for toolbars, layer selection, etc. Viewers in GeoNode use the GeoExplorer base class, which builds on top of GXP's Viewer to provide some common functionality such as respecting site-wide settings for background layers. Viewers can be used as components embedded in pages, or they can be full-page JavaScript applications.
fr: Les téléspectateurs affiche des cartes interactives dans les pages Web, éventuellement décorée avec des contrôles de Ext pour les barres d'outils, la sélection de la couche, etc. téléspectateurs dans GeoNode utilisent la classe de base GeoExplorer, qui construit sur ​​le dessus de l'Observateur de GXP de fournir des fonctionnalités communes telles que le respect des paramètres au niveau du site pour couches de fond . Les téléspectateurs peuvent être utilisés comme composants embarqués dans les pages, ou ils peuvent être en pleine page des applications JavaScript .

source: Controls are tools for use in OpenLayers maps (such as a freehand control for drawing new geometries onto a map, or an identify control for getting information about individual features on a map.) GeoExt provides tools for using these controls as ExtJS "Actions" - operations that can be invoked as buttons or menu options or associated with other events.
fr: Les contrôles sont des outils à utiliser dans les cartes d'OpenLayers (comme une commande à main levée pour dessiner de nouvelles géométries sur une carte, ou un identifient commande pour obtenir des informations sur les caractéristiques individuelles sur une carte. ) GeoExt fournit des outils pour l'utilisation de ces contrôles ExtJS "Actions " - opérations qui peuvent être invoqués comme des boutons ou des options de menu ou associés à d'autres événements.

source: :ref:`architecture` is based on a set of core tools and libraries that provide the building blocks on which the application is built. Having a basic understanding of each of these components is critical to your success as a developer working with GeoNode.
fr: :ref:`architecture` est basé sur un ensemble d'outils de base et les bibliothèques qui fournissent les blocs de construction sur lequel l'application est construite . Avoir une compréhension de base de chacun de ces composants est essentiel à votre succès en tant que développeur travaillant avec GeoNode.

source: Lets look at each of these components and discuss how they are used within the GeoNode application.
fr: On va regarder chacun de ces composants et discuter comment ils sont utilisés dans l'application de GeoNode.

source: GeoNode is based on Django_ which is a high level Python web development framework that encourages rapid development and clean pragmatic design. Django is based on the Model View Controller (MVC_) architecture pattern, and as such, GeoNode models layers, maps and other modules with Django's Model_ module and and these models are used via Django's ORM_ in views which contain the business logic of the GeoNode application and are used to drive HTML templates to display the web pages within the application.
fr: GeoNode est basée sur Django_ qui est un cadre de développement web en Python de haut niveau qui encourage le développement rapide et la conception pragmatique propre. Django est basé sur le Modèle -Vue-Contrôleur ( MVC_ ) modèle de l'architecture, et que de tels modèles, de GeoNode couches, des cartes et d'autres modules avec le module Model_ de Django et et ces modèles sont utilisés par ORM_ de Django dans les vues qui contiennent la logique métier de l'application de GeoNode et sont utilisés pour conduire des modèles HTML pour afficher les pages Web au sein de l'application .

source: GeoServer_ is a an open source software server written in Java that provides OGC compliant services which publish data from many spatial data sources. GeoServer is used as the core GIS component inside GeoNode and is used to render the layers in a GeoNode instance, create map tiles from the layers, provide for downloading those layers in various formats and to allow for transactional editing of those layers.
fr: GeoServer_ est un serveur d'un logiciel open source écrit en Java qui fournit des services conformes de l'OGC qui publient des données provenant de nombreuses sources de données spatiales . GeoServer est utilisé comme composant de base de l'intérieur GeoNode SIG et est utilisé pour rendre les couches dans une instance de GeoNode, créer des tuiles de carte de couches, de fournir pour le téléchargement de ces couches dans divers formats et pour permettre l'édition transactionnelle de ces couches

source: GeoExplorer_ is a web application, based on the GeoExt_ framework, for composing and publishing web maps with OGC and other web based GIS Services. GeoExplorer is used inside GeoNode to provide many of the GIS and cartography functions that are a core part of the application.
fr: GeoExplorer_ est une application web, basé sur le cadre GeoExt_, pour composer et publier des cartes Web avec l'OGC et d'autres services basés sur le Web SIG . GeoExplorer est utilisé à l'intérieur GeoNode de fournir bon nombre des fonctions SIG et cartographie qui sont une partie essentielle de l'application .

source: PostgreSQL and PostGIS
fr: PostgreSQL et PostGIS

source: PostgreSQL_ and PostGIS_ are the database components that store and manage spatial data and information for GeoNode and the django modules that it is composed of, pycsw and GeoServer. All of these tables and data are stored within a geonode database in PostgreSQL. GeoServer uses PostGIS to store and manage spatial vector data for each layer which are stored as a separate table in the database.
fr: PostgreSQL_ et PostGIS_ sont les composants de base de données qui stockent et gèrent les données et informations spatiales pour GeoNode et les modules de Django qu'il est composé de, pycsw et GeoServer . Toutes ces tables et les données sont stockées dans une base de données de geonode dans PostgreSQL . GeoServer utilise PostGIS pour stocker et gérer les données de vecteur spatial pour chaque couche qui sont stockées dans un tableau séparé dans la base de données .

source: pycsw_ is an OGC CSW server implementation written in Python. GeoNode uses pycsw to provide an OGC compliant standards-based CSW metadata and catalogue component of spatial data infrastructures, supporting popular geospatial metadata standards such as Dublin Core, ISO 19115, FGDC and DIF.
fr: pycsw_ est une implémentation du serveur OGC CSW écrit en Python . GeoNode utilise pycsw de fournir un composant de métadonnées OGC CSW et le catalogue basé sur des normes conformes des infrastructures de données spatiales, en soutenant les normes de métadonnées géospatiales populaires tels que Dublin Core, ISO 19115, FGDC et le DIF .

source: Geospatial Python Libraries
fr: Bibliotèques spatiales de Python

source: GeoNode leverages several geospatial python libraries including gsconfig_ and OWSLib_. gsconfig is used to communicates with GeoServer's REST Configuration API to configure GeoNode layers in GeoServer. OWSLib is used to communicate with GeoServer's OGC services and can be used to communicate with other OGC services.
fr: GeoNode exploite plusieurs bibliothèques python géospatiales dont gsconfig_ et OWSLib_ . gsconfig est utilisé pour communique avec REST API de configuration de GeoServer pour configurer des couches de GeoNode dans GeoServer . OWSLib est utilisé pour communiquer avec les services de l'OGC de GeoServer et peut être utilisé pour communiquer avec d'autres services de l'OGC .

source: GeoNode uses a set of Django plugins which are usually referred to as pluggables. Each of these pluggables provides a particular set of functionality inside the application from things like Registration and Profiles to interactivity with external sites. Being based on Django enables GeoNode to take advantage of the large ecosystem of these pluggables out there, and while a specific set is included in GeoNode itself, many more are available for use in applications based on GeoNode.
fr: GeoNode utilise un ensemble de plugins Django qui sont habituellement désignés comme modules enfichables . Chacun de ces modules enfichables fournit un ensemble particulier de fonctionnalité dans l'application des choses comme l'inscription et Profils d' interactivité avec les sites externes . Étant basé sur Django permet GeoNode pour profiter du grand écosystème de ces modules enfichables là-bas, et tout un ensemble spécifique est inclus dans GeoNode lui-même, beaucoup d'autres sont disponibles pour une utilisation

source: jQuery_ is a feature-rich javascript library that is used within GeoNode to provide an interactive and responsive user interface as part of the application. GeoNode uses several jQuery plugins to provide specific pieces of functionality, and the GeoNode development team often adds new features to the interface by adding additional plugins.
fr: jQuery est une bibliothèque JavaScript riche en fonctionnalités qui est utilisée dans les GeoNode pour fournir une interface utilisateur interactive et réactive dans le cadre de l'application . GeoNode utilise plusieurs plugins jQuery pour fournir des pièces spécifiques de fonctionnalité, et l'équipe de développement de GeoNode ajoute souvent de nouvelles fonctionnalités à l'interface en ajoutant des plugins supplémentaires

source: Bootstrap_ is a front-end framework for laying out and styling the pages that make up the GeoNode application. It is designed to ensure that the pages render and look and behave the same across all browsers. GeoNode customizes bootstraps default style and its relatively easy for developers to customize their own GeoNode based site using existing Boostrap themes or by customizing the styles directly.
fr: Bootstrap_ est un cadre frontal pour la pose et le style des pages qui composent l'application de GeoNode . Il est conçu pour veiller à ce que les pages rendent et de regarder et de se comporter de la même dans tous les navigateurs . GeoNode personnalise le style bootstraps par défaut et son relativement facile pour les développeurs de personnaliser leur propre site sur la base de GeoNode utilisant des thèmes Boostrap existants ou en adaptant directement les styles .

source: Reference Doc
fr: Référence Doc

source: In this section, you will find information about each and every component of GeoNode, for example *GeoServer*, *GeoNode Settings*, *Security*, etc.
fr: Dans cette section, vous trouverez des informations sur chaque composant de GeoNode, par exemple *GeoServer*, *Paramètres de configuration de GeoNode*, *Sécurité*, etc.

source: Getting Started With Django
fr: Mise en route de Django

source: Object-relational mapper
fr: Objet-relationnel mappeur

source: Deﬁne your data models entirely in Python. You get a rich, dynamic database-access API for free — but you can still write SQL if needed.
fr: Définissez vos modèles de données entièrement en Python. Vous obtenez une riche base de données API - accès, dynamique gratuitement - mais vous pouvez toujours écrire SQL si nécessaire

source: Models
fr: Modèles

source: A model is the single, definitive source of information about your data. It contains the essential fields and behaviors of the data you’re storing. Generally, each model maps to a single database table.
fr: Un modèle est la source unique et définitive de l'information sur vos données. Elle contient les champs essentiels et les comportements des données que vous stockez. En règle générale, chaque modèle correspond à un tableau de base de données unique .

source: The basics:
fr: Les bases:

source: Each model is a Python class that subclasses ``django.db.models.Model``.
fr: Chaque modèle est une classe Python qui sous-classe ``django.db.models.Model`` .

source: Each attribute of the model represents a database field.
fr: Chaque attribut du modèle représente un champ de base de données.

source: With all of this, Django gives you an automatically-generated database-access API; see :ref:`making_queries`.
fr: Avec tout cela, Django vous donne une base de données API d'accès généré automatiquement; voir :ref:`making_queries`.

source: Quick example
fr: Exemple Rapide

source: This example model defines a ``Person``, which has a **first_name** and **last_name**:
fr: Ce modèle d' exemple définit une ``Person``, qui a un nom et un prénom

source: **first_name** and **last_name** are fields of the model. Each field is specified as a class attribute, and each attribute maps to a database column.
fr: **first_name** et **last_name** sont des champs du modèle. Chaque champ est défini comme un attribut de classe, et chaque attribut cartes à une colonne de base de données

source: The above ``Person`` model would create a database table like this:
fr: Le modèle ``Person`` ci-dessus serait de créer une table de base de données comme ceci:

source: Some technical notes:
fr: Quelques notes techniques:

source: The name of the table, **myapp_person**, is automatically derived from some model metadata but can be overridden.
fr: Le nom de la table, **myapp_person**, est automatiquement dérivé de certaines métadonnées de modèle mais peut être surpassé

source: An **id** field is added automatically, but this behavior can be overridden.
fr: Un **id** champ est ajouté automatiquement, mais ce comportement peut être modifié.

source: The **CREATE TABLE** SQL in this example is formatted using PostgreSQL syntax, but it’s worth noting Django uses SQL tailored to the database backend specified in your settings file.
fr: Le **CREATE TABLE** dans cet exemple est formaté en utilisant la syntaxe de PostgreSQL, mais il est intéressant de noter que Django utilise SQL adapté au backend de base de données spécifié dans votre fichier de paramètres.

source: Using models
fr: En utilisant des modèles

source: Once you have defined your models, you need to tell Django you’re going to use those models. Do this by editing your settings file and changing the **INSTALLED_APPS** setting to add the name of the module that contains your **models.py**.
fr: Une fois que vous avez défini vos modèles, vous devez dire à Django que vous allez utiliser ces modèles. Faites cela en éditant votre fichier de paramètres et de modifier le réglage **INSTALLED_APPS** pour ajouter le nom du module qui contient votre **models.py** .

source: For example, if the models for your application live in the module **myapp.models** (the package structure that is created for an application by the **manage.py startapp** script), **INSTALLED_APPS** should read, in part:
fr: Par exemple, si les modèles de votre application vivent dans le module **myapp.models** (la structure du package qui est créé pour une application par le startapp manage.py **script**), **INSTALLED_APPS** devraient lire, en partie:

source: When you add new apps to **INSTALLED_APPS**, be sure to run **manage.py migrate**, optionally making migrations for them first with **manage.py makemigrations**.
fr: Lorsque vous ajoutez de nouvelles applications à **INSTALLED_APPS**, assurez-vous d' exécuter **manage.py migrate**, éventuellement faire des migrations pour eux d'abord avec **manage.py makemigrations** .

source: GeoNode has specific commands and shortcuts wich can be called through the **manage.py** class
fr: GeoNode a des commandes spécifiques et les raccourcis wich peut être appelé par la classe **manage.py**

source: Fields
fr: Champs

source: The most important part of a model – and the only required part of a model – is the list of database fields it defines. Fields are specified by class attributes. Be careful not to choose field names that conflict with the models API like **clean**, **save**, or **delete**.
fr: La partie la plus importante d'un modèle - et la seule partie obligatoire d'un modèle est la liste des domaines, il définit la base de données . Les champs sont spécifiés par les attributs de classe . Soyez prudent de ne pas choisir des noms de champs qui sont en conflit avec l'API des modèles comme **clean**, **save**, or **delete**.

source: Example:
fr: Exemples

source: More: `Field Types <https://docs.djangoproject.com/en/1.8/topics/db/models/#field-types>`_
fr: Plus : `Types de champs <https://docs.djangoproject.com/en/1.8/topics/db/models/#field-types>`_

source: Model methods
fr: Méthodes de modèle

source: Define custom methods on a model to add custom “row-level” functionality to your objects. Whereas **Manager** methods are intended to do “table-wide” things, model methods should act on a particular model instance.
fr: Définir des méthodes de mesure sur un modèle personnalisé pour ajouter des fonctionnalités **de niveau ligne** à vos objets. Considérant que **Gestionnaire** méthodes visent à faire des choses "table-large",les méthodes de modèle devraient agir sur une instance de modèle particulier.

source: This is a valuable technique for keeping business logic in one place – the model.
fr: Ceci est une technique précieuse pour garder la logique métier en un seul endroit - le modèle .

source: For example, this model has a few custom methods:
fr: Par exemple, ce modèle a quelques méthodes personnalisées :
