Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/001_overview_and_ref.po
Languages: fr

source: GeoNode core is based on DJango web framework with few more dependencies necessary for the communication with the geospatial servers (GeoServer, pyCSW)
fr: GeoNode est développé en utilisant le cadre web Django avec quelques dépendances nécessaires à la communication avec les serveurs géospatiales (par example GeoServer, pyCSW)

source: On the left side you can see the list of *Entities* defined in GeoNode and managed by the DJango ORM framework. Those objects will be detailed in a future section.
fr: Sur le côté gauche vous pouvez voir la liste des *Entities* définies dans GeoNode et gérés par le framework Django ORM. Ces objets seront détaillées dans une section a venir.

source: On the right side the list of *Services* available allowing GeoNode to communicate with the *social* world.
fr: Sur le côté droit de la liste des *Services* disponibles qu'on permet a GeoNode de communiquer avec le monde *social*

source: The GeoNode catalog is strictly connected to the GeoServer one (see the bottom of the figure). The geospatial dataset and the OGC Services are implemented and managed by GeoServer. GeoNode acts as a broker for the geospatial layers, adding metdata information and tools that make easier the management, cataloging, mapping and searching of the datasets.
fr: GeoNode est strictement relié au GeoServer (voir le bas de la figur ). Les données géospatial et les services de l'OGC sont mis en œuvre et gérés par GeoServer. GeoNode agit comme un courtier pour les couches géospatiales, ajoutant des informations et des outils qui rendent plus facile la gestion, le catalogage, la cartographie et la recherche des données geospatiales.

source: Thanks to the ORM framework and the auxiliary Python libraries, GeoNode is constantly aligned with the GeoServer catalog. An ad-hoc security module allows the two modules to strictly interact and share security and permissions rules.
fr: Grace au cadre ORM et aux bibliothèques Python auxiliaires, GeoNode est constamment aligné avec le catalogue de GeoServer. Un module de sécurité ad-hoc permet aux deux applications d'interagir et de partager strictement les règles de sécurité et les autorisations des comptes.

source: In the advanced sections of this documentation we will go through GeoNode commands allowing administrators to re-sync the catalogs and keep them consistently aligned.
fr: Dans les sections avancées de cette documentation, on va passer par GeoNode commandes que permet aux administrateurs de re-synchroniser les catalogues et les garder constamment aligné.

source: GeoNode is based on `Django <www.djangoproject.com>`_ which is a high level Python web development framework that encourages rapid development and clean pragmatic design. Django is based on the Model View Controller (`MVC <http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller>`_) architecture pattern, and as such, GeoNode models layers, maps and other modules with Django’s `Model <https://docs.djangoproject.com/en/1.4/topics/db/models/>`_ module and and these models are used via Django’s `ORM <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ in views which contain the business logic of the GeoNode application and are used to drive HTML templates to display the web pages within the application.
fr: GeoNode est basée sur `Django <www.djangoproject.com>`_ qui est un cadre de développement web en Python de haut niveau qui encourage le développement rapide et la conception pragmatique propre. Django est basé sur le paradigme Modèle-Vue-Contrôleur (`MVC <http://en.wikipedia.org/wiki/Model%E2%80%93view%E2%80%93controller>`_) de l'architecture, donc les modèles des couches, des cartes et d'autres modules de GeoNode avec Django `Model <https://docs.djangoproject.com/en/1.4/topics/db/models/>`_ module et ces modèles sont utilisés par des `ORM <http://en.wikipedia.org/wiki/Object-relational_mapping>`_ dans les vues qui contiennent la logique métier de l'application de GeoNode et sont utilisés pour conduire des modèles HTML pour afficher les pages Web au sein de l'application.

source: Django explained with model/view/controller (`MVC <http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html>`_)
fr: Django expliqué avec le modèle/view/contrôleur paradigme (`MVC <http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html>`_)

source: Model represents application data and provides rich ORM functionality.
fr: Le modèle représente les données d'application et fournit de riches fonctionnalités ORM.

source: Views are a rendering of a Model most often using the Django template engine.
fr: Les vues sont une représentation d'un Modèle, plus souvent en utilisant le moteur de template de Django .

source: In Django, the controller part of this commonly discussed, layered architecture is a subject of discussion. According to the standard definition, the controller is the layer or component through which the user interacts and model changes occur.
fr: In Django, le contrôleur est le composant à travers lequel on peut interagir avec le modèle.

source: *Model, View, Presenter*
fr: Modèle, Vue, Présentateur

source: In MVP, the *Presenter* contains the UI business logic for the *View*. All invocations from the *View* delegate directly to the *Presenter*. The *Presenter* is also decoupled directly from the *View* and talks to it through an interface. This is to allow mocking of the *View* in a unit test. One common attribute of MVP is that there has to be a lot of two-way dispatching. For example, when someone clicks the *Save* button, the event handler delegates to the *Presenter*'s *OnSave* method. Once the save is completed, the *Presenter* will then call back the *View* through its interface so that the *View* can display that the save has completed.
fr: Dans MVP, le *Présentateur* contient la logique de l'interface utilisateur (la *ue*). Toutes les invocations de la vue le délégue directement au *Présentateur* . Le Présentateur est également découplé directement à partir de *Vue* et parle à travers une interface. Un attribut commun de MVP est qu'il doit y avoir beaucoup d'échange d'informations dans les deux sens. Par exemple, quand quelqu'un clique sur le bouton *Save*, les délégués la gestion d'événement à la méthode de *OnSave Présentateur*. Une fois la sauvegarde terminée, le Présentateur rappelera la *Vue* grâce à son interface de sorte que la *Vue* puisse visualiser que la sauvegarde est terminée.

source: MVP tends to be a very natural pattern for achieving separated presentation in Web Forms.
fr: MVP est un paradigme très naturel pour la réalisation de la présentation séparée dans les formulaires Web.

source: **Two primary variations** (You can `find out more about both variants <http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&referringTitle=bundles>`_.)
fr: **Deux variations primaires** ( Vous pouvez `en savoir plus sur les deux variantes <http://www.codeplex.com/websf/Wiki/View.aspx?title=MVPDocumentation&referringTitle=bundles>`_.)

source: **Passive View:** The View is as dumb as possible and contains almost zero logic. The Presenter is a middle man that talks to the View and the Model. The View and Model are completely shielded from one another. The Model may raise events, but the Presenter subscribes to them for updating the View. In Passive View there is no direct data binding, instead the View exposes setter properties which the Presenter uses to set the data. All state is managed in the Presenter and not the View.
fr: **Vue passive:** La vue est la plus simple et contient près de zéro logique. Le présentateur est un *middle man* qui parle à la vue et au modèle. La vue et le modèle sont complètement à l'abri de l'autre. Le modèle peut déclencher des événements et le présentateur souscrit à eux pour mettre à jour la vue. Dans la vue passive, il n'y a pas pas de données directes, au lieu dexposer les propriétés setter laquelle le présentateur utilise pour définir les données. L'Etat est géré dans le Présentateur et pas dans la vue.

source: *Pro:* maximum testability surface; clean separation of the View and Model
fr: * Pro : * surface de testabilité maximale ; séparation nette de la vue et du modèle

source: *Con:* more work (for example all the setter properties) as you are doing all the data binding yourself.
fr: * Con : * plus de travail ( par exemple toutes les propriétés de setter ) comme vous le faites vous-même toutes les données de liaison .

source: **Supervising Controller:** The Presenter handles user gestures. The View binds to the Model directly through data binding. In this case it's the Presenter's job to pass off the Model to the View so that it can bind to it. The Presenter will also contain logic for gestures like pressing a button, navigation, etc.
fr: **Contrôleur surveillant:** Le Présentateur gère les gestes de l'utilisateur. The View se lie au modèle directement à travers la liaison de données . Dans ce cas, il est le travail de l'animateur de faire passer le modèle à la vue de sorte qu'il peut se lier à elle . Le Présentateur contiendra également logique pour les gestes comme appuyant sur un bouton, la navigation, etc.

source: *Pro:* by leveraging databinding the amount of code is reduced.
fr: *Pro:* en tirant parti de liaison de données, la quantité de code est réduite .

source: *Con:* there's less testable surface (because of data binding), and there's less encapsulation in the View since it talks directly to the Model.
fr: *Con:* il y a moins de surface testables (en raison de la liaison de données ), et il y a moins d'encapsulation dans la vue car il parle directement au modèle .

source: In the MVC, the Controller is responsible for determining which View is displayed in response to any action including when the application loads.
fr: Dans le MVC, le contrôleur est chargé de déterminer quelle *Vue* est affichée en réponse à chaque action de l'application.

source: This differs from MVP where actions route through the View to the Presenter. In MVC, every action in the View correlates with a call to a Controller along with an action. In the web each action involves a call to a URL on the other side of which there is a Controller who responds. Once that Controller has completed its processing, it will return the correct View. The sequence continues in that manner throughout the life of the application:
fr: Cela diffère de MVP où les actions route à travers la vue sur le présentateur. Dans MVC, chaque action dans la Vue va générer un appel à un contrôleur avec une action. Chaque action implique un appel à une URL ou se trouve un contrôleur qui répond. Une fois que le contrôleur a terminé son travail, il va retourner la vue finale. La séquence va continuer de cette manière tout au long de la vie de l'application:

source: One other big difference about MVC is that the View does not directly bind to the Model. The view simply renders, and is completely stateless. In implementations of MVC the View usually will not have any logic in the code behind. This is contrary to MVP where it is absolutely necessary as if the View does not delegate to the Presenter, it will never get called.
fr: Une grande différence à propos de MVC est que la Vue n'interagir pas directement avec le modèle. La vue fait simplement le travail de afficher des informations et il n'a aucun d'etat. Donc avec le paradigme MVC la vue ne va pas avoir de la logique dans son interieur. Ceci est au contraire à MVP parce-que si la vue ne délègue pas au présentateur, il ne sera jamais appelé.

source: Presentation Model
fr: Modèle de Présentation

source: One other pattern to look at is the Presentation Model pattern. In this pattern there is no Presenter. Instead the View binds directly to a **Presentation Model**. The Presentation Model is a Model crafted specifically for the View. This means this Model can expose properties that one would never put on a domain model as it would be a violation of separation-of-concerns. In this case, the Presentation Model binds to the domain model, and may subscribe to events coming from that Model. The View then subscribes to events coming from the Presentation Model and updates itself accordingly. The Presentation Model can expose commands which the view uses for invoking actions. The advantage of this approach is that you can essentially remove the code-behind altogether as the PM completely encapsulates all of the behaviour for the view.
fr: Une autre tendance à regarder est le paradigm **Présentation Modèle**. Dans ce modèle il n'y a pas Présentateur . Au lieu de la vue se lie directement un **Modèle de Présentation**. La présentation est un modèle créé spécifiquement pour la vue. Cela signifie que ce modèle peut exposer les propriétés que l'on aurait jamais mis sur un modèle de domaine, car il serait une violation de la separation-of-concerns. Dans ce cas, le modèle de présentation se lie au modèle de domaine, et peut souscrire à des événements provenant de ce modèle. The View souscrit alors à des événements à venir à partir du modèle et se met à jour en conséquence Présentation . Le modèle de présentation peut exposer le point de vue des commandes qui utilise pour invoquer actions. L'avantage de cette approche est que vous pouvez essentiellement supprimer le code -behind tout à fait que le PM encapsule complètement tous le comportement de la vue.

source: This pattern is a very strong candidate for use in WPF applications and is also called `Model-View-ViewModel <http://msdn.microsoft.com/en-us/magazine/dd419663.aspx>`_.
fr: Ce modèle est un candidat très solide pour une utilisation dans les applications WPF et est aussi appelé `Model-View-ViewModel <http://msdn.microsoft.com/en-us/magazine/dd419663.aspx>`_.

source: More: `http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html <http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html>`_
fr: Plus : `http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html <http://reinout.vanrees.org/weblog/2011/12/13/django-mvc-explanation.html>`_

source: *Web Server Gateway Interface (whis-gey)*
fr: * Serveur Web Gateway Interface ( whis - Gey ) *

source: This is a python specification for supporting a common interface between all of the various web frameworks and an application (Apache, for example) that is ‘serving’.
fr: Ceci est une spécification de python pour supporter une interface commune entre tous les différents frameworks web et une application (Apache, par exemple) qui est ‘serving’.

source: This allows any WSGI compliant framework to be hosted in any WSGI compliant server.
fr: Cela permet à tout cadre compatible WSGI à être *hosted* dans un serveur compatible WSGI.

source: For most GeoNode development, the details of this specification may be ignored.
fr: Pour la plupart de développement de GeoNode, les détails de cette spécification peuvent être ignorés.

source: More: `http://en.wikipedia.org/wiki/Wsgi <http://en.wikipedia.org/wiki/Wsgi>`_
fr: Plus : `http://en.wikipedia.org/wiki/Wsgi <http://en.wikipedia.org/wiki/Wsgi>`_

source: GeoNode and GeoServer
fr: GeoNode et GeoServer

source: GeoNode uses GeoServer for providing OGC services.
fr: GeoNode utilise GeoServer pour fournir des services de l'OGC.

source: At its core, GeoNode provides a standards-based platform to enable integrated, programmatic access to your data via OGC Web Services, which are essential building blocks required to deploy an OGC-compliant spatial data infrastructure (SDI). These Web Services enable discovery, visualization and access your data, all without necessarily having to interact directly with your GeoNode website, look and feel/UI, etc.
fr: À sa base, GeoNode fournit une plateforme basée sur des standards *well-known* pour permettre l'accès programmatique intégrée à vos données via des services Web de l'OGC, qui sont des éléments essentiels nécessaires pour déployer une infrastructure de données spatiales (SDI) conformes à l'OGC. Ces services Web permettent la découverte, la visualisation et le téléchargement des vos données, sans avoir nécessairement à interagir directement avec votre site de GeoNode.

source: GeoNode configures GeoServer via the REST API
fr: GeoNode configure GeoServer via l'API REST

source: GeoNode retrieves and caches spatial information from GeoServer. This includes relevant OGC service links, spatial metadata, and attribute information.
fr: GeoNode récupère et met en cache les informations spatiales provenant de GeoServer. Cela inclut des liens pertinents OGC de services, les métadonnées spatiales, et des informations d'attributs .

source: In summary, GeoServer contains the layer data, and GeoNode’s layer model extends the metadata present in GeoServer with its own.
fr: GeoServer contient les données des couches et le modèle de la couche de GeoNode étend les métadonnées présents dans GeoServer avec son propre.

source: GeoNode can discover existing layers published in a GeoServer via the WMS capabilities document.
fr: GeoNode peut découvrir couches publiées dans un GeoServer via le document de capacités WMS (GetCapabilities).

source: GeoServer delegates authentication and authorization to GeoNode.
fr: GeoServer délégue l'authentification et l'autorisation à GeoNode

source: Data uploaded to GeoNode is first processed in GeoNode and finally published to GeoServer (or ingested into the spatial database).
fr: Les données chargées dans GeoNode sont d'abord élaborée dans GeoNode et enfin publiées à GeoServer (ou ingérées dans la SGBD).

source: operate over HTTP (GET, POST)
fr: Ils fonctionnent sur HTTP ( GET, POST )

source: provide a formalized, accepted API
fr: Ils fournisse une API formalisée et largement accepté

source: provide formalized, accepted formats
fr: Ils fournissent des formats accepté formalisée

source: The OGC Web Services provided by GeoNode have a mature implementation base and provide an multi-application approach to integration. This means, as a developer, there are already numerous off-the-shelf GIS packages, tools and webapps (proprietary, free, open source) that natively support OGC Web Services.
fr: Les OGC Web Services fournis par GeoNode ont une base de mise en œuvre mature et fournissent une approche multi-application à l'intégration. Cela signifie, en tant que développeur, il ya déjà de nombreuses off -the-shelf SIG paquets, des outils et des webapps (exclusif, gratuit, open source) qui prennent en charge nativement les services Web de l'OGC.

source: There are numerous ways to leverage OGC Web Services from GeoNode:
fr: Il existe de nombreuses façons d' utiliser des services Web de l'OGC de GeoNode:

source: web-based application
fr: application Web

source: client libraries / toolkits
fr: bibliothèques client / toolkits

source: custom development
fr: développement personalisèe

source: Your GeoNode lists OGC Web Services and their URLs at ``http://localhost:8000/developer``. You can use these APIs directly to interact with your GeoNode.
fr: Votre GeoNode répertorie OGC Web Services et de leurs URL à "``http://localhost:8000/developer``. Vous pouvez utiliser ces API directement pour interagir avec votre GeoNode

source: The following sections briefly describe the OGC Web Services provided by GeoNode.
fr: Les sections suivantes décrivent brièvement les OGC Web Services fournis par GeoNode.

source: WMS provides an API to retrieve map images (PNG, JPEG, etc.) of geospatial data. WMS is suitable for visualization and when access to raw data is not a requirement.
fr: WMS fournit une API pour récupérer des images de carte ( PNG, JPEG, etc.) de données géospatiales . WMS est adapté pour la visualisation et lorsque l'accès aux données brutes n'est pas obligatoire .

source: WFS provides provides an API to retrieve raw geospatial vector data directly. WFS is suitable for direct query and access to geographic features.
fr: WFS fournit une API pour récupérer des données brutes vectorielles géospatiales directement . WFS est adapté pour la requête directe et l'accès à des caractéristiques géographiques .

source: WCS provides provides an API to retrieve raw geospatial raster data directly. WCS is suitable for direct access to satellite imagery, DEMs, etc.
fr: WCS fournit une API pour récupérer des données brutes raster géospatiales directement . WCS est adapté pour un accès direct à l'imagerie par satellite, MNE, etc.

source: CSW provides an interface to publish and search metadata (data about data). CSW is suitable for cataloguing geospatial data and making it discoverable to enable visualization and access.
fr: CSW fournit une interface pour publier et rechercher des métadonnées ( données sur les données ) . CSW est adapté pour le catalogage des données géospatiales et le rend détectable afin de permettre la visualisation et l'accès .

source: WMTS provides an API to retrive pre-rendered map tiles of geospatial data.
fr: WMTS fournit une API pour tuiles de carte pré-rendus de données géospatiales .

source: WMC provides a format to save and load map views and application state via XML. This allows, for example, a user to save their web mapping application in WMC and share it with others, viewing the same content.
fr: WMC fournit un format pour enregistrer et charger des vues de carte et l'état de l'application via XML . Ceci permet, par exemple, un utilisateur d'enregistrer leur application de cartographie Web dans WMC et de le partager avec d'autres, la visualisation de la même teneur .

source: More: `http://geoserver.org <http://geoserver.org>`_
fr: Plus: `http://geoserver.org <http://geoserver.org>`_

source: GeoNode and PostgreSQL/PostGIS
fr: GeoNode et PostgreSQL/PostGIS

source: In production, GeoNode is configured to use PostgreSQL/PostGIS for it’s persistent store. In development and testing mode, often an embedded sqlite database is used. The latter is not suggested for production.
fr: Dans la production, GeoNode est configuré pour utiliser PostgreSQL / PostGIS pour sa mémoire persistante . Dans le développement et le mode de test, souvent une base de données SQLite intégrée est utilisée . Ce dernier n'a pas suggéré pour la production .

source: The database stores configuration and application information. This includes users, layers, maps, etc.
fr: La configuration de base de données stocke des informations et de l'application. Cela inclut les utilisateurs, des couches, des cartes, etc.

source: It is recommended that GeoNode be configured to use PostgresSQL/PostGIS for storing vector data as well. While serving layers directly from shapefile allows for adequate performance in many cases, storing features in the database allows for better performance especially when using complex style rules based on attributes.
fr: Il est recommandé que GeoNode soit configuré pour utiliser PostgreSQL / PostGIS pour stocker des données vectorielles ainsi . Tout en se servant directement à partir de couches shapefile permet une performance adéquate dans de nombreux cas, le stockage caractéristiques dans la base de données permet une meilleure performance, surtout lors de l'utilisation des règles de style complexes basés sur des attributs .

source: GeoNode and pycsw
fr: GeoNode et pycsw

source: GeoNode is built with pycsw embedded as the default CSW server component.
fr: GeoNode est construit avec pycsw. pycsw est utilitsè pour fournir les fonctionnalités de serveur CSW par défaut.
