Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/002_install_and_admin.po
Languages: fr

source: Linux Admin Intro
fr: Intro de Admin Linux

source: This part of the documentation contains basic instruction on how to setup and manages Virtual Machine.
fr: Cette partie de la documentation contient des instructions de base sur comment installer et gèrer la Machine virtuelle.

source: System Preparation & Prerequisites
fr: Préparation du système & préalables

source: VM configuration
fr: Configuration de la VM

source: Reccomended VM parameters
fr: Paramètres Reccomandés VM

source: Listed below you will find the recommended parameters for the GeoNode Virtual Machine for both development and production environments.
fr: Énumérés ci-dessous, vous trouverez les paramètres recommandés pour la Machine virtuelle GeoNode pour les environnements de développement et de production.

source: Recommended minimal config
fr: Configuration minimale recommandée

source: Prod (recommended config)
fr: Prod (configuration recommandée)

source: For testing purposes: - 1 CPU with 2 cores - RAM: 4GB - Disk space: 30GB
fr: Pour des fins de test: - 1 CPU avec 2 cœurs - RAM: 4 Go - espace disque : 30 Go

source: This configuration is not enough for a minimal production environment, adding more CPUs or cores is required.
fr: Cette configuration n'est pas suffisante pour un environnement de production minimale, ajouter plus de processeurs ou cores est nécessaire.

source: Ubuntu Basic Tutorial
fr: Tutoriel Ubuntu Basic

source: `Ubuntu <https://en.wikipedia.org/wiki/Ubuntu_(operating_system)>`_ is one of the most widespread `Linux <https://en.wikipedia.org/wiki/Linux>`_ `Distributions <https://en.wikipedia.org/wiki/Linux_distribution>`_ .
fr: `Ubuntu <https://en.wikipedia.org/wiki/Ubuntu_(operating_system)>`_ est l'un des plus répendu `Linux <https://en.wikipedia.org/wiki/Linux>`_ `Distributions <https://en.wikipedia.org/wiki/Linux_distribution>`_.

source: In this section of the documentation you will learn how to do basic operations in Ubuntu such as Log inand Log out, Launch applications and Install new software.
fr: Dans cette section de la documentation, vous apprendrez comment faire les opérations de base dans Ubuntu comme inand Log Log out, lancer des applications et installer de nouveaux logiciels.

source: User Login
fr: Nom de connexion

source: When you first start Ubuntu, at the end of the boot process you see the Ubuntu login screen
fr: Lorsque vous commencez à Ubuntu, à la fin de la procédure de démarrage, vous voyez l'écran de connexion Ubuntu

source: Select the user you want to login as, enter the password and press `Enter`. In a few second the user's desktop will appear.
fr: Sélectionnez l'utilisateur que vous voulez connecter en tant que, entrez le mot de passe et appuyez sur `Enter`. En quelques secondes, son bureau s'affiche.

source: User Interface Walkthrough
fr: Procédure d'Interface utilisateur

source: The panel on the left side of the screen contains shortcuts to frequently used application. From dark grey bar at the top you can reach network settings (the icon with two arrows pointing in opposite directions) system language (the icon with `En` written inside it), audio volume, system date and time and power menu (top right corner with an icon half way between a gear and power buttom).
fr: Le panneau sur le côté gauche de l'écran contient des raccourcis vers des applications fréquemment utilisées. Des barre gris foncé en haut, vous pourrez rejoindre des paramètres réseau (l'icône avec deux flèches pointant dans des directions opposées) langue du système (l'icône avec `En` écrit à l'intérieur de l'il), volume sonore, date et heure et puissance menu (en haut à droite avec une icône à mi-chemin entre un buttom vitesse et puissance) du système.

source: From the power menu you can switch to a different user, logout, power off the system or access system settings.
fr: Dans le menu de puissance, vous pouvez basculer vers un autre utilisateur, logout, mise hors tension du panneau de configuration système ou l'accès.

source: In `system setting ` menu you can set several different parameters for the system
fr: Dans le menu `réglage système`, vous pouvez définir plusieurs paramètres différents pour le système

source: Launch an application
fr: Lancer l'application

source: You can launch the applications listed in the `Favourites` panel simply by clicking on them.
fr: Vous pouvez lancer les applications répertoriées dans le panneau `Favoris` simplement en cliquant dessus.

source: If the application you want to launch is not in the favourites panel, use the Ubuntu Launcher. Click on the Ubuntu Launcher icon in the top left corner of the screen
fr: Si l'application que vous souhaitez lancer n'est pas dans le panneau favoris, utilisez le lanceur d'Ubuntu. Cliquez sur l'icône du lanceur d'Ubuntu dans le coin supérieur gauche de l'écran

source: Write down the name of the application. A list of applications matching the name you are searching will show up, for and press `Enter` or click on the icon of the application.
fr: Notez le nom de l'application. Une liste des applications correspondantes au nom recherché apparaîtra, appuyez sur `Enter` ou cliquez sur l'icône de l'application.

source: Install new software
fr: Installer de nouveaux logiciels

source: To install new software, open the `Ubuntu software Center` (you will find it in the favourite applications panel).
fr: Pour installer le nouveau logiciel, ouvrez le `Ubuntu software Center` (vous le trouverez dans le panneau applications favorites).

source: Enter the name of the application you are looking for in the search bar
fr: Entrez le nom de l'application que vous recherchez dans la barre de recherche

source: A list of candidate applications will appear. Click on the one you want to install, then click `install` to install it. You will be prompted for administrative password
fr: Liste des applications de candidat apparaît. Cliquez sur celui que vous voulez installer, puis cliquez sur `install` pour l'installer. Vous serez invité pour le mot de passe administratif

source: And your application will be installed in the system.
fr: Et votre application sera installée dans le système.

source: Launch the terminal emulator
fr: Lancez l'émulateur de terminal

source: Click on the `Ubuntu Launcher` icon in the top left corner of the screen, and type gnome-terminal in the search box
fr: Cliquez sur l'icône `Ubuntu Launcher` dans le coin supérieur gauche de l'écran et tapez gnome-terminal dans la zone de recherche

source: And launch the terminal emulator.
fr: Et lancez l'émulateur de terminal.

source: Terminal emulator will open and will be ready for your commands.
fr: Émulateur de terminal s'ouvrira et sera prêt pour vos commandes.

source: Basic commands
fr: Commandes de base

source: Current working directory
fr: Répertoire de travail courant

source: The `pwd` command will show you your `working directory`, that is the directory you are inside of and running your commands in.
fr: La commande `pwd` vous montrera votre répertoire de `travail`, c'est-à-dire le répertoire dans lequel vous etes et l' exécution de vos commandes.

source: Create a directory
fr: Créer un dossier

source: To create a new directory inside your working directory use the `mkdir` command followed by the folder name argument
fr: Pour créer un nouveau répertoire à l'intérieur de votre répertoire de travail utilisez la commande `mkdir` suivie de l'argument de nom de dossier

source: Delete a directory
fr: Supprimer un répertoire

source: To delete an empty directory type `rmdir` followed by the folder name argument
fr: Pour supprimer un répertoire vide de type `rmdir` suivi de l'argument de nom de dossier

source: Create an empty file
fr: Créez un fichier vide

source: To create an empty file in your current working directory use the `touch` command followed by the name of the file
fr: Pour créer un fichier vide dans votre répertoire de travail courant utilisez la commande `touch` suivie du nom du fichier

source: Delete a file
fr: Effacer un fichier

source: To delete a file use the `rm` command followed by the file name
fr: Pour supprimer un fichier, utilisez la commande `rm` suivie du nom de fichier

source: Change working directory
fr: Changement de répertoire de travail.

source: To change your current working directory use the `cd` command followed by the `path` (location) you want to change to
fr: Pour modifier votre utilisation de répertoire de travail courant la commande `cd` suivie par le `chemin` (emplacement) que vous souhaitez modifier à

source: List content of a folder
fr: Contenu de la liste d'un dossier

source: The `ls` command will list the content of your current working directory. You can optionally provide a path to a directory as argument, in that case `ls` will show you the content of that directory ::
fr: La commande `ls` liste le contenu de votre répertoire de travail courant. Vous pouvez éventuellement fournir un chemin d'accès vers un répertoire comme argument, dans ce cas `ls` va vous montrer le contenu de ce répertoire ::

source: Home folder
fr: Dossier personnel

source: A user's home folder is the folder where he or she will do most of the operations in. Inside your home folder you can freely create or delete file and folders.
fr: Le dossier de départ de l'utilisateur est le dossier où il ou elle va faire la plupart des opérations. À l'intérieur de votre dossier de départ, vous pouvez librement créer ou supprimer des fichiers et dossiers.

source: To switch to your home folder you can use the tilde `~` character as a shortcut ::
fr: Pour basculer vers votre dossier de départ, vous pouvez utiliser la touche tilde "~" caractère comme raccourci::

source: For more information on Ubuntu refer to the `Ubuntu user manual <http://ubuntu-manual.org/?lang=en>`_
fr: Pour plus d'informations sur Ubuntu, reportez-vous au `manuel utilisateur Ubuntu <http://ubuntu-manual.org/?lang=en>`_

source: For more terminal commands read the `Using the terminal <https://help.ubuntu.com/community/UsingTheTerminal>`_ guide
fr: Pour plus de commandes de terminaux lisent le `Utiliser le guide terminal <https://help.ubuntu.com/community/UsingTheTerminal>`_

source: Finish installation
fr: Terminez l'installation

source: In previous sections you' ve setup all the applications we need to run GeoNode.
fr: Dans les articles précédents vous avez installé toutes les applications que nous avons besoin d'exécuter GeoNode.

source: In this section we are going to `glue` all the pieces together and finalize GeoNode setup.
fr: Dans cette section, nous allons `coller` tous les morceaux ensemble et finaliser le programme d'installation GeoNode.

source: GeoNode Configuration
fr: Configuration de GeoNode

source: Now that all applications have been configured we are going to instruct GeoNode on how to connect to `PostgreSQL` and `GeoServer`. Also we are going to instruct GeoNode on who is allowed to connect to it.
fr: Maintenant que toutes les applications ont été configurées, nous allons montrer à GeoNode comment se connecter à `PostgreSQL` et `GeoServer`. Nous allons également instruire GeoNode sur qui est autorisé à se connecter à lui.

source: This will instruct GeoNode to listen on connections from your local machine.
fr: Cela demandera à GeoNode d'écouter des connexions de l'ordinateur local.

source: Create GeoNode Superuser
fr: Créer GeoNode super-utilisateur

source: You will be prompted for the username, email address and passoword for the user
fr: On vous demandera l'utilisateur, adresse e-mail et password pour l'utilisateur

source: Initialize the Database
fr: Initialiser la base de données

source: If you get an error message it is likely that database access is not set properly. Check you pg_hba.conf file and GeoNode `local_settings.py` file. Remember to restart PostgreSQL to make any changes to pg_hba.conf effective.
fr: Si vous obtenez un message d'erreur, il est probable que l'accès de base de données n'est pas défini correctement. Vous consulter pg_hba.conf fichier et le fichier `local_settings.py` GeoNode. N'oubliez pas de redémarrer PostgreSQL pour apporter des modifications à pg_hba.conf efficace.

source: Test the installation
fr: Tester l'installation

source: Open the browser and navigate to http://localhost/
fr: Ouvrez le navigateur et accédez à http://localhost/

source: GeoNode User interface will show up. Login with admin username and password you just set.
fr: L'Interface utilisateur de GeoNode s'affichera. Connexion avec un nom d'utilisateur admin et mot de passe que vous venez de mettre.

source: Now open the main menu and click on `GeoServer`
fr: Maintenant, ouvrez le menu principal et cliquez sur `GeoServer`

source: You will be redirected to GeoServer user interface. You will automatically be logged in as administrator in GeoServer.
fr: Vous allez être redirigé vers l'interface utilisateur de GeoServer. Vous serez automatiquement connecté tant qu'administrateur dans GeoServer.

source: Create GeoNode DB
fr: Créer GeoNode DB

source: In this section we are going to setup users and databases for GeoNode in PostgreSQL.
fr: Dans cette section nous allons setup les utilisateurs et les bases de données pour GeoNode à PostgreSQL.

source: Users and Permissions
fr: Utilisateurs et autorisations

source: First create the `geonode` user. GeoNode is going to use this user to access the database::
fr: Tout d'abord créer l'utilisateur `geonode`. GeoNode va utiliser cet utilisateur pour accéder à la base de données::

source: You will be prompted asked to set a password for the user. Enter `geonode` as password
fr: On vous demandera de définir un mot de passe pour l'utilisateur. Entrez `geonode` comme mot de passe

source: Create `geonode` database with owner `geonode`::
fr: Créer la base de données `geonode` avec propriétaire `geonode`::

source: And database `geonode_data` with owner `geonode`::
fr: Et base de données `geonode_data`, propriétaire `geonode`::

source: Switch to user `postgres` and create PostGIS extension::
fr: Basculer vers utilisateur `postgres` et créer l'extension PostGIS::

source: Then adjust permissions::
fr: Puis ajuster les autorisations::

source: And switch back to the 'geo' user::
fr: Et revenez à l'utilisateur `geo`::

source: Now we are going to change user access policy for local connections in file `pg_hba.conf`::
fr: Maintenant, nous allons changer de stratégie d'accès d' utilisateur pour les connexions locales dans fichier `pg_hba.conf`::

source: If your PostgreSQL database resides on a separate machine, you have to allow remote access to the databases in the pg_hba.conf for the `geonode` user and tell PostgreSQL to accept non local connections in your `postgresql.conf` file
fr: Si votre base de données PostgreSQL réside sur un ordinateur distinct, vous devez autoriser l'accès distant aux bases de données dans le pg_hba.conf pour l'utilisateur `geonode` et dire PostgreSQL pour accepter des connexions non locales dans votre fichier `postgresql.conf`

source: GeoNode (v\ |release|) installation on Ubuntu 14.04
fr: GeoNode (|release| v) installation sur Ubuntu 14.04

source: This part of the documentation describes the complete setup process for GeoNode on an Ubuntu 14.04 machine. The end of this section of the documentation also describes how to automate the installation and comfiguration of GeoNode using `Ansible <http://www.ansible.com/>`_.
fr: Cette partie de la documentation décrit le processus complet d'installation pour GeoNode sur une machine Ubuntu 14.04. La fin de cette section de la documentation décrit également comment automatiser l'installation et la comfiguration de l'utilisation de GeoNode `Ansible <http://www.ansible.com/>`_.

source: Install GeoNode Application
fr: Installez l'Application GeoNode

source: In this section you are going to install all the basic packages and tools needed for a complete GeoNode installation.
fr: Dans cette section, vous allez installer tous les paquets de base et les outils nécessaires pour une installation complète de GeoNode.

source: Login
fr: Connexion

source: When you first start the Virtual Machine at the end of the boot process you will be prompted for the user password to login. Enter `geo` as user password and press `Enter`.
fr: Lorsque vous démarrez la Machine virtuelle à la fin de la procédure de démarrage, on vous demandera le mot de passe utilisateur pour vous connecter. Entrez `geo` comme mot de passe utilisateur et appuyez sur `Enter`.

source: You are now logged in as user 'geo'. On the left side of the screen there is a panel with shortcuts to common applications, launch a the terminal emulator.
fr: Vous êtes maintenant connecté en tant qu'utilisateur `geo`. Sur le côté gauche de l'écran, il y a un panneau avec des raccourcis vers des applications courantes, lancer l'émulateur de terminal.

source: Packages Installation
fr: Installation de paquets

source: First we are going to install all the software packages we are going to need for the GeoNode setup. Among others `Tomcat 7`, `PostgreSQL`, `PostGIS`, `Apache HTTP server` and `Git`. Run the following command to install all the packages::
fr: Tout d'abord, nous allons installer tous les packages de logiciels, que nous allons avoir besoin pour l'installation de GeoNode. Parmi d'autres `Tomcat 7`, `PostgreSQL`, `PostGIS`, `Apache HTTP server` et `Git`. Exécutez la commande suivante pour installer tous les paquets::

source: You will be prompted for `geo` user's password (`geo`) and for confirmation twice
fr: Vous serez invité pour le mot de passe de l'utilisateur `geo` (`geo`) et confirmer deux fois

source: The installation process is going to take a few minutes.
fr: Le processus d'installation va prendre quelques minutes.

source: At this point we have all the packages we need on the system.
fr: À ce stade, nous avons tous les paquets que nous avons besoin sur le système.

source: GeoNode Setup
fr: Programme d'installation GeoNode

source: Let's download GeoNode from the main GeoNode repository on GitHub:
fr: Nous allons télécharger GeoNode à partir du principal dépôt de GeoNode sur GitHub :

source: For the purpose of this training the GeoNode repository has been downloaded and placed in the `geonode` user `home folder` (/home/geo/geonode). *Skip* the following command group.
fr: Dans le but de cette formation le GeoNode référentiel a été téléchargé et placé dans le `geonode` utilisateur `dossier` (/home/geo/geonode). *Passer* le groupe de commande suivant.

source: Move into the project folder ::
fr: Déplacer vers le dossier projet::

source: And install GeoNode
fr: Et installer GeoNode

source: For the purpose of this training GeoNode python packages has been downloaded and installed, *Skip* the following command:
fr: Dans le but de cette formation python GeoNode paquets a été téléchargé et installé, *Passer* la commande suivante :

source: The following command will download a GeoServer web archive that we are going to use in GeoServer setup:
fr: La commande suivante va télécharger une archive web GeoServer que nous allons utiliser dans la configuration de GeoServer :

source: Again, for the purpose of this training the GeoServer web archive has been downloaded. *Skip* the following command.
fr: Encore une fois, dans le but de cette formation, l'archive web de GeoServer a été téléchargé. *Passer* la commande suivante.

source: In the next section we are going to setup PostgreSQL Databases for GeoNode
fr: Dans la section suivante, nous allons à l'installation de bases de données PostgreSQL pour GeoNode

source: Install GeoServer Application
fr: Installez l'Application GeoServer

source: In this section we are going to setup GeoServer for GeoNode. GeoServer will run inside `Tomcat` sevrlet container.
fr: Dans cette section nous allons configurer GeoServer pour GeoNode. GeoServer s'exécute à l'intérieur du conteneur sevrlet `Tomcat`.

source: Setup GeoServer
fr: Installer GeoServer

source: Tomcat will extract GeoServer web archive and start GeoServer. This may take some time
fr: Tomcat va extraire l'archive web de GeoServer et commencer GeoServer. Cela peut prendre un certain temps

source: Open a web browser (in this example `Firefox`) and navigate to http://localhost:8080/geoserver
fr: Ouvrez un navigateur web (dans cet exemple, `Firefox`) et naviguez jusqu'à http://localhost:8080/geoserver

source: In a few seconds GeoServer web interface will show up:
fr: Dans le web de GeoServer, l' interface apparaîtra dans quelques secondes :

source: GeoNode authentication integration
fr: Intégration de l'authentification GeoNode

source: All we need to do now is to integrate GeoNode authentication so that GeoNode administrator will b able to access and administer GeoServer as well.
fr: Tout ce que nous devons faire maintenant est d'intégrer l'authentification GeoNode pour que l'administrateur de GeoNode soit en mesure d'accéder et d'administrer GeoServer ainsi b.

source: Stop GeoServer::
fr: Arrêter GeoServer ::

source: If GeoServer is installed on machine that is separate from the one running GeoNode, change the `GEONODE_BASE_URL` value accordingly
fr: Si GeoServer est installé sur la machine qui est séparé de GeoNode en cours d'exécution, remplacez la valeur de `GEONODE_BASE_URL` en conséquence

source: Setup & Configure HTTPD
fr: Installation & configuration HTTPD

source: In this section we are going to setup Apache HTTP to serve GeoNode.
fr: Dans cette section nous allons configurer Apache HTTP pour servir de GeoNode.

source: Apache Configuration
fr: Configuration d'Apache

source: This sets up a VirtualHost in Apache HTTP server for GeoNode and a reverse proxy for GeoServer.
fr: Cela met en place un serveur virtuel du serveur HTTP Apache pour GeoNode et un proxy inverse pour GeoServer.

source: In the case that GeoServer is running on a separate machine change the `ProxyPass` and `ProxyPassReverse` accordingly
fr: Dans le cas où GeoServer s'exécute sur une machine séparée, modifier en conséquence le `ProxyPass` et `ProxyPassReverse`

source: Setup Using Ansible
fr: Installation à l'aide de Ansible

source: Using `Ansible <http://www.ansible.com/>`_ we can automate the installation and configuration of GeoNode on local or remote machines. If you never used Ansible before take a look at the `Running Ansible scripts` section of the documentation or `Ansible official docmumentation <https://docs.ansible.com/>`_
fr: À l'aide de `Ansible <http://www.ansible.com/>`_ nous pouvons automatiser l'installation et la configuration des GeoNode sur des ordinateurs locaux ou distants. Si vous avez jamais utilisé Ansible avant de jeter un oeil à la section `Ansible en cours d'exécution de scripts` de la documentation ou `Ansible officielle docmumentation <https://docs.ansible.com/>`_

source: GeoNode setup with Ansible
fr: GeoNode le programme d'installation avec Ansible

source: In the Virtual Machines we provided for the training come with Ansible preinstalled. In the `geo` user home folder ( /home/geo/ ) you will find a simple Ansible playbook we wrote for demonstration along with some resource files used by the playbook itself.
fr: Dans les Machines virtuelles, nous avons fourni une formation avec Ansible préinstallé. Dans le dossier de base de l'utilisateur `geo` ( /home/geo/ ) vous trouverez un playbook Ansible simple écrit pour la démonstration ainsi que certains fichiers de ressources utilisés par le playbook lui-même.

source: Ansible will run through the instructions in the playbook and setup GeoNode on your local machine.
fr: Ansible traversera les instructions de la playbook et le programme d'installation GeoNode sur votre ordinateur local.
