Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/002_install_and_admin.po
Languages: fr

source: change `geo` with the username to use for SSH login
fr: changer les `geo` avec le nom d'utilisateur à utiliser pour la connexion SSH

source: We asked ansible to connect to all the machine in our `Inventory` as user `geo` and run the `module` (modules are Ansible's units of work, more on that later..) ping. As you can see by the output, Ansible successfully connected to the remote machine and executed the module `ping`
fr: Nous avons demandé à ansible de se connecter à toutes les machine dans notre `stock` en tant qu'utilisateur `geo` et exécuter le `module` (les modules sont des unités de Ansible de travail, plus tard..) ping. Comme vous pouvez le voir par la sortie, Ansible correctement connecté à l'ordinateur distant et exécuter le module `ping`

source: Ad hoc commands
fr: Commandes ad hoc

source: An ad-hoc command is something that you might type in to do something really quick, but don’t want to save for later.
fr: Un commandement ad hoc est quelque chose que vous pouvez taper en faisant quelque chose de vraiment rapide, mais que vous ne voulez pas enregistrer plus tard.

source: Later you are going to write so called `Playbooks` with the commands to run on the controlled node but for learning purposes ad-hoc commands can be used to do quick things.
fr: Plus tard, vous allez écrire ce qu'on appelle `Playbooks` avec les commandes à exécuter sur le noeud contrôlé mais pour des fins d'apprentissage commandes ad hoc peuvent être utilisés pour faire des choses rapides.

source: One example of ad-hoc command is the ping command we just run. We typed in in the command line and run it interactively.
fr: La commande ping qu' il suffit d'exécuter en est un exemple de commande ad hoc. Nous avons tapé dans la ligne de commande et exécuter interactivement.

source: In this example we ran the `free` command on the remote hosts to get memory usage stats. Note that we used the `shell` module (-m flag) with the command as the argument (-a flag)
fr: Dans cet exemple, nous avons couru la commande `free` sur des hôtes distants à faire mémoire des statistiques d'utilisation. Notez que nous avons utilisé le module de `shell` (-m drapeau) avec la commande comme argument (-a drapeau)

source: File Transfer
fr: Transfert de fichiers

source: We used the `ansible` command to transfer the local file /home/geo/test to the remote node in user's home directory ('~/')
fr: Nous avons utilisé la commande `ansible` pour transférer le fichier local /home/geo/test vers le nœud distant dans le répertoire home de l'utilisateur ('~/')

source: Managing Packages
fr: Gestion des paquets

source: For example the previous command will install apache web server on the remote system (if not present).
fr: Par exemple la commande précédente va installer le serveur web apache sur le système distant (si non présente).

source: Managing Services
fr: Gestion des Services

source: (where `webserver` is a group defined in Ansible Inventory)
fr: (où `serveur Web` est un groupe défini dans l'inventaire Ansible)

source: Or stop it::
fr: Arrêter GeoServer ::

source: For more information on ad-hoc command refer to the `official documentation <https://docs.ansible.com/ansible/intro_adhoc.html>`_
fr: Pour plus d'informations sur ad hoc commande faites référence à la `documentation officielle <https://docs.ansible.com/ansible/intro_adhoc.html>`_

source: These were just a few of the modules avilable for ansible. See the `complete list <http://docs.ansible.com/ansible/list_of_all_modules.html>`_ available at Ansible web site
fr: Il s'agissait de quelques avilable de modules pour ansible. Voir la `liste complète <http://docs.ansible.com/ansible/list_of_all_modules.html>`_ site web Ansible à

source: Playbooks are Ansible’s configuration, deployment, and orchestration language.
fr: Playbooks sont des langues de configuration, de déploiement et d'orchestration de Ansible.

source: Playbooks are a completely different way to use ansible than in adhoc task execution mode, and are particularly powerful.
fr: Règles sont une manière complètement différente d'utiliser ansible qu'en mode d'exécution de tâches ad hoc et sont particulièrement puissants.

source: Playbooks can declare configurations, but they can also orchestrate steps of any manual ordered process.
fr: Playbooks peuvent déclarer des configurations, mais ils peuvent également orchestrer étapes de n'importe quel guide qui commande le processus.

source: While you might run the main /usr/bin/ansible program for ad-hoc tasks, playbooks are more likely to be kept in source control and used to push out your configuration or assure the configurations of your remote systems are in spec.
fr: Alors que vous pouvez exécuter le programme /usr/bin/ansible principal pour des tâches ponctuelles, playbooks sont plus susceptibles d'être conservées dans le contrôle de code source et utilisés pour faire sortir votre configuration ou assurer que les configurations de vos systèmes distants sont dans spec.

source: Playbooks languuage example
fr: Exemple de langue Playbooks

source: Playbooks are expressed in `YAML <https://en.wikipedia.org/wiki/YAML>`_ format
fr: Playbooks sont exprimés en `YAML <https://en.wikipedia.org/wiki/YAML>`_ format

source: Every Playbook begins with three dashes `---` at the very top of the file to indicate that this is a YAML file.
fr: Chaque Playbook commence par trois tirets "---" tout en haut du fichier pour indiquer qu'il s'agit d'un fichier YAML.

source: This example Playbook contains only one Play. the play is composed of three parts
fr: Cet exemple Playbook ne contient qu'un seul jeu. le jeu se compose de trois parties

source: tasks
fr: tâches

source: handlers
fr: Préposés à la manutention :

source: The hosts part specifies to wich hosts in the Inventory this playbook applies and how to connect to them
fr: La partie hôtes spécifie à wich hôtes dans l'inventaire quel playbook s'applique et comment communiquer avec eux

source: The tasks part describes the desired state or actions to perform on the hosts
fr: La partie des tâches décrit l'état souhaité ou les actions à effectuer sur les hôtes

source: The handlers part describes the handlers for this playbook (more on handlers later)
fr: La part des gestionnaires décrit les gestionnaires pour cette playbook (plus sur des gestionnaires plus tard)

source: In the example above there are three tasks. Each task has a name, a module and zero or more arguments for the module.
fr: Dans l'exemple ci-dessus, il y a trois tâches. Chaque tâche a un nom, un module et zéro ou plusieurs arguments pour le module.

source: The first task specifies that we want apache at the latest version installed on the system. This is accomplished by the `yum` module
fr: La première tâche spécifie que nous voulons apache à la dernière version installée sur le système. Ceci est accompli par le module `yum`

source: The second task specifies a configuration file for apache using a `template`. Template files for are written in `Jinja2 template language <http://jinja.pocoo.org/>`_
fr: La deuxième tâche spécifie un fichier de configuration d'apache à l'aide d'un `modèle`. Fichiers de modèle pour un écrits en `langage modèle Jinja2 <http://jinja.pocoo.org/>`_

source: The third task make sure apache web server is running using the `service` module.
fr: La troisième tâche assure que le serveur web apache s'exécute en utilisant le module de `service`.

source: When you run a Playbook, using the ansible-playbook command. Ansible will connect to the hosts specified in the hosts section and run the tasks one by one, in order.
fr: Lorsque vous exécutez un Playbook, en utilisant la commande ansible-playbook. Ansible va se connecter à l'hôte spécifié dans la section hôtes et exécuter les tâches une par une, dans l'ordre.

source: One or more tasks may have a `notify` section (just like the second task in our example). The `notify` actions are triggered at the end of each block of tasks in a playbook, and will only be triggered once even if notified by multiple different tasks. When triggered, the corresponding handler will be executed. In the example above the handler will restart Apache because we changed a config file
fr: Une ou plusieurs tâches peuvent avoir une section `notifier` (tout comme la deuxième tâche dans notre exemple). Les actions de `notifier` sont déclenchées à la fin de chaque bloc de tâches dans un playbook et seulement se déclenchera une fois même si avisé de plusieurs tâches différentes. Lors du déclenchement, le gestionnaire correspondant sera exécuté. Dans l'exemple ci-dessus le gestionnaire va redémarrer Apache, parce que nous avons modifié un fichier de config

source: Run a Playbook
fr: Exécuter un Playbook

source: This concludes our brief tutorial on Ansible. For a more thorough introduction refer the `official documentation <https://docs.ansible.com/>`_
fr: Ceci conclut notre bref tutoriel sur Ansible. Pour une introduction plus complète, consultez la `documentation officielle <https://docs.ansible.com/>`_

source: Alse, take a look at the `Ansible examples repository <https://github.com/ansible/ansible-examples>`_ for a set of Playbooks showing common techniques.
fr: Jetez un oeil aussi à la `référentiel exemples Ansible <https://github.com/ansible/ansible-examples>`_f pour un ensemble de Playbooks montrant les techniques courantes.

source: Running a VM with Vagrant
fr: Une machine virtuelle en cours d'exécution avec Vagrant

source: In this section you will find instructions on how to setup an Ubuntu 14.04 VM using `Vagrant`_
fr: Dans cette section, vous trouverez des instructions sur la façon de configurer une VM de 14.04 Ubuntu à l'aide de `Vagrant`_

source: Vagrant Setup
fr: Programme d'installation de Vagrant

source: Download Vagrant from the `official <https://www.vagrantup.com/downloads>`_ web site. Choose the installer matching your operating system and architecture.
fr: Télécharger Vagrant de la `officielle <https://www.vagrantup.com/downloads>`_ web site. Choisir le programme d'installation correspondant à votre système d'exploitation et l'architecture.

source: Installation process is straightforward, refer to Vagrant `official documentation <https://docs.vagrantup.com/v2/installation/index.html>`_ if you encounter any problem.
fr: Le processus d'installation est simple, consultez Vagrant `documentation officielle <https://docs.vagrantup.com/v2/installation/index.html>`_ si vous rencontrez n'importe quel problème.

source: At the end of the installation process log out your system and log back in.
fr: À la fin du processus d'installation déconnectez-vous de votre système et se reconnectez vous.

source: Vagrant is going to need a `provider <https://docs.vagrantup.com/v2/providers/>`_ in order to setup the Virtual Machines. `VirtualBox` is supported out of the box. Just make sure you install `one of the supported versions of VirtualBox <https://docs.vagrantup.com/v2/virtualbox>`_
fr: Vagrant aura besoin d'un `fournisseur <https://docs.vagrantup.com/v2/providers/>`_ afin de configurer des ordinateurs virtuels. `VirtualBox` est prise en charge hors de la boîte. Assurez-vous juste que vous installez `une des versions prises en charge de VirtualBox <https://docs.vagrantup.com/v2/virtualbox>`_

source: Open a terminal and type `vagrant version`. A message containing the installed version of Vagrant will be printed on the terminal ::
fr: Ouvrez un terminal et tapez `version Vagrants`. Un message contenant la version installée de Vagrant s'imprimera sur le terminal::

source: Virtual Machine Setup
fr: Configuration de la Machine virtuelle

source: Now that Vagrant is installed let's create our Ubuntu Virtual Machine. Open the terminal and create a new folder called `vagrand`. enter the folder and run ::
fr: Maintenant que Vagrant est installé nous allons créer notre Ubuntu Virtual Machine. Ouvrez le terminal et créer un nouveau dossier nommé `vagrant`. Entrez dans le dossier et exécutez::

source: This will create a configuration file called `Vagrantfile` containing the settings for the virtual machine, notably the `config.vm.box` variable set to "ubuntu/trusty32" will tell Vagrant the specific VM we want to run (Ubuntu 14.04 "Trusty Tahr", 32 bit version)
fr: Cela créera un fichier de configuration appelé `Vagrantfile` contenant les paramètres de la machine virtuelle, notamment la variable `config.vm.box` la valeur `ubuntu/trusty32` dira Vagrant le VM spécifique nous voulons exécuter (Ubuntu 14.04 `Tahr fidèle`, version 32 bits)

source: To start the VM, run ::
fr: Pour démarrer la machine virtuelle, exécutez::

source: The first time you run the command it is going to take some since you do not have a locally available image of the VM. Vagrant will download the VM from the `Vagrant Could <https://vagrantcloud.com/>`_ to your local system. ::
fr: La première fois que vous exécutez la commande ça va prendre un certain temps puisque vous n'avez pas une image disponible localement de la machine virtuelle. Vagrant va télécharger la machine virtuelle de `Vagrant Could <https://vagrantcloud.com/>`_ sur votre système local.::

source: At the end of the download process Vagrant will start the VM.
fr: À la fin de la procédure de téléchargement Vagrant va démarrer la machine virtuelle.

source: To access the Virtual machine, run ::
fr: Pour accéder à la machine virtuelle, exécutez::

source: You need an SSH client for the previous command to work. Most Linux distributions come with an SSH installed. If you are using Windows as the guest operating system install MinGW or Cygwin or Git to obtain a command line SSH client. More information available `here <http://docs-v1.vagrantup.com/v1/docs/getting-started/ssh.html>`_
fr: Vous avez besoin d'un client SSH pour la commande précédente pour travailler. La plupart des distributions Linux disposent d'un SSH installé. Si vous utilisez Windows comme l'installation de système d'exploitation invité MinGW ou Cygwin ou Git pour obtenir une ligne de commande SSH client. Plus d'informations disponibles `ici <http://docs-v1.vagrantup.com/v1/docs/getting-started/ssh.html>`_

source: You will be connected to the guest Virtual Machine over SSH as user `vagrant`.
fr: Vous serez connecté à l'invité d'ordinateur virtuel par SSH en tant qu'utilisateur `Vagrant`.

source: VM Setup with VirtualBox
fr: Configuration de la machine virtuelle avec VirtualBox

source: In this section you will find instructions on how to setup an Ubuntu 14.04 VM in `VirtualBox`_
fr: Dans cette section, vous trouverez des instructions sur la façon de configurer une VM Ubuntu de 14.04 dans `VirtualBox`_

source: VirtualBox Setup
fr: Installation de VirtualBox

source: Download Virtualbox from `official <https://www.virtualbox.org/wiki/Downloads>`_ web site. Choose the installer matching your operating system and architecture.
fr: Télécharger Virtualbox d `officielle <https://www.virtualbox.org/wiki/Downloads>`_ web site. Choisir le programme d'installation correspondant à votre système d'exploitation et l'architecture.

source: Installation process is straightforward, refer to VirtualBox `official documentation <https://www.virtualbox.org/manual/ch01.html#intro-installing>`_ if you encounter any problem.
fr: Le processus d'installation est simple, se référer à VirtualBox `documentation officielle <https://www.virtualbox.org/manual/ch01.html#intro-installing>`_ si vous rencontrez n'importe quel problème.

source: After you downloaded executable, double click on it to launch the installer.
fr: Après que vous avez téléchargé le fichier exécutable, double-cliquez dessus pour lancer l'installateur.

source: Customize VirtualBox features an paths if you need to or leave default ones
fr: Personnaliser les fonctionnalités de VirtualBox un chemins si vous devez ou laissez par défaut

source: And start the installation process
fr: Et lancer l'installation

source: Click on "Finish"
fr: Cliquez sur Finish.

source: VirtualBox is now installed. And will automatically be launched
fr: VirtualBox est maintenant installé. Et sera automatiquement lancé

source: After you downloaded the package, double click on it. The "Ubuntu Software Center" will pop up, click on "Install" to start the installation process
fr: Après avoir téléchargé le paquet, double-cliquez dessus. La `Ubuntu Software Center` sera pop-up, cliquez sur `Install` pour démarrer le processus d'installation

source: You will be prompted for administrator password.
fr: Vous serez invité pour le mot de passe administrateur.

source: At the end of the installation process, launch VirtualBox.
fr: À la fin du processus d'installation, lancez VirtualBox.

source: Now that VirtualBox is installed on the system it is time to setup our Ubuntu VM.
fr: Maintenant que VirtualBox est installé sur le système, il est temps d'installer notre VM Ubuntu.

source: Click the light blue `New` button in VirtualBox user interface.
fr: Cliquez sur le bouton `Nouveau` bleu clair dans l'interface utilisateur de VirtualBox.

source: Choose a name for the Virtual Machine and select the appropriate VM type and version
fr: Choisissez un nom pour l'ordinateur virtuel, puis sélectionnez le type approprié de VM et la version

source: Then select the amount of memory you want to assign to the VM, `Ubuntu recommends <https://help.ubuntu.com/community/Installation/SystemRequirements>`_ at least 512 MB of memory but we are going to need more than that to run GeoNode refer to `System Preparation & Prerequisites` sections for details.
fr: Sélectionnez ensuite la quantité de mémoire que vous souhaitez attribuer à la machine virtuelle, `Ubuntu recommande <https://help.ubuntu.com/community/Installation/SystemRequirements>`_ au moins 512 MB de mémoire, mais nous allons avoir besoin de plus pour d'exécuter GeoNode reportez-vous aux sections `Préparation & préalables du système` pour plus de détails.

source: Create a new `virtual disk` for the VM. Againg, refer to `System Preparation & Prerequisites` section for details about disk size, for testing purposes 30 GB will be enought.
fr: Créer un nouveau `disque virtuel` pour la machine virtuelle. Puis, voir la section `Préparation & préalables du système` pour plus de détails sur la taille du disque, pour des fins de test 30 GB sera suffisant.

source: Now edit the Virtual Machine settigs
fr: Maintenant, éditez la settigs Machine virtuelle

source: Under "Storage" select the empty DVD drive, click on `Live CD/DVD` as shown below
fr: Au titre de `Stockage` sélectionnez le lecteur de DVD vide, cliquez sur `Live CD/DVD` comme indiqué ci-dessous

source: Click on the DVD icon next to the `Optical Drive` drop down menu and select the Ubuntu 14.04 `.iso` file from your file system
fr: Cliquez sur l'icône de DVD à côté du menu déroulant `Optical Drive` et sélectionnez le fichier `.iso` de 14.04 Ubuntu dans votre système de fichiers

source: Edit other VM setting if you need to, then click `OK`.
fr: Modifier les autres réglages de la machine virtuelle si vous devez, puis cliquez sur `OK`.

source: We are ready to start our Ubuntu VM for the first time. Select it from the main menu and click on `Start`
fr: Nous sommes prêts à démarrer notre VM Ubuntu pour la première fois. Sélectionnez-le dans le menu principal et cliquez sur `Démarrer`

source: Ubuntu will start the boot process
fr: Ubuntu va commencer le processus de démarrage

source: At the end of the boot process you will be asked if you want to `Try Ubuntu` or `Install Ubuntu`. Select the language in the left panel and click on `Install Ubuntu`
fr: À la fin de la procédure de démarrage, on vous demandera si vous voulez `Essayer Ubuntu` ou `Installer Ubuntu`. Sélectionnez la langue dans le panneau de gauche et cliquez sur `Installer Ubuntu`

source: The installer will check your internet connection and available disk space. If you are connected to the internet check the `Download updates while installing` checkbox.
fr: Le programme d'installation va vérifier votre connexion internet et l'espace disque disponible. Si vous êtes connecté à internet cochez la case `Télécharger les mises à jour lors de l'installation`.

source: Click on `continue`. In the page you will configure the partitioning of the disks. If you recall we have created a new `virtual disk` during the VM configuration process for Ubuntu. We are going to assign the entire disk to it. Select `Erase disk and install Ubuntu`, then `Install Now`
fr: Cliquez sur `continuer`. Dans la page, vous allez configurer le partitionnement des disques. Si vous vous souvenez, nous avons créé un nouveau `disque virtuel` au cours du processus de configuration de machine virtuelle pour Ubuntu. Nous allons lui confier la totalité du disque. Sélectionnez `Erase disk and install Ubuntu`, puis `Install Now`

source: You will be prompted for confirmation.
fr: On vous demandera de confirmer.

source: Now select the correct time zone for your location, then select the language for the VM and enter the details for the administrator user.
fr: Maintenant, sélectionnez le fuseau horaire correspondant à votre emplacement, puis sélectionnez la langue pour la VM et entrez les détails pour l'utilisateur de l'administrateur.

source: The installation will continue automatically. At the end of the installation process a pop up window will ask you to restart the system to start using Ubuntu. Click on `Restart Now`
fr: L'installation se poursuivra automatiquement. À la fin du processus d'installation une fenêtre pop-up vous demandera de redémarrer le système pour commencer à utiliser Ubuntu. Cliquez sur `Redémarrer maintenant`
