Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/002_install_and_admin.po
Languages: fr

source: Ansible will print information about each step executed. The whole setup is going to take a few minutes.
fr: Ansible affichera des informations sur chaque étape à exécuter. L'installation entière va prendre quelques minutes.

source: At the end of the execution of the playbook all you need to do is set GeoNode administrator's password::
fr: À la fin de l'exécution du playbook, tout ce que vous devez faire est définie GeoNode mot de passe administrateur::

source: GeoNode (v\ |release|) installation on CentOS 7
fr: GeoNode (v\ |release|) installation sur CentOS 7

source: This part of the documentation describes the complete setup process for GeoNode on a CentOS 7 machine.
fr: Cette partie de la documentation décrit le processus complet d'installation pour GeoNode sur une machine CentOS 7.

source: Apache HTTP Server Installation
fr: Installation du serveur HTTP Apache

source: Install Apache::
fr: Installer Apache ::

source: And additional modules::
fr: Modules complémentaires ::

source: Firewall configuration
fr: Configuration du Pare-feu

source: Allow requests on port 80 through the firewall::
fr: Autoriser les demandes sur le port 80 à travers le pare-feu::

source: Security issues
fr: Les questions de sécurité

source: There are a couple of security issues to fix when dealing with GeoNode.
fr: Il y a quelques problèmes de sécurité à réparer lorsqu'il s'agit de GeoNode.

source: GeoNode will run inside httpd through WSGI. This means that httpd will try to perform external connection toward the DB. This is usually blocked by default by strict security policies, so we need to relax them::
fr: GeoNode se déroulera à l'intérieur httpd travers WSGI. Cela signifie que httpd va essayer de réaliser une connexion externe vers la DB. Ceci est habituellement bloqué par défaut par les politiques de sécurité strictes, donc nous avons besoin de les détendre ::

source: The other issue is about SELinux itself: it is not WSGI friendly, so we'll have to disable it. Edit the file ``/etc/sysconfig/selinux`` and change the line::
fr: L'autre question est sur SELinux lui-même : il n'est pas ami de WSGI sympathique, donc nous devrons le désactiver. Modifiez le fichier ``/etc/sysconfig/selinux`` et changez la ligne::

source: into ::
fr: vers ::

source: and reboot the machine.
fr: et redémarrer la machine.

source: httpd configuration
fr: configuration httpd

source: As ``root`, create the file ``/etc/httpd/conf.d/geonode.conf`` and insert into it :download:`this content <resources/geonode.conf>`.
fr: Comme ``root`, créez le fichier ``/etc/httpd/conf.d/geonode.conf`` et insérer dedans :download:`ce contenu <resources/geonode.conf>`.

source: Then restart httpd to make it reload the new configurations::
fr: Puis redémarrez httpd pour faire recharger les nouvelles configurations ::

source: To automatically start Apache at boot, run::
fr: Pour démarrer automatiquement Apache au démarrage, exécutez ::

source: Installing PostgreSQL and PostGIS
fr: Installation de PostGreSQL et PostGIS

source: Install PostgreSQL
fr: Installer PostgreSQL

source: Install the package for configuring the PGDG repository::
fr: Installez le package de configuration du référentiel PGDG::

source: EPEL repository will provide GDAL packages::
fr: Référentiel EPEL fournira des paquets GDAL::

source: Install PostgreSQL, PostGIS and related libs::
fr: Installer PostgreSQL, PostGIS et libs liés::

source: Init the DB::
fr: Init la DB::

source: Enable start on boot::
fr: Activer le démarrage au démarrage::

source: Start postgres service by hand::
fr: Lancer postgres service main::

source: To restart or reload the instance, you can use the following commands::
fr: Pour redémarrer ou recharger l'instance, vous pouvez utiliser les commandes suivantes::

source: Setting PostgreSQL access
fr: Définition d'accès de PostgreSQL

source: Create GeoNode Users Databases
fr: Créer des bases de données utilisateurs GeoNode

source: You will be prompted asked to set a password for the user. Enter geonode as password
fr: On vous demandera de définir un mot de passe pour l'utilisateur. Entrer geonode comme mot de passe

source: Tomcat Installation
fr: Installation de Tomcat

source: Installing Java
fr: Installation de Java

source: We'll need a JDK to run GeoServer.
fr: Nous aurons besoin d'un JDK pour exécuter GeoServer.

source: You may already have the OpenJDK package (``java-1.7.0-openjdk-devel.x86_64``) installed. Check and see if Java is already installed::
fr: Vous avez déjà installé le paquet OpenJDK (``java-1.7.0-openjdk-devel.x86_64``). Vérifier et voir si Java est déjà installée::

source: Once done, the command ``java -version`` should return info about the installed version.
fr: Une fois cela fait, la commande ``java -version`` doit retourner des informations sur la version installée.

source: Oracle JDK
fr: JDK d'Oracle

source: Until recently, the Oracle JDK was a better performer than the OpenJDK, so it was the preferred choice. This is no longer true, anyway in the following paragraph you can find instruction about how to install the Oracle JDK.
fr: Jusqu'à peu, le JDK d'Oracle était un meilleur performeur de l'OpenJDK, donc c'était le premier choix. Ce n'est plus vrai, de toute façon dans le paragraphe suivant, vous pouvez trouver des instructions sur la façon d'installer le JDK d'Oracle.

source: You can download the Oracle JDK RPM from this page:
fr: Vous pouvez télécharger le RPM de JDK d'Oracle depuis cette page :

source: Oracle does not expose a URL to automatically dowload the JDK because an interactive licence acceptance is requested. You may start downloading the JDK RPM from a browser, and then either:
fr: Oracle n'expose pas une URL pour automatiquement télécharger le JDK parce qu'une acceptation de licence interactive est demandée. Vous pouvez commencer à télécharger le JDK tr/min dans un navigateur, puis soit :

source: stop the download from the browser and use on the server the dynamic download URL your browser has been assigned, or
fr: arrêter le téléchargement à partir du navigateur et utiliser le sur le serveur, l'URL de téléchargement dynamique a été attribué à votre navigateur, ou

source: finish the download and transfer the JDK RPM to the server using ``scp``.
fr: terminer le téléchargement et le transfert le JDK tr/min sur le serveur à l'aide de ``scp``.

source: Once you have the ``.rpm`` file, you can install it by::
fr: Une fois que vous avez le fichier ``.rpm``, vous pouvez l'installer par::

source: Once installed, you still see that the default ``java`` and ``javac`` commands are still the ones from OpenJDK. In order to switch JDK version you have to set the proper system `alternatives`.
fr: Une fois installé, vous voyez encore que les commandes par défaut de ``java`` et ``javac`` sont toujours celles de OpenJDK. Pour changer la version du JDK, vous devrez mettre le système correct `alternatives`.

source: You may want to refer to `this page <http://www.rackspace.com/knowledge_center/article/how-to-install-the-oracle-jdk-on-fedora-15-16>`_ . Issue the command::
fr: Vous pouvez faire référence à `cette page <http://www.rackspace.com/knowledge_center/article/how-to-install-the-oracle-jdk-on-fedora-15-16>`_. Émettez la commande::

source: Then run ::
fr: Puis exécutez ::

source: and select the number related to ``/usr/java/latest/bin/java``.
fr: et sélectionnez le numéro relié à ``/usr/java/latest/bin/java``.

source: Now the default java version should be the Oracle one. Verify the proper installation on the JDK::
fr: Maintenant, la version de java par défaut devrait être l'Oracle un. Vérifier l'installation correcte sur le JDK::

source: Installing Tomcat
fr: Installation de Tomcat

source: Let's install `Tomcat` first::
fr: Nous allons d'abord installer `Tomcat`::

source: Instance manager script
fr: Script du gestionnaire instance

source: Install GeoNode application
fr: Installez l'application GeoNode

source: Install required libs
fr: Installation requise libs

source: Make sure all the needed libraries are installed::
fr: Assurez-vous que toutes les bibliothèques nécessaires sont installées::

source: Create geonode user
fr: Créer l'utilisateur geonode

source: Create the user::
fr: Créer l'utilisateur::

source: Install GeoNode
fr: Installer GeoNode

source: Install GeoNode sources from official repository::
fr: Installer les sources GeoNode du dépôt officiel::

source: Edit settings
fr: Modifier les paramètres

source: Initialize GeoNode
fr: Initialiser le GeoNode

source: Installing the Operating System
fr: Installation du système d'exploitation

source: CentOS Setup
fr: Installation de CentOS

source: We are re going to install a minimal CentOS 7 distribution. You can get a copy of the .iso the image used for the installation `here <http://mi.mirror.garr.it/mirrors/CentOS/7/isos/x86_64/CentOS-7-x86_64-Minimal-1503-01.iso>`_.
fr: Nous allons re- installer une distribution CentOS 7 minimal. Vous pouvez obtenir une copie de le .iso de l'image utilisée pour l'installation `ici <http://mi.mirror.garr.it/mirrors/CentOS/7/isos/x86_64/CentOS-7-x86_64-Minimal-1503-01.iso>`_.

source: Boot up the installation DVD and start the `CentOS 7` Installation wizard.
fr: Démarrer le DVD d'installation et démarrer l'Assistant Installation de `CentOS 7`.

source: Under `Select Date & Time` an set appropriate Date and Time settings
fr: Sous `Select Date & Time` un ensemble approprié de Date et Time settings

source: Under `Keyboard` and choose the keyboard layout
fr: Mettez `Keyboard`dessous et choisissez la configuration de clavier

source: Under `Installation Destination` select the hard disk where CentOS will be installed.
fr: Sous `Installation Destination`, sélectionnez le disque dur où seront installées CentOS.

source: Create a custom partitioning scheme as follows:
fr: Créer un schéma de partitionnement personnalisé comme suit :

source: Partition Label
fr: Label de la partition

source: Partition Type
fr: Type de partition

source: Size
fr: taille

source: Mount Point
fr: Point de montage

source: Under `Networking` configure your network interface according to your infrastructure you can either set it to `DHCP` to automatically get all the settings from a local DHCP server or configure it by hand.
fr: Sous `Networking` configurer votre interface réseau selon votre infrastructure, vous pouvez affectez l'DHCP' automatiquement et obtenir tous les paramètres d'un serveur DHCP local ou le configurer manuellement.

source: Enable the network interface, then go back to `Select Date & Time` and enable NTP synchronization periodically get date and time settings from CentOS servers
fr: Activer l'interface de réseau, puis revenir à `Sélectionner Date & Time` et activer la synchronisation NTP périodiquement obtenir la date et l'heure des paramètres de serveurs CentOS

source: Click on `Begin Installation`
fr: Cliquez sur `Begin Installation`

source: Now set the password for the `root` user. Also click on `User Creation` to create the `geo` user.
fr: Maintenant, définissez le mot de passe pour l'utilisateur `root`. Cliquer sur `Création de l'utilisateur` pour créer l'utilisateur `geo`.

source: Wait for the installation process to finish, then reboot your machine
fr: Attendre que le processus d'installation se termine, puis redémarrer votre machine.

source: Network configuration
fr: Configuration du réseau

source: The network configuration should already be set, since it was set during CentOS setup stage.
fr: La configuration du réseau doit déjà être réglée, puisqu'elle a été définie au cours de l'étape d'installation de CentOS.

source: You may want to review the configuration files ::
fr: Vous pouvez passer en revue les fichiers de configuration ::

source: You may also want to review the file ``/etc/resolv.conf`` to check the nameservers.
fr: Vous pouvez également examiner le fichier ``/etc/resolv.conf`` pour vérifier les noms de serveurs.

source: Check that the connection is up by pinging and external server::
fr: Vérifiez que la connexion est en hausse de serveur ping et externe::

source: Check that the DNS are properly configuring by pinging a host by its name::
fr: Vérifier que les DNS sont correctement configurés en cinglant un hôte par son nom::

source: Please note that in CentOS only ssh incoming connections are allowed; all other incoming connections are disabled by default.
fr: Veuillez noter que dans CentOS seulement ssh les connexions entrantes sont admises ; toutes les autres connexions entrantes sont désactivées par défaut.

source: In the paragraph related to the httpd service you can find details about how to enable incoming traffic.
fr: Dans le paragraphe concernant le service httpd, vous trouverez des détails sur la façon d'activer le trafic entrant.

source: Note that after configuring the network, you may continue installing the system setup using a ssh connection.
fr: Notez qu'après avoir configuré le réseau, vous pouvez continuer à installer le système d'installation utilisant un ssh connection.

source: User access configuration
fr: Configuration d'accès

source: Login as ``root'` user and give the ``geo`` user administrative privileges by adding him to the ``wheel`` group: ::
fr: Ouverture de session comme ``root`` utilisateur et donner le ``geo`` privilèges utilisateur en lui ajoutant au groupe ``wheel``: ::

source: SSH access
fr: SSH accès

source: Allow SSH connections through the firewall
fr: Autoriser les connexions SSH à travers le pare-feu

source: On CentOS 7 the firewall is enabled by default. To allow SSH clients to connect to the machine allow incoming connections on port 22::
fr: Sur CentOS 7, le pare-feu est activé par défaut. Pour permettre à SSH clients de se connecter à la machine autorisez les connexions entrantes sur le port 22::

source: Disable SSH login for the `root` user
fr: Désactiver la connexion SSH pour l'utilisateur `root`

source: Before you disable root login make sure you are able to login via SSH with `geo` user account and you have the privileges to run `sudo su` to switch to the `root` user account.
fr: Avant de désactiver le login root, assurez-vous que vous êtes en mesure de vous connecter via SSH avec `geo` compte d'utilisateur et vous avez les privilèges pour exécuter `sudo su` pour basculer sur le compte d'utilisateur `root`.

source: Edit file `/etc/ssh/sshd_config` to disable `root` login via SSH::
fr: Éditer le fichier `/ etc/ssh/sshd_config` pour désactiver le login `root` via SSH::

source: Public key authentication
fr: Authentification par clé publique

source: `Public key authentication`_ is generally considered a safer way to authenticate users for SSH access. Let's set it up and disable password based authentication
fr: `Authentification par clé publique`_ est généralement considéré comme un moyen plus sûr pour authentifier les utilisateurs pour l'accès SSH. Nous allons mettre en place et désactivez l'authentification de mot de passe basé

source: First generate a public/private key pair using `ssh-keygen`::
fr: Tout d'abord générer une paire de clés publique/privée à l'aide de `ssh-keygen`::

source: Folllow the procedure, you will end up with your newly generated key under ``~/.ssh`` Now copy your `public` (by default it is called id_rsa.pub) key over the CentOS machine in ``/home/geo/.ssh/authorized_keys``. There are several ways to do it, we are going to use the `ssh-copy-id` tool::
fr: Suivez la procédure, vous allez vous retrouver avec votre clé nouvellement générée sous ``~/.ssh`` maintenant, copiez votre `public` (par défaut, il s'appelle id_rsa.pub) clé sur la machine de CentOS en ``/home/geo/.ssh/authorized_keys``. Il existe plusieurs façons de le faire, nous allons utiliser l'outil `ssh-copy-id`::

source: You should now be able to login via SSH as `geo` without been asked for the password::
fr: Vous devriez maintenant être en mesure de vous connecter via SSHsans que `geo` demande le mot de passe::

source: You can now disable password based login over SSH
fr: Vous pouvez maintenant désactiver le login de mot de passe basé sur SSH

source: Before disabling password authentication make sure you' ve installed your public key on the server and you are able to login without password
fr: Avant de désactiver l'authentification de mot de passe, assurez-vous que vous avez installé votre clé publique sur le serveur et que vous êtes capable de vous connecter sans mot de passe

source: Edit ``/etc/ssh/sshd_config`` as follows::
fr: Modifier ``/etc/ssh/sshd_config`` comme suit::

source: Installing ntp
fr: Installation de ntp

source: Install the program for ntp server synchronization::
fr: Installer le programme pour la synchronisation avec un serveur ntp::

source: Edit ``/etc/ntp.conf`` and add the following line before the first ``server`` directive::
fr: ``/etc/ntp.conf`` et ajoutez la ligne suivante avant la première directive ``server`` ::

source: Replace ``tempo.ien.it`` with your nearest ntp server.
fr: placez votre serveur ntp le plus proche de ``tempo.ien.it``.

source: Sync with the server by issuing::
fr: Synchronisation avec le serveur par l'émission::

source: Set the time synchronization as an autostarting daemon::
fr: Définir la synchronisation de l'heure comme un daemon autostarting::

source: Installing base packages
fr: Installer les paquets de base

source: Welcome to the GeoNode Training `Installation & Admin` documentation v\ |release|.
fr: Bienvenue à la formation de GeoNode `Installation & Admin` documentation v\ |release|.

source: This module is more oriented to users having some System Administrator background.
fr: Ce module est plus orienté vers les utilisateurs ayant une certains administrateur système d'arrière-plan.

source: At the end of this section you will be able to setup from scratch the whole GeoNode infrastructure and understand how to the different pieces are interconnected and which are their dependencies.
fr: À la fin de cette section, vous serez en mesure de configurer à partir de zéro l'ensemble de l'infrastructure de GeoNode et de comprendre comment les différentes pièces sont reliées entre elles et qui sont leurs dépendances.

source: *Prerequisites*
fr: Conditions préalables

source: Before proceeding with the reading, it is strongly recommended to be sure having clear the following concepts:
fr: Avant de procéder à la lecture, il est fortement recommandé pour être sûr d'avoir clairement les concepts suivants:

source: GeoNode and Django framework basic concepts
fr: GeoNode et Django cadres concepts de base

source: What is Python
fr: Qu'est-ce que Python

source: What is a DBMS
fr: Qu'est-ce qu'un DBMS

source: What is a Java Virtual Machine and the JDK
fr: Qu'est-ce qu'une machine virtuelle Java et le JDK

source: Basic TCP/IP and networking concepts
fr: Concepts TCP / IP et réseau de base

source: Linux OS basic shell and maintenance commands
fr: Commandes shell et d'entretien de base Linux OS

source: Apache HTTPD Server and WSGI Python bindings
fr: Apache HTTPD Server et les liaisons Python WSGI

source: This section describes how to setup a Virtual Machine running Ubuntu.
fr: Cette section décrit comment configurer une Machine virtuelle sous Ubuntu.

source: This section will guide the user through the steps necessary to install GeoNode on Ubuntu.
fr: Cette section va guider l'utilisateur à travers les étapes nécessaires pour installer GeoNode sur Ubuntu.

source: This section will guide the user through the steps necessary to install GeoNode on CentOS.
fr: Cette section va guider l'utilisateur à travers les étapes nécessaires pour installer GeoNode sur CentOS.

source: Packaging for automatic installation are provided for Ubuntu, so, the only option for installing GeoNode on a CentOS platform is installing it from source.
fr: Les emballage pour l'installation automatique sont fournis pour Ubuntu, donc, la seule option pour l'installation de GeoNode sur une plate-forme de CentOS est d' installer cela de la source.

source: Running Ansible scripts
fr: Exécution de scripts Ansible

source: `Ansible <http://www.ansible.com/>`_ is a free software platform used for configuring and managing computers. It is written in `Python <https://www.python.org/>`_ and allows users to manage `nodes` (computers) over SSH.
fr: `Ansible <http://www.ansible.com/>`_ est une plateforme de logiciel libre utilisé pour configurer et gérer des ordinateurs. Il est écrit dans `Python <https://www.python.org/>`_ et permet aux utilisateurs de gérer les `nodes` (ordinateurs) via SSH.

source: Configuration files are written in `YAML <https://en.wikipedia.org/wiki/YAML>`_ , a simple, human-readable, data serialization format.
fr: Les fichiers de configuration sont écrits en `YAML <https://en.wikipedia.org/wiki/YAML>`_ , un format de sérialisation de données simple, lisible,.

source: Installing Ansible
fr: Installation de Ansible

source: Before you install `Ansible` make sure you have Python 2.6 or Python 2.7 on the controlling machine, you will also need an SSH client. Most Linux distributions come with an SSH client preinstalled.
fr: Avant d'installer `Ansible` Assurez-vous bien sûr vous avez Python 2.6 ou 2.7 Python sur la machine de contrôle, vous aurez également besoin d'un client SSH. La plupart des distributions Linux disposent d'un client SSH préinstallé.

source: If you encounter any problems during the installation, refer to the `official documentation <http://docs.ansible.com/ansible/intro_installation.html>`_
fr: Si vous rencontrez des problèmes lors de l'installation, reportez-vous à la `documentation officielle <http://docs.ansible.com/ansible/intro_installation.html>`_

source: Windows is not supported as a controlling machine.
fr: Windows n'est pas pris en charge comme une machine de contrôle.

source: Running Ansible
fr: Ansible en cours d'exécution

source: To test your ansible installation, run the following command
fr: Pour tester votre installation ansible, exécutez la commande suivante

source: Ansible Hosts file
fr: Fichier Hosts Ansible

source: Public Key access
fr: Accès public

source: To avoid having to type users password to connect to the nodes over and over, using SSH keys is recommended.
fr: Pour éviter d'avoir à taper le mot de passe utilisateur pour se connecter aux nœuds encore et encore, utiliser des clés SSH est recommandé.

source: And follow the instructions on the screen. A new key pair will be generated and placed inside the `.ssh` folder in your user's home directory.
fr: Et suivez les instructions à l'écran. Une nouvelle paire de clés est générée et placée dans le dossier `.ssh` dans votre répertoire utilisateur.

source: All you need to do now is copy the public key (id_rsa.pub) in the `authorized_keys` file on the node you want to manage, inside the user's home directory. For example if you want to be able to connect to training.geonode1.com as user `geo` edit the /home/geo/.ssh/authorized_keys file on the remote machine and add the content of your public key inside the file.
fr: Tout ce que vous devez faire est maintenant copier la clé publique (id_rsa.pub) dans le fichier 'authorized_keys' sur le nœud que vous souhaitez gérer, à l'intérieur du répertoire home de l'utilisateur. Par exemple, si vous voulez être capable de vous connecter à training.geonode1.com en tant qu'utilisateur `geo` modifier le /home/geo/.ssh/authorized_keys dossier sur l'ordinateur distant et ajouter le contenu de votre clé publique à l'intérieur du fichier.

source: For more information on how to setup SSH keys in Ubuntu refere to `this <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ document
fr: Pour plus d'informations sur la façon de configurer SSH keys dans Ubuntu faites référence à à `ce <https://help.ubuntu.com/community/SSH/OpenSSH/Keys>`_ document

source: Connect to managed nodes
fr: Se connecter à des nœuds gérés
