Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/004_admin_workshop.po
Languages: fr

source: Refresh your GeoNode project and view the changes in your browser at http://localhost/ or the remote URL for your site:
fr: Rafraîchez votre GeoNode projet pour voir les changements dans votre navigateur à l'adresse http://localhost/ ou l'URL pour votre site:

source: From here you can continue to customize your :file:`site_index.html` template to suit your needs. This workshop will also cover how you can add new pages to your GeoNode project site.
fr: De là, vous pouvez continuer à personnaliser votre :file:`site_index.html` pour répondre à vos besoins. Cet workshop vous monstrera aussi comme vous pouvez ajouter de nouvelles pages à votre site du projet de GeoNode.

source: Other theming options
fr: Autres options de thématisation

source: You are able to change any specific piece of your GeoNode project's style by adding CSS rules to :file:`site_base.css`, but since GeoNode is based on Bootstrap, there are many pre-defined themes that you can simply drop into your project to get a whole new look. This is very similar to `WordPress <http://wordpress.com>`_ themes and is a powerful and easy way to change the look of your site without much effort.
fr: Vous pouvez changer chaque pièce spécifique de votre projet de GeoNode en ajoutant des règles de style CSS à :file:`site_base.css`, mais depuis que GeoNode est basée sur Bootstrap, il ya beaucoup de thèmes prédéfinis que vous pouvez simplement déposer dans votre projet pour obtenir un tout nouveau look. Ceci est très similaire aux thèmes de `WordPress <http://wordpress.com>`_ et c'est un moyen puissant et facile à changer l'apparence de votre site sans trop d'effort.

source: `Bootswatch <http://bootswatch.com>`_ is a site where you can download ready-to-use themes for your GeoNode project site. The following steps will show you how to use a theme from Bootswatch in your own GeoNode site.
fr: `Bootswatch <http://bootswatch.com>`_ est un site où vous pouvez télécharger des thèmes prêts à l'emploi pour votre site de projet GeoNode. Les étapes suivantes vous montrera comment utiliser un thème de Bootswatch dans votre propre site de GeoNode.

source: Visit http://bootswatch.com and select a theme (we will use Sandstone for this example). Select the :guilabel:`download bootstrap.css option` in the menu:
fr: Visitez http://bootswatch.com et cliquez sur un thème (pour cet exemple, nous allons utiliser grès). Sélectionnez la : guilabel: 'bootstrap.css option de téléchargement"dans le menu :

source: Put this file in :file:`<my_geonode>/static/css`.
fr: Placez ce fichier dans :file:`<my_geonode>/static/css`.

source: Update the :file:`site_base.html` template to include this file. It should now look like this:
fr: Mise à jour le :file:`site_base.html` modèle d'inclure ce fichier. Il devrait maintenant ressembler à ceci :

source: Refresh the development server and visit your site:
fr: Actualisez le serveur de développement et visitez votre site:

source: Your GeoNode project site is now using the Sandstone theme in addition to the changes you have made.
fr: Votre site de projet GeoNode utilise maintenant le thème de grès en plus des changements que vous avez fait.

source: Customize the look and feel
fr: Personnalisation du look and feel

source: You might want to change the look of GeoNode, editing the colors and the logo of the website and adjust the templates for your needs. To do so, you first have to set up your own geonode project from a template. If you've successfully done this, you can go further and start theming your geonode project.
fr: Vous voudrez peut-être changer le look de GeoNode, modifier les couleurs et le logo du site et d'ajuster les modèles pour vos besoins. Pour faire ça, vous devez d'abord mettre en place votre propre projet de geonode à partir d'un modèle. Si vous avez réussi à faire cela, vous pouvez aller plus loin et commencer votre projet de thématisation geonode.

source: Setup your own geonode project
fr: Configuration de votre propre projet de geonode

source: Theme your geonode project
fr: Thématisation de votre projet de geonode

source: Debugging GeoNode Installations
fr: Débogage des Installations de GeoNode

source: There are several mechanisms to debug GeoNode installations, the most common ones are discussed in the following sections.
fr: Il existe plusieurs mécanismes pour le de débogage des installations de GeoNode, les plus communs sont abordés dans les sections suivantes.

source: Viewing the logs
fr: Visualisation des journaux

source: There are many kinds of logs in GeoNode, most of them are located in :file:`/var/log/geonode/` and will be explained below in order of relevance:
fr: Il existe plusieurs types de journaux dans GeoNode, la plupart d'entre eux se trouvent dans :file:`/var/log/geonode/` et sera expliqué ci-dessous par ordre de pertinence :

source: **GeoNode main log**: This is the output of the Django application generated by Apache, it may contain detailed information about uploads and high level problems.
fr: **GeoNode main log**: Ceci est la sortie de l'application Django généré par Apache. Elle peut contenir des informations détaillées sur les téléchargements et les problèmes de haut niveau.

source: The default location is :file:`/var/log/geonode/apache.log` or :file:`/var/log/apache2/error.log`.
fr: L'emplacement par défaut est :file:`/var/log/geonode/apache.log` ou :file:`/var/log/apache2/error.log`.

source: It is set to a very low level (not very much information is logged) by default, but it's output can be increased by setting the logging level to ``DEBUG`` in :file:`/etc/geonode/local_settings.py`.
fr: Il est fixé à un niveau très faible (pas beaucoup d'informations est enregistré) par défaut, mais il peut être augmentée en configurant le niveau d'enregistrement à ``DEBUG`` dans :file:`/etc/geonode/local_settings.py`.

source: **GeoServer log**: It contains most of the information related to problems with data, rendering and styling errors.
fr: **Journal de GeoServer**: il contient la plupart des informations liées à des problèmes de données, de rendu et d'erreurs de style.

source: This one can be accessed at ``GEOSERVER_DATA_DIR/logs/geoserver.log``, which is usually :file:`/var/lib/tomcat7/webapps/geoserver/data/logs/geoserver.log` or :file:`/var/lib/geoserver/geonode-data/logs/geoserver.log`.
fr: Celui-ci peut être consulté à ``GEOSERVER_DATA_DIR/logs/geoserver.log``, qui est habituellement: :file:`/var/lib/tomcat7/webapps/geoserver/data/logs/geoserver.log` ou :file:`/var/lib/geoserver/geonode-data/logs/geoserver.log`.

source: It may also be symlinked in :file:`/var/log/geonode/geoserver.log`.
fr: Il peut également être un lien symbolique à :file:`/var/log/geonode/geoserver.log`.

source: **Tomcat logs**: Tomcat logs could indicate problems loading GeoServer.
fr: **Journaux de tomcat**: journaux Tomcat peut indiquer des problèmes de chargement GeoServer.

source: They can be found at :file:`/var/lib/tomcat7/logs/catalina.out` or :file:`/var/lib/tomcat/geoserver/logs/catalina.out`.
fr: Ils sont à :file:`/var/lib/tomcat7/logs/catalina.out` ou :file:`/var/lib/tomcat/geoserver/logs/catalina.out`.

source: **PostgreSQL logs**: PostgreSQL is accessed by GeoServer and Django, therefore information about errors which are very hard to debug may be found by looking at PostgreSQL's logs.
fr: **Journaux de PostgreSQL**: PostgreSQL est accessible par GeoServer et Django, donc informations relatives aux erreurs qui sont très difficiles à déboguer peuvent être trouvées en regardant journaux de PostgreSQL.

source: They are located at :file:`/var/log/postgresql/postgresql-$(psql_version)-main.log` where **$(psql_version)** depends on your local installation.
fr: Ils sont situés à :file:`/var/log/postgresql/postgresql-$(psql_version)-main.log` où **$(psql_version)** dépend de votre installation locale.

source: Enabling DEBUG mode
fr: Activation du mode DEBUG

source: Django can be set to return nicely formatted exceptions which are useful for debugging instead of generic ``500 errors``.
fr: Django peut être réglé pour revenir exceptions correctement formatées qui sont utiles pour le débogage au lieu de générique ``500 errors``.

source: This is enabled by setting ``DEBUG=True`` in :file:`/home/geonode/geonode/geonode/local_settings.py` (or :file:`/etc/geonode/local_settings.py` if GeoNode has been installed using **apt-get**).
fr: Cette option est activée par la mise ``DEBUG=True`` in :file:`/home/geonode/geonode/geonode/local_settings.py` (ou :file:`/etc/geonode/local_settings.py` si GeoNode a été installé en utilisant **apt-get**).

source: After enabling DEBUG, the Apache server has to be restarted for the changes to be picked up. In Ubuntu::
fr: Après l'activation du DEBUG, le serveur Apache doit être redémarré pour que les modifications être ramassés. Dans Ubuntu::

source: Other tips and tricks
fr: Autres trucs et astuces

source: Modifying GeoServer's output strategy
fr: Modification de GeoServer sortie de stratégie

source: Up to version 1.1, GeoNode used by default the ``SPEED`` output strategy of GeoServer, this meant that proper error messages were being sacrificed for performance. Unfortunately, this caused many errors to be masked as XML parsing errors when layers were not properly configured.
fr: Jusqu'à la version 1.1, GeoNode utilisée par défaut de la stratégie de sortie ``SPEED`` de GeoServer, cela signifie que des messages d'erreur appropriée ont été sacrifiés pour la performance. Malheureusement, cela a provoqué beaucoup d'erreurs à masquer au format XML parsing des erreurs lorsque les couches ne sont pas correctement configurés.

source: It is recommended to verify the output strategy is set at least to ``PARTIAL_BUFFER2`` **(or a safer one, e.g. ``FILE``)** with a high value for the buffer size. More information about the different strategies and the performance vs correctness trade off is available at GeoServer's web.xml file.
fr: Il est recommandé de vérifier que la stratégie de sortie est réglée au moins sur ``PARTIAL_BUFFER2`` **(or a safer one, e.g. ``FILE``)** à haute valeur pour la taille du tampon. Plus d'informations sur les différentes stratégies et le performances vs rectitude compromis sont disponibles dans le fichier web.xml de GeoServer.

source: The typical location of the file that needs to be modified is ``/var/lib/tomcat7/webapps/geoserver/WEB-INF/web.xml`` as shown below::
fr: L'emplacement typique du fichier qui doit être modifié est ``/var/lib/tomcat7/webapps/geoserver/WEB-INF/web.xml`` comme indiqué ci-dessous::

source: Add the Django debug toolbar
fr: Ajouter la barre d'outils de débogage de Django

source: The Debug Toolbar module **must** be disabled whe running the server in production (with Apache2 HTTPD Server WSGI)
fr: Le module de la barre d'outils déboguer **must** être handicapée whe exécutant le serveur de production (avec Apache2 HTTPD serveur WSGI)

source: The django debug toolbar offers a lot of information on about how the page you are seeing is created and used. From the database hits to the views involved. It is a configurable set of panels that display various debug information about the current request/response and when clicked, display more details about the panel's content.
fr: La barre d'outils de débogage de django offre beaucoup d'informations sur la façon dont la page que vous voyez est créée et utilisée. Depuis les coups de base de données pour les points de vue concernés. Il s'agit d'un ensemble configurable de panneaux qui s'affichent diverses informations de débogage sur l'actuelle demande/réponse et lorsque vous cliquez dessus, affiche plus de détails sur le contenu du panneau.

source: To install it::
fr: Pour l'installer::

source: Then edit your settings :file:`/home/geonode/geonode/geonode/settings.py` (or :file:`/etc/geonode/settings.py` if GeoNode has been installed using **apt-get**) and add the following to the bottom of the file::
fr: Puis modifiez vos paramètres :file:`/home/geonode/geonode/geonode/settings.py` (ou :file:`/etc/geonode/settings.py` si GeoNode a été installé en utilisant **apt-get**) et ajoutez le code suivant à la fin du fichier::

source: Stop Apache and start the server in **Development Mode**::
fr: Arrêtez Apache et démarrez le serveur en **Development Mode**::

source: Redirect the browser to **http://localhost:8000**. You should be able to see the Debug Panel on the right of the screen.
fr: Rediriger le navigateur de **http://localhost:8000**. Vous devriez être capable de voir le panneau Debug sur la droite de l'écran.

source: *DJango Debug Toolbar Enabled In Devel Mode*
fr: * DJango Debug Toolbar activée dans Devel Mode *

source: More:
fr: Plus: `http://geoserver.org <http://geoserver.org>`_

source: For more set up and customize the panels read the official docs here
fr: Pour plus d'informations configurer et personnaliser les panneaux lire les docs officiels ici

source: Changing the Default Language
fr: Modification de la langue par défaut

source: GeoNode's default language is English, but GeoNode users can change the interface language with the pulldown menu at the top-right of most GeoNode pages. Once a user selects a language GeoNode remembers that language for subsequent pages.
fr: La langue par défaut de GeoNode est l'anglais, mais les utilisateurs de GeoNode peuvent changer la langue de l'interface en utilisant le menu déroulant situé en haut à droite de la plupart des pages de GeoNode. Une fois qu'un utilisateur sélectionne une langue GeoNode se souvient que la langue pour les pages suivantes.

source: GeoNode Configuration
fr: Configuration de GeoNode

source: As root edit the geonode config file :file:`/home/geonode/geonode/geonode/settings.py` (or :file:`/etc/geonode/settings.py` if GeoNode has been installed using **apt-get**) and change ``LANGUAGE_CODE`` to the desired default language.
fr: En tant que root, éditez le fichier de configuration geonode :file:`/home/geonode/geonode/geonode/settings.py` (ou :file:`/etc/geonode/settings.py` si GeoNode a été installé en utilisant **apt-get**) et changer ``LANGUAGE_CODE`` à la langue par défaut souhaité.

source: A list of language codes can be found in the global django config file :file:`/usr/local/lib/python2.7/dist-packages/django/conf/global_settings.py` (or :file:`/var/lib/geonode/lib/python2.7/site-packages/django/conf/global_settings.py` if GeoNode has been installed using **apt-get**).
fr: Une liste des codes des langues se trouvent dans le fichier de configuration global django :file:`/usr/local/lib/python2.7/dist-packages/django/conf/global_settings.py` (ou :file:`/var/lib/geonode/lib/python2.7/site-packages/django/conf/global_settings.py` si GeoNode a été installé en utilisant **apt-get**).

source: For example, to make French the default language use::
fr: Par exemple, pour faire des Français à l'usage de la langue par défaut::

source: Unfortunately Django overrides this setting, giving the language setting of a user's browser priority. For example, if ``LANGUAGE_CODE`` is set to French, but the user has configured their operating system for Spanish they may see the Spanish version when they first visit GeoNode.
fr: Malheureusement Django substitue à ce paramètre, ce qui donne le paramètre de langue de priorité du navigateur de l'utilisateur. Par exemple, si ``LANGUAGE_CODE`` est sur le Français, mais l'utilisateur a configuré leur système d'exploitation pour l'espagnol qu'ils peuvent voir la version espagnole lors de leur première visite GeoNode.

source: Additional Steps
fr: Etapes supplémentaires

source: If this is not the desired behaviour, and all users should initially see the default ``LANGUAGE_CODE``, regardless of their browser's settings, do the following steps to ensure Django ignores the browser language settings. (Users can always use the pulldown language menu to change the language at any time.)
fr: Si ce ne sont pas le comportement désiré, et tous les utilisateurs doivent d'abord voir le défaut ``LANGUAGE_CODE``, quels que soient les paramètres de leur navigateur, effectuez les étapes suivantes pour assurer Django ignore les paramètres de langue du navigateur. (Les utilisateurs peuvent toujours utiliser le menu déroulant de la langue pour changer la langue à tout moment.)

source: As **root** create a new directory within GeoNode's site packages::
fr: Comme **root** créer un nouveau répertoire dans les paquets de site de GeoNode::

source: if GeoNode has been installed using **apt-get**
fr: si GeoNode a été installé en utilisant **apt-get**

source: As root create and edit a new file :file:`/usr/lib/python2.7/dist-packages/setmydefaultlanguage/__init__.py` and add the following lines::
fr: En tant que root, créer et éditer un nouveau fichier :file:`/usr/lib/python2.7/dist-packages/setmydefaultlanguage/__init__.py` et ajoutez les lignes suivantes::

source: At the end of the GeoNode configuration file :file:`/home/geonode/geonode/geonode/settings.py` (or :file:`/etc/geonode/settings.py` if GeoNode has been installed using **apt-get**) add the following lines to ensure the above class is executed::
fr: À la fin du fichier de configuration GeoNode :file:`/home/geonode/geonode/geonode/settings.py` (ou :file:`/etc/geonode/settings.py` si GeoNode a été installé en utilisant **apt-get**) ajoutez les lignes suivantes afin d'assurer la classe ci-dessus est exécutée::

source: Restart
fr: Redémarrage

source: Finally restart Apache2 as root with::
fr: Enfin redémarrez Apache2 en tant que root avec::

source: Please refer to Translating GeoNode for information on editing GeoNode pages in different languages and create new GeoNode Translations.
fr: S'il vous plaît se référer à traduire GeoNode pour plus d'informations sur la modification des pages GeoNode dans différentes langues et créer de nouvelles traductions de GeoNode.

source: Administrators Workshop
fr: Workshop pour les Administrateurs

source: Welcome to the GeoNode Training `Administrators Workshop` documentation v\ |release|.
fr: Bienvenue sur la documentation de formation de l' `Administrateurs Workshop` du GeoNode v\ |release|.

source: This workshop will teach how to install and manage a deployment of the `GeoNode <http://geonode.org/>`_ software application. At the end of this section you will master all the GeoNode sections and entities from an administrator perspective.
fr: Ce vous vous apprendra comment installer et gérer une installation de `GeoNode <http://geonode.org/>`_. À la fin de cette section, vous serez maître de toutes les sections sur GeoNode du point de vue de l'administrateur.

source: You will know how to:
fr: Vous saurez comment:

source: Use the GeoNode’s Django Administration Panel.
fr: Utiliser Django Panneau d'administration de la GeoNode.

source: Use the console Management Commands for GeoNode.
fr: Utilisez les commandes de gestion de la console pour GeoNode.

source: Configure and customize your GeoNode installation.
fr: Configurer et personnaliser votre installation de GeoNode.

source: Before proceeding with the reading, it is strongly recommended to be sure having clear the following concepts:
fr: Avant de procéder à la lecture, il est fortement recommandé d'être sûr d'avoir clairement les concepts suivants:

source: GeoNode and Django framework concepts
fr: GeoNode et Django concepts du cadre

source: Good knowledge of Python
fr: Bonne connaissance de Python

source: Good knowledge of what is a geospatial server and geospatial web services.
fr: Bonne connaissance de ce qui est un serveur géospatial et les services Web géospatiales.

source: Good knowledge of what is metadata and catalog.
fr: Bonne connaissance de ce qui est métadonnées et catalogue.

source: Good knowledge of HTML and CSS.
fr: Bonne connaissance de HTML et CSS.

source: GeoNode comes with administrative commands to help with day to day tasks. This section shows the list of the ones that come from the GeoNode application.
fr: GeoNode est livré avec des commandes d'administration pour aider à jour les tâches quotidiennes. Cette section présente la liste de ceux qui viennent de l'application de GeoNode.

source: There are several mechanisms to debug GeoNode installations, the most common ones are discussed in this section.
fr: Il existe plusieurs mécanismes pour le débogage des installations de GeoNode, les plus communs sont abordés dans cette section.
