Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/004_admin_workshop.po
Languages: fr

source: After going through the theming guide you'll have to return to this site to execute one more command in order to finish the theming!
fr: Après être passé par le guide de thèmes, vous aurez à revenir à ce site pour exécuter une autre commande pour terminer la thématisation!

source: When you've done the changes, run the following command in the *my_geonode* folder:
fr: Lorsque vous avez terminé les modifications, exécutez la commande suivante dans le dossier *my_geonode* :

source: And now you should see all the changes you've made to your GeoNode.
fr: Et maintenant, vous devriez voir toutes les modifications que vous avez apportées à votre GeoNode.

source: Source code revision control
fr: Control de révision de source code

source: It is recommended that you immediately put your new project under source code revision control. The GeoNode development team uses Git and GitHub and recommends that you do the same. If you do not already have a GitHub account, you can easily set one up. A full review of Git and distributed source code revision control systems is beyond the scope of this tutorial, but you may find the `Git Book`_ useful if you are not already familiar with these concepts.
fr: Il est recommandé que vous mettez immédiatement votre nouveau projet sous contrôle de révision de code source. L'équipe de développement de GeoNode utilise Git et GitHub et recommande que vous faites la même chose. Si vous ne possédez pas déjà un compte GitHub, vous pouvez facilement créer un. Un examen complet de Git et les systèmes de contrôle de révision de code source distribué est au-delà du cadre de ce tutoriel, mais vous pouvez trouver les `Git Book`_ utile si vous n'êtes pas déjà familier avec ces concepts.

source: Create a new repository in GitHub. You should use the GitHub user interface to create a new repository for your new project.
fr: Créer un nouveau dépôt de GitHub. Vous devez utiliser l'interface utilisateur GitHub pour créer un nouveau dépôt pour votre nouveau projet.

source: *Creating a new GitHub Repository From GitHub's Homepage*
fr: *Création d'un nouveau Dépôt GitHub à la page d'accueil de GitHub*

source: *Specifying new GitHub Repository Parameters*
fr: *Spécification de nouveau GitHub dépôt Paramètres*

source: *Your new Empty GitHub Repository*
fr: *Votre nouveau dépôt GitHub vide*

source: Initialize your own repository in the my_geonode folder:
fr: Initialisez votre propre dépôt dans le dossier de my_geonode:

source: Add the remote repository reference to your local git configuration:
fr: Ajoutez la référence de dépôt distant à votre configuration git locale:

source: Add your project files to the repository:
fr: Ajoutez vos fichiers de projet dans le dépôt:

source: Commit your changes:
fr: Committez vos modifications:

source: Push to the remote repository:
fr: Poussez vers le dépôt distant:

source: Project structure
fr: Structure du projet

source: Your GeoNode project will now be structured as depicted below::
fr: Votre projet de GeoNode sera structuré comme décrit ci-dessous::

source: You can also view your project on GitHub.
fr: Vous pouvez également visualiser votre projet sur GitHub.

source: *Viewing your project on GitHub*
fr: *Visualisation de votre projet sur GitHub*

source: Each of the key files in your project are described below.
fr: Chacun des fichiers de clés de votre projet sont décrits ci-dessous.

source: :file:`manage.py` is the main entry point for managing your project during development. It allows running all the management commands from each app in your project. When run with no arguments, it will list all of the management commands.
fr: :file:`manage.py` est le principal point d'entrée pour la gestion de votre projet au cours du développement. Il permet de faire tourner toutes les commandes de gestion de chaque application dans votre projet. Lorsqu'il est exécuté sans arguments, il liste toutes les commandes de gestion.

source: :file:`settings.py` is the primary settings file for your project. It imports the settings from the system geonode and adds the local paths. It is quite common to put all sensible defaults here and keep deployment specific configuration in the :file:`local_settings.py` file. All of the possible settings values and their meanings are detailed in the Django documentation.
fr: :file:`settings.py` est le fichier primair de paramètres pour votre projet. Il importe les paramètres du système de GeoNode et il ajoute les chemins locaux. Il est assez fréquent de mettre toutes les valeurs par défaut raisonnables ici et conserver la configuration spécifique de déploiement dans le fichier :file:`local_settings.py`. Toutes les valeurs de paramètres possibles et leurs significations sont détaillées dans la documentation de Django.

source: A common paradigm for handing 'local settings' (and in other areas where some python module may not be available) is:
fr: Un paradigme commun pour la manipulation de 'local settings' (et dans d'autres domaines où certains module python peut ne pas être disponible) est:

source: This is not required and there are many other solutions to handling varying deployment configuration requirements.
fr: Ceci est pas nécessaire et il ya beaucoup d'autres solutions pour faire face aux exigences différentes de configuration de déploiement.

source: :file:`urls.py` is where your application specific URL routes go. Additionally, any `overrides` can be placed here, too.
fr: :file:`urls.py` est où votre URL routes vont . En outre, `overrides` peut être placé ici, aussi.

source: This is a generated file to make deploying your project to a WSGI server easier. Unless there is very specific configuration you need, :file:`wsgi.py` can be left alone.
fr: Ceci est un fichier généré afin de rendre le déploiement de votre projet sur un serveur WSGI plus facile. Sauf configuration très spécifique dont vous avez besoin, :file:`wsgi.py` peut être laissé seul.

source: There are several packaging options in python but a common approach is to place your project metadata (version, author, etc.) and dependencies in :file:`setup.py`.
fr: Il ya plusieurs options d'emballage en python, mais une approche commune est de placer vos métadonnées de projet (version, auteur, etc.) et dépendances dans :file:`setup.py`.

source: This is a large topic and not necessary to understand while getting started with GeoNode development but will be important for larger projects and to make development easier for other developers.
fr: Ceci est un grand sujet et pas nécessaire de comprendre pendant que vouz commencez avec le développement de GeoNode mais il sera important pour les grands projets et pour faciliter le développement d'autres développeurs.

source: More: http://docs.python.org/2/distutils/setupscript.html
fr: Plus: http://docs.python.org/2/distutils/setupscript.html

source: The :file:`static` directory will contain your fixed resources: css, html, images, etc. Everything in this directory will be copied to the final media directory (along with the `static` resources from other apps in your project).
fr: Le :file:`static` répertoire contiendra vos ressources fixes: css, html, images, etc. Tout dans ce répertoire sera copié dans le répertoire media finale (avec les `static` ressources d'autres applications de votre projet).

source: All of your projects templates go in the :file:`templates` directory. While no organization is required for your project specific templates, when overriding or replacing a template from another app, the path must be the same as the template to be replaced.
fr: Tous vos projets modèles doivent aller dans le :file:`templates` répertoire. Bien qu'aucune organisation est nécessaire pour vos modèles spécifiques du projet, lors de la substitution ou de remplacement d'un modèle à partir d'une autre application, le chemin doit être le même que le modèle à être remplacé.

source: Staying in sync with mainline GeoNode
fr: Rester en phase avec GeoNode mainline

source: These instructions are only valid if you've installed GeoNode using **apt-get** !!
fr: Ces instructions ne sont valables que si vous avez installé GeoNode en utilisant **apt-get** !!

source: One of the primary reasons to set up your own GeoNode project using this method is so that you can stay in sync with the mainline GeoNode as the core development team makes new releases. Your own project should not be adversely affected by these changes, but you will receive bug fixes and other improvements by staying in sync.
fr: Une des principales raisons pour mettre en place votre propre projet de GeoNode en utilisant cette méthode est rester en phase avec la GeoNode mainline pendant que l'équipe de développement de base rend les nouvelles versions. Votre propre projet ne devrait pas être affecté par ces changements, mais vous recevrez des corrections de bogues et d'autres améliorations en restant synchronisé.

source: Upgrade GeoNode::
fr: Améliorez GeoNode::

source: Verify that your new project works with the upgraded GeoNode::
fr: Vérifiez que votre nouveau projet fonctionne avec le GeoNode amélioré::

source: Navigate to http://localhost:8000.
fr: Accédez à http://localhost:8000.

source: Upgrading from source code repo:
fr: Mise à niveau à partir du dépôt de code source:

source: Theming your GeoNode project
fr: Thématisation de votre projet de GeoNode

source: There are a range of options available to you if you want to change the default look and feel of your GeoNode project. Since GeoNode's style is based on `Bootstrap <http://twitter.github.com/bootstrap/>`_ you will be able to make use of all that Bootstrap has to offer in terms of theme customization. You should consult Bootstrap's documentation as your primary guide once you are familiar with how GeoNode implements Bootstrap and how you can override GeoNode's theme and templates in your own project.
fr: Il existe une gamme d'options disponibles pour vous si vous voulez modifier le look and feel par défaut de votre projet de GeoNode. Puisque le style de GeoNode est basée sur `Bootstrap <http://twitter.github.com/bootstrap/>`_ vous serez en mesure de faire usage de tout ce qui Bootstrap a à offrir en termes de personnalisation du thème. Vous devriez consulter la documentation de Bootstrap comme guide principal une fois que vous êtes familier avec la façon GeoNode implémente Bootstrap et comment vous pouvez modifier le thème et les modèles de GeoNode dans votre propre projet.

source: Logos and graphics
fr: Logos et graphiques

source: GeoNode intentionally does not include a large number of graphics files in its interface. This keeps page loading time to a minimum and makes for a more responsive interface. That said, you are free to customize your GeoNode's interface by simply changing the default logo, or by adding your own images and graphics to deliver a GeoNode experience the way you envision int.
fr: GeoNode intentionnellement ne comprend pas un grand nombre de fichiers graphiques dans son interface. Cette garde temps de chargement de page au minimum et permet une interface plus réactive. Cela dit, vous êtes libre de personnaliser votre interface GeoNode en changeant simplement le logo par défaut, ou en ajoutant vos propres images et graphiques pour offrir une GeoNode experience la façon dont vous l'envisagez.

source: Your GeoNode project has a directory already set up for storing your own images at :file:`<my_geonode>/static/img`. You should place any image files that you intend to use for your project in this directory.
fr: Votre projet de GeoNode dispose d'un répertoire déjà mis en place pour stocker vos propres images à :file:`<my_geonode>/static/img`. Vous devez placer les fichiers d'image que vous souhaitez utiliser pour votre projet dans ce répertoire.

source: Let's walk through an example of the steps necessary to change the default logo.
fr: Passons en revue un exemple des étapes nécessaires pour changer le logo par défaut.

source: Change into the :file:`img` directory:
fr: Changez lui en :file:`img` répertoire:

source: If you haven't already, obtain your logo image. The URL below is just an example, so you will need to change this URL to match the location of your file or copy it to this location:
fr: Si vous n'avez pas déjà fait, obtenez l'image de votre logo. L'URL ci-dessous est juste un exemple, donc vous devez changer cette URL pour correspondre à l'emplacement de votre fichier ou le copier à cet emplacement:

source: Override the CSS that displays the logo by editing :file:`<my_geonode>/static/css/site_base.css` with your favorite editor and adding the following lines, making sure to update the width, height, and URL to match the specifications of your image.
fr: Remplacez la CSS qui affiche le logo en éditant :file:`<my_geonode>/static/css/site_base.css` avec votre éditeur de texte favori et en ajoutant les lignes suivantes, en veillant à mettre à jour la largeur, la hauteur, et l'URL pour correspondre aux spécifications de votre image.

source: Restart your GeoNode project and look at the page in your browser:
fr: Redémarrez votre projet GeoNode et regardez la page dans votre navigateur:

source: It is a good practice to cleanup the **static_folder** and the Browser Cache before reloading in order to be sure that the changes have been correctly taken and displayed on the screen.
fr: Il est une bonne pratique de nettoyer la **static_folder** et le cache du navigateur avant de recharger afin d'être sûr que les changements ont été correctement prises et affichées sur l'écran.

source: Visit your site at http://localhost/ or the remote URL for your site.
fr: Visitez votre site à l'adresse http://localhost/ ou l'URL pour votre site.

source: You can see that the header has been expanded to fit your graphic. In the following sections you will learn how to customize this header to make it look and function the way you want.
fr: Vous pouvez voir que l'en-tête a été élargie pour adapter à votre graphique. Dans les sections suivantes, vous apprendrez comment personnaliser cet en-tête pour le faire ressembler et fonctionner comme vous le souhaitez.

source: You should commit these changes to your repository as you progress through this section, and get in the habit of committing early and often so that you and others can track your project on GitHub. Making many atomic commits and staying in sync with a remote repository makes it easier to collaborate with others on your project.
fr: Vous devez committer ces modifications dans votre dépôt pendant que vous progressez dans cette section, et de prendre l'habitude de committer tôt et souvent pour que vous et d'autres pouvez suivre votre projet sur GitHub. Faire beaucoup de commits atomiques et de rester en phase avec un dépôt distant rend plus facile de collaborer avec d'autres sur votre projet.

source: Cascading Style Sheets
fr: Cascade de feuilles de style

source: In the last section you already learned how to override GeoNode's default CSS rules to include your own logo. You are able to customize any aspect of GeoNode's appearance this way. In the last screenshot, you saw that the main area in the homepage is covered up by the expanded header.
fr: Dans la dernière section, vous avez déjà appris comment remplacer les règles CSS par défaut de GeoNode pour inclure votre propre logo. Vous êtes en mesure de personnaliser tout aspect de l'apparence de GeoNode de cette façon. Dans la dernière capture d'écran, vous avez vu que la zone principale de la page d'accueil est couvert par la tête élargie.

source: First, we'll walk through the steps necessary to displace it downward so it is no longer hidden, then change the background color of the header to match the color in our logo graphic.
fr: Tout d'abord, nous marcherons à travers les étapes nécessaires pour le déplacer vers le bas de sorte qu'il est plus caché, puis on va changer la couleur de fond de l'en-tête pour correspondre à la couleur de notre logo graphique.

source: Reopen :file:`<my_geonode>/static/css/site_base.css` in your editor and add the following rule after the one added in the previous step:
fr: Rouvrez :file:`<my_geonode>/static/css/site_base.css` dans votre éditeur et ajoutez la règle suivante après celui ajouté à l'étape précédente:

source: Add a rule to change the background color of the header to match the logo graphic we used:
fr: Ajouter une règle pour changer la couleur de fond de l'en-tête pour assortir le graphique de logo qui nous avons utilisé:

source: Your project CSS file should now look like this:
fr: Votre fichier CSS de projet devrait maintenant ressembler à ceci:

source: Restart the development server and reload the page:
fr: Redémarrez le serveur de développement et rechargez la page:

source: You can continue adding rules to this file to override the styles that are in the GeoNode base CSS file which is built from `base.less <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/less/base.less>`_. You may find it helpful to use your browser's development tools to inspect elements of your site that you want to override to determine which rules are already applied. See the screenshot below. Another section of this workshop covers this topic in much more detail.
fr: Vous pouvez continuer à ajouter des règles à ce fichier pour remplacer les styles qui sont dans le fichier CSS de base de GeoNode qui est construit à partir de `base.less <https://github.com/GeoNode/geonode/blob/master/geonode/static/geonode/less/base.less>`_. Vous trouverez peut-être utile d'utiliser les outils de développement de votre navigateur pour inspecter les éléments de votre site que vous voulez remplacer pour déterminer quelles règles sont déjà appliquées. Voir la capture d'écran ci-dessous. Une autre section de cet workshop traite de ce sujet de manière plus détaillée.

source: *Screenshot of using Chrome's debugger to inspect the CSS overrides*
fr: *Capture d'écran de l'utilisation de débogueur de Chrome pour inspecter les remplacements CSS*

source: Templates and static pages
fr: Modèles et pages statiques

source: Now that we have changed the default logo and adjusted our main content area to fit the expanded header, the next step is to update the content of the homepage itself. Your GeoNode project includes two basic templates that you will use to change the content of your pages.
fr: Maintenant que nous avons changé le logo de défaut et ajusté notre zone de contenu principale pour adapter la tête élargie, la prochaine étape est de mettre à jour le contenu de la page d'accueil elle-même. Votre projet de GeoNode comprend deux modèles de base que vous allez utiliser pour changer le contenu de vos pages.

source: The file :file:`site_base.html` (in :file:`<my_geonode>/templates/`) is the basic template that all other templates inherit from and you will use it to update things like the header, navbar, site-wide announcement, footer, and also to include your own JavaScript or other static content included in every page in your site. It's worth taking a look at `GeoNode's base file on GitHub <https://github.com/GeoNode/geonode/blob/master/geonode/templates/base.html>`_. You have several blocks available to you to for overriding, but since we will be revisiting this file in future sections of this workshop, let's just look at it for now and leave it unmodified.
fr: Le fichier :file:`site_base.html` (en :file:`<my_geonode>/templates/`) est le modèle de base hérité par tous les autres modèles et vous l'utiliserez pour mettre à jour des choses comme l'en-tête, barre de navigation, site annonce, pied de page, et aussi pour inclure vos propres JavaScript ou autre contenu statique inclus dans chaque page de votre site. Il vaut la peine de jeter un oeil au `fichier de base de GeoNode sur GitHub <https://github.com/GeoNode/geonode/blob/master/geonode/templates/base.html>`_. Vous disposez de plusieurs blocs qui vous peuvez modifiér, mais puisque nous allons réexaminer ce dossier dans les sections futures de cet workshop, nous allons simplement le voir et le laisser non modifiée.

source: Open :file:`<my_geonode>/templates/site_base.html` in your editor:
fr: Ouvrez :file:`<my_geonode>/templates/site_base.html` dans votre éditeur:

source: You will see that it extends from :file:`base.html`, which is the GeoNode template referenced above and it currently only overrides the ``extra_head`` block to include our project's :file:`site_base.css` which we modified in the previous section. You can see on `line 22 of the GeoNode base.html template <https://github.com/GeoNode/geonode/blob/master/geonode/templates/base.html#L22>`_ that this block is included in an empty state and is set up specifically for you to include extra CSS files as your project is already set up to do.
fr: Vous verrez qu'il étend à partir de :file:`base.html`, qui est le modèles de GeoNode mentionnés ci-dessus et il remplace seulment le bloc ``extra_head`` pour inclure :file:`site_base.css` de notre projet que nous avons modifié dans la section précédente. Vous pouvez voir sur la `ligne 22 du modèle base.html de GeoNode <https://github.com/GeoNode/geonode/blob/master/geonode/templates/base.html#L22>`_ que ce bloc est inclus dans un étaient vides et est mis en place spécifiquement pour vous d'inclure des fichiers CSS supplémentaires que votre projet est déjà mis en place pour le faire.

source: Now that we have looked at :file:`site_base.html`, let's actually override a different template.
fr: Maintenant que nous avons examiné :file:`site_base.html`, nous allons effectivement remplacer un modèle différent.

source: The file :file:`site_index.html` is the template used to define your GeoNode project's homepage. It extends GeoNode's default :file:`index.html` template and gives you the option to override specific areas of the homepage like the hero area, but also allows you leave area like the "Latest Layers" and "Maps" and the "Contribute" section as they are. You are of course free to override these sections if you choose and this section shows you the steps necessary to do that below.
fr: Le fichier :file:`site_index.html` est le modèle utilisé pour définir la page d'accueil de votre projet de GeoNode. Il étend le model :file:`index.html` par défaut de GeoNode, et vous donne la possibilité de remplacer des domaines spécifiques de la page d'accueil, comme la *hero area*, mais il vous permet également de laisser sections telles que "Latest Layers" et "Maps" et la "Contribute" comme ils sont. Vous êtes bien sûr libre de remplacer ces sections si vous voulez et cette section vous montre les étapes nécessaires pour le faire ci-dessous.

source: Open :file:`<my_geonode>/templates/site_index.html` in your editor.
fr: Ouvrez :file:`<my_geonode>/templates/site_index.html` dans votre éditeur.

source: Edit the ``<h1>`` element on line 9 to say something other than "Welcome":
fr: Modifiez le ``<h1>`` élément sur la ligne 9 pour dire autre chose que "Welcome":

source: Edit the introductory paragraph to include something specific about your GeoNode project:
fr: Modifier le paragraphe d'introduction pour inclure quelque chose de spécifique au sujet de votre projet de GeoNode:

source: Change the :guilabel:`Getting Started` link to point to another website:
fr: Changez le :guilabel:`Obtenir lien route` pour pointer vers un autre site:

source: Add a graphic to the hero area above the paragraph replaced in step 3:
fr: Ajoutez un graphique à la zone de héros le paragraphe remplacé à l'étape 3 ci-dessus :

source: Your edited :file:`site_index.html` file should now look like this:
fr: Votre édité :file:`site_index.html` devrait maintenant ressembler à ceci:
