Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/004_admin_workshop.po
Languages: fr

source: Manage the metadata categories using the admin panel
fr: Gérer les catégories de métadonnées en utilisant le panneau d'administration

source: In the "Base" section of the admin panel there are the links to manage the metadata categories used in GeoNode
fr: Dans la section "Base" du panneau d'administration, il ya les liens pour gérer les catégories de métadonnées utilisées dans GeoNode

source: The metadata categories are:
fr: Les catégories de métadonnées sont:

source: The other links available should not be used.
fr: Les autres liens disponibles ne devraient pas être utilisés.

source: The Regions can be updated, deleted and added on needs. Just after a GeoNode fresh installation the regions contain all of the world countries, identified by their ISO code.
fr: Les régions peuvent être mis à jour, supprimé et ajouté sur les besoins. Juste après une nouvelle installation GeoNode les régions contiennent tous les pays du monde, identifiés par leur code ISO.

source: Being GeoNode strictly tied to the standards, the restrictions cannot be added/deleted or modified in their identifier. This behavior is necessary to keep the consistency in case of federation with the CSW catalogues.
fr: Étant GeoNode strictement liée aux normes, les restrictions ne peuvent être ajoutés / supprimés ou modifiés dans leur identifiant. Ce comportement est nécessaire pour maintenir la cohérence dans le cas de combination avec les catalogues CSW.

source: The Restrictions GeoNode description field can in any case be modified if some kind of customisation is necessary, since it's just the string that will appear on the layer metadata page. If some of the restrictions are not needed within the GeoNode instance, it is possible to hide them by unchecking the "Is choice" field.
fr: Le champ de description Restrictions de GeoNode peut en aucun cas être modifié si une sorte de personnalisation est nécessaire, car il est juste le texte qui apparaîtra sur la page couche de métadonnées. Si certaines de ces restrictions ne sont pas nécessaires au sein de l'instance de GeoNode, il est possible de les cacher en décochant la case "is choice" champ.

source: For this section the same concepts of the Restriction Code Types applies.
fr: Pour cette section, les mêmes concepts des Restriction Code Types est applicable.

source: Also for the Topic Categories the only part editable is the GeoNode description. Being standard is assumed that every possible data type will fall under these category identifiers. If some of the categories are not needed within the GeoNode instance, it is possible to hide them by unchecking the "Is choice" field.
fr: Aussi pour le Topic Categories la seule partie modifiable est la GeoNode description. Étant norme, il est supposé que chaque type de données possible tombera sous ces identificateurs de catégorie. Si certaines de ces catégories ne sont pas nécessaires au sein de l'instance de GeoNode, il est possible de les cacher en décochant la case "is choice" champ.

source: Manage the documents using the admin panel
fr: Gérer les documents en utilisant le panneau d'administration

source: As for the layers, most of the information related to the documents can and should be modified using the GeoNode's document metadata page.
fr: Comme pour les couches, la plupart des informations liées aux documents peuvent et devrait être modifié selon la page document de métadonnées du GeoNode.

source: Through the document detail page is possible to edit the metadata information. The fields related to the bounding box or the file attached should not be edited directly.
fr: Grâce à la page document détail, il est possible d'éditer les informations de métadonnées. Les domaines liés à l'emprise ou le fichier joint ne devraient pas être modifiés directement.

source: Usage of the GeoNode's Django Administration Panel
fr: Utilisation du Panneau d'administration de Django du GeoNode

source: GeoNode has an administration panel based on the Django admin which can be used to do some database operations. Although most of the operations can and should be done through the normal GeoNode interface, the admin panel provides a quick overview and management tool over the database.
fr: GeoNode a un panneau d'administration basé sur l'administration de Django qui peut être utilisé pour faire des opérations de base de données. Bien que la plupart des opérations peut et doit être fait par de l'interface GeoNode normal, le panneau d'administration fournit un outil rapide d'aperçu et de la gestion sur la base de données.

source: It should be highlighted that the sections not covered in this guide are meant to be managed through GeoNode.
fr: Il convient de souligner que les sections qui ne sont pas couverts dans ce guide sont destinés à être gérés par GeoNode.

source: Accessing the admin panel
fr: Accès au panneau d'administration

source: Only the staff users (including the superusers) can access the admin interface.
fr: Seuls les utilisateurs de personnel (y compris les super-utilisateurs) peuvent accéder à l'interface d'administration.

source: User's staff membership can be set by the admin panel itself, see how in the :ref:`admin_panel.users-groups` section.
fr: Staff Membership de l'utilisateur peut être réglé par le panneau d'administration. Voir comment le faire dans la section :ref:`admin_panel.users-groups`

source: The link to access the admin interface can be found by clicking in the upper right corner on the user name, see figure
fr: Le lien pour accéder à l'interface d'administration peut être trouvé en cliquant dans le coin supérieur droit sur le nom d'utilisateur, voir la figure

source: Manage layers using the admin panel
fr: Gérer les couches en utilisant le panneau d'administration

source: Some of the layers information can be edited directly through the admin interface although the best place is in the layer -> metadata page in GeoNode.
fr: Certaines des informations des couches peuvent être édités directement par l'interface d'administration, bien que le meilleur endroit est dans la page couche -> métadonnées, dans GeoNode.

source: Is not recommended to modify the Attributes neither the Styles.
fr: Est recommandé de ne pas modifier les attributs ni les Styles.

source: Clicking on the Layers link will present a list of layers. By selecting one of them is possible to modify some information like the metadata, the keywords etc. It's strongly recommended to limit the edits to the metadata and similar information.
fr: En cliquant sur le lien Couches présentera une liste de couches. En sélectionnant l'un d'entre eux c'est possible de modifier quelques informations comme les métadonnées, les mots-clés, etc. Il est fortement recommandé de limiter les modifications apportées aux métadonnées et des informations similaires.

source: Manage the maps using the admin panel
fr: Gérer les cartes en utilisant le panneau d'administrateur

source: Currently the maps admin panel allows more metadata options that the GeoNode maps metadata page. Thus is a good place where to add some more detailed information.
fr: Actuellement le panneau d'administration de cartes permet plus d'options de métadonnées que le GeoNode Cartes page de métadonnées. Ainsi est un bon endroit où ajouter des informations plus détaillées.

source: The "Map Layers" section should not be used.
fr: La section "Map layers" ne devrait pas être utilisé.

source: By clicking on a map in the maps list the metadata web form will be presented. Is possible to add or modify the information here. As for the layers, the more specific entries like the layers stack or the map coordinates should not be modified.
fr: En cliquant sur une carte dans les cartes liste le formulaire Web de métadonnées sera présenté. Il est possible d'ajouter ou de modifier les informations ici. Comme pour les couches, les entrées plus spécifiques comme les couches empiler ou les coordonnées de carte ne doivent pas être modifiées.

source: Manage profiles using the admin panel
fr: Gérer les profils en utilisant le panneau d'administration

source: So far GeoNode implements two distinct roles, that can be assigned to resources such as layers, maps or documents:
fr: Jusqu'ici GeoNode implémente deux rôles distincts, qui peuvent être attribuées à des ressources telles que couches, cartes ou documents:

source: party who authored the resource
fr: partie qui est l'auteur de la ressource

source: party who can be contacted for acquiring knowledge about or acquisition of the resource
fr: partie qui peut être contacté pour obtenir des informations ou de l'acquisition de la ressource

source: This two profiles can be set in the GeoNode interface by accessing the metadata page and setting the "Point of Contact" and "Metadata Author" fields respectively.
fr: Ces deux profils peuvent être placés dans l'interface de GeoNode en accédant à la page de métadonnées et le réglage des champs "Point of Contact" and "Metadata Author" , respectivement.

source: Is possible for an administrator to add new roles if needed, by clicking on the "Add Role" button in the "Base" -> "Contact Roles" section:
fr: Est possible pour un administrateur d'ajouter de nouveaux rôles si nécessaire, en cliquant sur le bouton "Ajouter un rôle" dans la "Base" -> section "Rôles de Contact" :

source: Clicking on the "People" section (see figure) will open a web for with some personal information plus a section called "Users".
fr: En cliquant sur le "peuple" section (voir figure) ouvrira un site web avec ses informations personnelles, plus une section appelée "Utilisateurs".

source: Is important that this last section is not modified here unless the administrator is very confident in that operation.
fr: Il est important que cette dernière section n'est pas modifiée ici, sauf si l'administrateur est très confiant dans cette opération.

source: Manage users and groups through the admin panel
fr: Gérer les utilisateurs et les groupes avec le panneau d'administration

source: The admin section called Auth has the link to access the Groups while the section called People has the link to access the Users, see figure
fr: La section admin appelée Auth a le lien pour accéder les groupes tandis que la section intitulée les gens a le lien d'accès des utilisateurs, voir figure

source: Users
fr: Utilisateurs

source: Adding a user
fr: Ajouter un utilisateur

source: By clicking on the "add" link on the right of the Users link is possible to add a new users to the GeoNode site. A simple form asking for username and password will be presented, see figure
fr: En cliquant sur le lien "ajouter" sur la droite de la liaison des utilisateurs est possible d'ajouter un nouveaux utilisateurs sur le site de GeoNode. Une forme simple demandant nom d'utilisateur et mot de passe sera présenté, voir figure

source: Upon clicking "save" a new form will be presented asking for some personal information and the rights the user should have.
fr: En cliquant sur "save" une nouvelle forme sera présentée demandant des informations personnelles et les droits que l'utilisateur devrait avoir.

source: For a normal, not privileged user is enough to just fill the personal information and then confirm with "save".
fr: Pour un normal, pas privilégié utilisateur, il suffit de remplir simplement les informations personnelles et puis validez par "save".

source: If the user has to access the admin panel or be a superuser it's enough just to tick the "staff" and "superuser" checkboxes.
fr: Si l'utilisateur dispose pour accéder au panneau d'administration ou d'être un super-utilisateur il est assez juste de cocher les cases "staff" et "superuser".

source: Changing a user
fr: Modification d'un utilisateur

source: To modify an existing user click on "Users" then on a username in the list. The same form will be presented.
fr: Pour modifier un utilisateur existant, cliquez sur "Utilisateurs" puis sur un nom d'utilisateur dans la liste. Le même formulaire sera présenté.

source: Groups
fr: Groupes

source: Although the "Groups" permissions system is not implemented yet in GeoNode is possible to create new groups with set of permissions which will be inherited by all the group members.
fr: Bien que le système des "groupes" d'autorisations n'est pas encore implémentée dans GeoNode, il est possible de créer de nouveaux groupes avec ensemble d'autorisations qui seront héritées par tous les membres du groupe.

source: The creation and management of a Group is done in a very similar way that the user one.
fr: La création et la gestion d'un groupe se fait d'une manière très similaire a celle de l'utilisateur

source: Management Commands for GeoNode
fr: Commandes de Gestion pour GeoNode

source: GeoNode comes with administrative commands to help with day to day tasks.
fr: GeoNode a été developpèe avec des commands administratives pour aider les utilisateurs avec leurs devoir

source: Below is the list of the ones that come from the GeoNode application, the full list can be obtained by doing::
fr: Voici la liste de ceux qui viennent de l'application de GeoNode, la liste complète peut être obtenue en faisant ::

source: Imports a file or folder with geospatial files to GeoNode.
fr: Importe un fichier ou un dossier avec fichiers de données géospatiales à GeoNode.

source: It supports data in Shapefile and GeoTiff format. It also picks up the styles if a ``.sld`` file is present.
fr: Il prend en charge les données en format Shapefile et GeoTiff. Il reprend aussi les styles si un fichier `.sld`` est présent.

source: Additional options::
fr: Options additionelles::

source: Update the GeoNode application with data from GeoServer.
fr: Mettre à jour l'application de GeoNode avec les données de GeoServer.

source: This is useful to add data in formats that are not supported in GeoNode by default, and for example to link it it to ArcSDE datastores. The updatelayers command provides several options that can be used to control how layer information is read from GeoServer and updated in GeoNode. Refer to 'Additional Options'.
fr: Ceci est utile pour ajouter des données dans des formats qui ne sont pas pris en charge dans GeoNode par défaut, et par exemple pour le relier à des banques de données ArcSDE. La commande updatelayers fournit plusieurs options qui peuvent être utilisés pour contrôler la façon dont l'information de couche est lu à partir de GeoServer et mis à jour en GeoNode. Reportez-vous à 'Options additionelles'.

source: Uses SITENAME and SITEURL to set the values of the default site object.
fr: Utilise SITENAME et SITEURL pour régler les valeurs de l'objet par défaut du site.

source: This information is used in the page titles and when sending emails from GeoNode, for example, new registrations.
fr: Cette information est utilisée dans les titres de page et en envoyant des courriels de GeoNode, par exemple, les nouvelles inscriptions.

source: Configuring Alternate CSW Backends
fr: Configuration des Backends CSW alternatives

source: `pycsw <http://pycsw.org/>`_ is the default CSW server implementation provided with GeoNode. This section will explain how to configure GeoNode to operate against alternate CSW server implementations.
fr: `pycsw <http://pycsw.org/>`_ est l'implémentation par défaut du serveur CSW fourni avec GeoNode. Cette section explique comment configurer GeoNode pour opérer contre implémentations alternatives de serveur CSW.

source: Supported CSW server implementations
fr: Implémentations de serveur CSW pris en charge

source: GeoNode additionally supports the following CSW server implementations:
fr: GeoNode supporte en outre les implémentations de serveur CSW suivantes:

source: Since GeoNode communicates with alternate CSW configurations via HTTP, the CSW server can be installed and deployed independent of GeoNode if desired.
fr: Depuis GeoNode communique avec des configurations de CSW alternatifs via HTTP, le serveur CSW peut être installé et déployé indépendant de GeoNode si désiré.

source: Installing the CSW
fr: Installation de service Web CSW

source: GeoNetwork opensource Installation
fr: Installation de GeoNetwork opensource

source: Deploy GeoNetwork opensource by downloading geonetwork.war (see http://geonetwork-opensource.org/downloads.html) and deploying into your servlet container
fr: Déployer GeoNetwork en téléchargeant geonetwork.war (voir http://geonetwork-opensource.org/downloads.html) et en le déployant dans votre conteneur de servlets

source: Follow the instructions at http://geonetwork-opensource.org/manuals/2.6.4/eng/users/quickstartguide/installing/index.html to complete the installation
fr: Suivez les instructions à http://geonetwork-opensource.org/manuals/2.6.4/eng/users/quickstartguide/installing/index.html pour terminer l'installation

source: test the server with a GetCapabilities request (http://localhost:8080/geonetwork/srv/en/csw?service=CSW&version=2.0.2&request=GetCapabilities)
fr: tester le serveur avec une demande GetCapabilities (http://localhost:8080/geonetwork/srv/fr/csw?service=CSW&version=2.0.2&request=GetCapabilities)

source: See http://geonetwork-opensource.org/docs.html for further documentation.
fr: Voir http://geonetwork-opensource.org/docs.html pour informations supplémentaires.

source: deegree Installation
fr: Installation de deegree

source: Deploy deegree by downloading the deegree3 cswDemo .war (see http://wiki.deegree.org/deegreeWiki/DownloadPage) and deploying into your servlet container
fr: Déployez deegree en téléchargeant le deegree3 cswDemo.war (voir http://wiki.deegree.org/deegreeWiki/DownloadPage) et en le déployant dans votre conteneur de servlets

source: Create a PostGIS-enabled PostgreSQL database
fr: Créer une base de données PostgreSQL with PostGIS

source: Follow the instructions at http://wiki.deegree.org/deegreeWiki/deegree3/CatalogueService#Run_your_own_installation to complete the installation
fr: Suivez les instructions à http://wiki.deegree.org/deegreeWiki/deegree3/CatalogueService#Run_your_own_installation pour terminer l'installation

source: test the server with a GetCapabilities request (http://localhost:8080/deegree-csw-demo-3.0.4/services?service=CSW&version=2.0.2&request=GetCapabilities)
fr: testez le serveur avec une demande GetCapabilities(http://localhost:8080/deegree-csw-demo-3.0.4/services?service=CSW&version=2.0.2&request=GetCapabilities)

source: See http://wiki.deegree.org/deegreeWiki/deegree3/CatalogueService for further documentation.
fr: Voir http://wiki.deegree.org/deegreeWiki/deegree3/CatalogueService pour informations supplémentaires.

source: Customizing GeoNode CSW configuration
fr: Personalization de la configuration du service CSW de GeoNode

source: At this point, the CSW alternate backend is ready for GeoNode integration. GeoNode's CSW configuration (in ``geonode/settings.py``) must be updated to point to the correct CSW. The example below exemplifies GeoNetwork as an alternate CSW backend:
fr: À ce stade, le backend alternatif CSW est prêt pour l'intégration de GeoNode. La configuration du CSW de GeoNode (sur ``geonode/settings.py``) doit être mis à jour pour pointer vers le bon CSW. L'exemple ci-dessous illustre GeoNetwork comme un alternatif CSW backend:

source: Setup steps
fr: Étapes de configuration

source: These instructions are only valid if you've installed GeoNode following the guide at :ref:`setup_configure_httpd` !!
fr: Ces instructions ne sont valables que si vous avez installé GeoNode en utilisant le guide à l'adresse :ref:`setup_configure_httpd` !!

source: If you are working remotely, you should first connect to the machine that has your GeoNode installation. You will need to perform the following steps in a directory where you intend to keep your newly created project.
fr: Si vous travaillez à distance, vous devez d'abord vous connecter à la machine qui a l'installation de votre GeoNode. Vous devrez effectuer les étapes suivantes dans un répertoire où vous avez l'intention de garder votre projet nouvellement créé.

source: You should NOT use the name *geonode* for your project as it will conflict with your default geonode package name.
fr: Vous ne devriez pas utiliser le nom *geonode* pour votre projet car il sera en conflit avec le nom de votre défaut paquet geonode.

source: These commands create a new template based on the geonode example project.
fr: Ces commandes créent un nouveau modèle basé sur l'exemple de projet de geonode.

source: Make sure that the directories are reachable and have the correct rights for the users **geonode** and **www-data**:
fr: Assurez-vous que les répertoires sont accessibles et ont les droits appropriés pour les utilisateurs **geonode** et **www-data**:

source: If you have a brand new installation of GeoNode, rename the **/home/geonode/geonode/local_settings.py.sample** to **local_settings.py** and edit it's content by setting the SITEURL and SITENAME. This file will be your main settings file for your project. It inherits all the settings from the original one plus you can override the ones that you need.
fr: Si vous avez une marque nouvelle installation de GeoNode, renommez le **/home/geonode/geonode/local_settings.py.sample** en **local_settings.py** et modifier son contenu en réglant SITEURL et SITENAME. Ce fichier sera votre fichier principaux des paramètres de votre projet. Il hérite de tous les paramètres de l'original, plus vous pouvez outrepasser ceux que vous avez besoin.

source: You can also decide to copy the **/home/geonode/geonode/local_settings.py.sample** to **/path/to/my_geonode/my_geonode/local_settings.py** in order to keep all the custom settings confined into the new project.
fr: Vous pouvez également décider de copier le **/home/geonode/geonode/local_settings.py.sample** à **/path/to/my_geonode/my_geonode/local_settings.py** afin de garder tous les paramètres personnalisés confinés dans le nouveau projet.

source: In order for the edits to the local_settings.py file to take effect, you have to restart apache.
fr: Pour que les modifications apportées au fichier de local_settings.py pour prendre effet, vous devez redémarrer apache.

source: Edit the file **/etc/apache2/sites-available/geonode.conf** and change the following directive from::
fr: Editez le fichier **/etc/apache2/sites-available/geonode.conf** et modifiez la directive suivante à partir de::

source: to::
fr: à::

source: Edit the file **/path/to/my_geonode/my_geonode/wsgi.py** and add the following lines at the beginning:
fr: Editez le fichier **/path/to/my_geonode/my_geonode/wsgi.py** et ajouter les lignes suivantes au début:

source: Edit the file /etc/apache2/sites-available/geonode.conf and modify the **DocumentRoot** as follows:
fr: Editez le fichier /etc/apache2/sites-available/geonode.conf et modifiez le **DocumentRoot** comme ça:

source: It's a good practice to make copies and backups of the configuration files before modifying or updating them in order to revert the configuration at the previous state if something goes wrong.
fr: Il est une bonne pratique de faire des copies et sauvegardes des fichiers de configuration avant de modifier ou de les mettre à jour afin de revenir à la configuration précédente de l'état si quelque chose se passe mal.

source: Then regenerate the static **JavaScript** and **CSS** files from **/path/to/my_geonode/** and restart apache
fr: Puis régénérez le **JavaScript** et **CSS** statique fichiers de **/path/to/my_geonode/** et redémarrez Apache

source: Customize the Look & Feel
fr: Personnaliser le Look & Feel

source: Now you can edit the templates in **my_geonode/templates**, the css and images to match your needs like shown in :ref:`customize.theme_admin`!
fr: Maintenant, vous pouvez modifier les modèles en **my_geonode/templates**, le css et images pour correspondre à vos besoins comme indiqué dans :ref:`customize.theme_admin`!
