Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: ssh and sudo are very basic terminal skills which you will need to deploy, maintain and develop with GeoNode. If you are not already familiar with their usage, you should review the basic descriptions below and follow the external links to learn more about how to use them effectively as part of your development workflow.
fr: ssh et sudo terminales très habiletés dont vous aurez besoin pour déployer, maintenir et développer avec GeoNode. Si vous n'êtes pas déjà familier avec leur utilisation, vous devez examiner les descriptions de base ci-dessous et suivre les liens externes pour en savoir plus sur comment les utiliser efficacement dans le cadre de votre flux de travail de développement.

source: *ssh* is the network protocol used to connect to a remote server where you run your GeoNode instance whether on your own network or on the cloud. You will need to know how to use an the ssh command from the terminal on your unix machine or how to use a ssh client like putty or winscp on windows. You may need to use pki certificates to connect to your remove server, and should be familiar with the steps and options necessary to connect this way. More information about ssh can be found in the links below.
fr: *ssh* est le protocole réseau utilisé pour se connecter à un serveur distant sur lequel vous exécutez votre instance de GeoNode que ce soit sur votre propre réseau ou sur le nuage. Vous aurez besoin de savoir comment utiliser une commande du ssh depuis le terminal sur votre machine Unix ou comment utiliser un client ssh comme du mastic ou winscp sur les fenêtres. Vous devrez peut-être utiliser des certificats PKI pour vous connecter à votre serveur de retrait, et devez être familier avec les étapes et les options nécessaires à la connexion de cette façon. Plus d'informations sur ssh peut être trouvées dans les liens ci-dessous.

source: *sudo* is the command used to execute a terminal command as the superuser when you are logged in with a normal user. You will to use sudo in order to start, stop and restart key services on your GeoNode instance. If you are not able to grant yourself these privileges on the machine you are using for your GeoNode instance, you may need to consult with your network administrator to arrange for your user to be granted sudo permissions. More information about sudo can be found in the links below.
fr: *sudo* est la commande utilisée pour exécuter une commande terminale tant que super-utilisateur, lorsque vous êtes connecté avec un utilisateur normal. Cela vous permettra d'utiliser sudo pour démarrer, arrêter et redémarrer les services clés sur votre instance de GeoNode. Si vous n'êtes pas en mesure de vous accorder ces privilèges sur l'ordinateur que vous utilisez pour votre instance de GeoNode, vous devrez peut-être consulter votre administrateur réseau afin d'organiser votre utilisateur de bénéficier d'autorisations de sudo. Plus d'informations sur sudo peuvent être trouvées dans les liens ci-dessous.

source: *Bash* is the most common unix shell which will usually be the default on servers where you will be deploying your GeoNode instance. You should be familiar with the most common bash commands in order to be able to deploy, maintain and modify a geonode instance. More information about Bash and common bash commands can be found in the links below.
fr: *Bash* est le plus commun shell unix qui sera généralement la valeur par défaut sur les serveurs où sera déployée votre instance de GeoNode. Vous devez être familiarisé avec les commandes bash les plus courantes afin de pouvoir déployer, maintenir et modifier une instance geonode. Plus d'informations sur Bash et commandes bash courantes se trouvent dans les liens ci-dessous.

source: *apt* is the packaging tool that is used to install GeoNode on ubuntu and other debian based systems. You will need to be familiar with adding Personal Package Archives to your list of install sources, and will need to be familiar with basic apt commands. More information about apt can be found in the links below.
fr: *apt* est l'outil d'empaquetage qui est utilisé pour installer GeoNode sur ubuntu et autres systèmes basés sur debian. Vous devez être familier avec l'ajout des Archives personnelles de paquet à votre liste de sources, l'installer et devrez vous familiariser avec les commandes apt de base. Plus d'informations sur apt peuvent être trouvées dans les liens ci-dessous.

source: Python Development Tools
fr: Outils de développement python

source: The GeoNode development process relies on several widely used python development tools in order to make things easier for developers and other users of the systems that GeoNode developers work on or where GeoNodes are deployed. They are considered best practices for modern python development, and you should become familiar with these basic tools and be comfortable using them on your own projects and systems.
fr: Le GeoNode processus de développement s'appuie sur plusieurs outils de développement de Python afin de faciliter les choses pour les développeurs et autres utilisateurs des systèmes qui fonctionnent de développeurs GeoNode sur les outils de développement python où sont déployées des GeoNodes. Elles sont considérées comme les meilleures pratiques pour le développement de python moderne, et vous devriez vous familiariser avec ces outils de base et être à l'aise sur vos propres projets et systèmes.

source: *virtualenv* is a tool used to create isolated python development environments such that the the versions of project dependencies are sandboxed from the system-wide python packages. This eliminates the commonly encountered problem of different projects on the same system using different versions of the same library. You should be familiar with how to create and activate virtual environments for the projects you work on. More information about virtualenv can be found in the links below.
fr: *virtualenv* est un outil utilisé pour créer des environnements de développement python isolés tels que les versions des dépendances du projet qui sont en bac à sable de paquets python à l'échelle du système. Cela élimine le problème souvent rencontré de projets différents sur le même système à l'aide de différentes versions de la même bibliothèque. Vous devez être familier avec la façon de créer et d'activer des environnements virtuels pour les projets que vous travaillez sur. Plus d'informations sur virtualenv peuvent être trouvés dans les liens ci-dessous.

source: *virtualenvwrapper* is a wrapper around the virtualenv package that makes it easier to create and switch between virtual environments as you do development. Using it will make your life much easier, so its recommended that you install and configure it and use its commands as part of your virtualenv workflow. More info about virtualenvwrapper can be found in the links below.
fr: *virtualenvwrapper* est un wrapper autour du paquet virtualenv qui rend plus facile de créer et de basculer entre des environnements virtuels. L'utiliser vous rendra la vie plus facile, donc il est recommandé que vous l' installiez, le configurier et utiliseiz ses commandes dans le cadre de votre flux de travail virtualenv. Plus d'infos sur virtualenvwrapper peuvent être trouvées dans les liens ci-dessous.

source: *pip* is a tool for installing and managing python packages. Specifically it is used to install and upgrade packages found in the Python Pacakge Index. GeoNode uses pip to install itself, and to manage all of the python dependencies that are needed as part of a GeoNode instance. As you learn to add new modules to your geonode, you will need to become familiar with the use of pip and about basic python packaging usage. More information about pip can be found in the links below.
fr: *pip* est un outil d'installation et de gestion des paquets python. Plus précisément, il est utilisé pour installer et mettre à niveau les packages trouvés dans l'Index de Pacakge Python. GeoNode utilise le pip pour installer et gérer toutes les dépendances de python qui sont nécessaires dans le cadre d'une instance de GeoNode. Pour apprendre à ajouter de nouveaux modules à votre geonode, vous aurez besoin de vous familiariser avec l'utilisation de pip et de l'utilisation de packaging de python de base. On trouvera plus d'informations sur la pip dans les liens ci-dessous.

source: miscellaneous
fr: divers

source: *ipython* is a set of tools to make your python development and debugging experience easier. The primary tool you want to use is an interactive shell that adds introspection, integrated help and command completion and more. While not strictly required to do GeoNode development, learning how to use ipython will make your development more productive and pleasant. More information about ipython can be found in the links below.
fr: *ipython* est un ensemble d'outils qui rend votre python de développement et de débogage une expérience plus facile. Le principal outil que vous souhaitez utiliser est un shell interactif qui ajoute l'introspection, aide intégrée et achèvement de la commande et plus encore. Bien que pas strictement nécessaire pour faire du développement GeoNode, apprendre à utiliser ipython fera votre développement plus productif et agréable. Plus d'informations sur ipython peuvent être trouvées dans les liens ci-dessous.

source: *pdb* is a standard python module that is used to interactively debug your python code. It supports setting conditional breakpoints so you can step through the code line by line and inspect your variables and perform arbitrary execution of statements. Learning how to effectively use pdb will make the process of debugging your application code significantly easier. More information about pdb can be found in the links below.
fr: *pdb* est un module python standard qui est utilisé pour déboguer votre code python. Il prend en charge le réglage des points d'arrêt conditionnels donc vous pouvez parcourir le code ligne par ligne et inspectez vos variables et effectuer une exécution arbitraire des déclarations. Apprendre à utiliser efficacement les pdb rendra le processus de débogage de votre code d'application beaucoup plus facile. On trouvera plus d'informations sur APB dans les liens ci-dessous.

source: GeoNode is built on top of the *Django web framework*, and as such, you will need to become generally familiar with Django itself in order to become a productive GeoNode developer. Django has excellent documentation, and you should familiarize yourself with Django by following the Django workshop and reading through its documentation as required.
fr: GeoNode est construit sur le dessus de la *framework web Django*, et à ce titre, vous devrez vous familiariser généralement avec Django lui-même afin de devenir un développeur GeoNode productif. Django a d' excellentes documentations, et vous devriez vous familiariser avec Django en lisant sa documentation selon les besoins.

source: Django is based on the Model Template View paradigm (more commonly called Model View Controller). Models are used to define objects that you use in your application and Django's ORM is used to map these models to a database. Views are used to implement the business logic of your application and provide objects and other context for the templates. Templates are used to render the context from views into a page for display to the user. You should become familiar with this common paradigm used in most modern web frameworks, and how it is specifically implemented and used in Django. The Django tutorial itself is a great place to start. More information about MTV in Django can be found in the links below.
fr: Django est basé sur le Model Template View paradigme (plus communément appelé Model View Controller). Les modèles sont utilisés pour définir les objets que vous utilisez dans votre application et l'ORM de Django est utilisé pour mapper ces modèles à une base de données.Les vues sont utilisées pour mettre en œuvre la logique métier de votre application et fournir des objets et d'autres contextes pour les modèles. Les modèles sont utilisés pour rendre le contexte de vues dans une page pour l'affichage à l'utilisateur. Vous devez vous familiariser avec ce paradigme commun utilisé dans la plupart des frameworks web modernes, et comment il est spécifiquement mis en œuvre et utilisé dans Django. Le tutoriel de Django lui-même est un excellent endroit pour commencer. Plus d'informations sur MTV dans Django peut être trouvé dans les liens ci-dessous.

source: Django and all other web frameworks are based on the HTTP Request Response cycle. Requests come in to the server from remote clients which are primarily web browsers, but also can be api clients, and the server returns with a Response. You should be familiar with these very basic HTTP principles and become familiar with the way that Django implements them. More information about HTTP, Requests and Responses and Djangos implementation in the links below.
fr: Cycle de Django et tous les autres web cadres reposent sur la réponse de demande HTTP. Les demandes viennent dans un serveur des clients distants qui sont principalement des navigateurs web, mais peuvent également être clients de l'api, et le serveur renvoie une réponse. Vous devez être familier avec ces principes fondamentaux de HTTP et vous familiariser avec la manière que Django est mit en œuvre. Plus d'informations sur l'implémentation de HTTP, les demandes et les réponses et les Djangos dans les liens ci-dessous.

source: Management Commands
fr: Commandes de gestion

source: Django projects have access to a set of management commands that are used to manage your project. Django itself provides a set of these commands, and django apps (including GeoNode) can provide their own. Management commands are used to do things like synchronize your models with your database, load data from fixtures or back up your database with fixtures, start the development server, initiate the debugger and many other things. GeoNode provides management commands for synchronizing with a GeoServer or updating the layers already in your GeoNode. You should become familiar with the basic management commands that come with Django, and specifically with the commands that are part of GeoNode. The GeoNode specific commands are covered in section. More information about management commands can be found in the links below.
fr: Les projets de Django ont accès à un ensemble de commandes de gestion qui sont utilisés pour gérer votre projet. Django lui-même fournit un ensemble de ces commandes, et les applications de Django (y compris GeoNode) peuvent fournir leur propre. Les commandes de gestion sont utilisés pour faire des choses comme synchroniser vos modèles avec votre base de données, des données de charge de luminaires ou de sauvegarder votre base de données avec les appareils, démarrer le serveur de développement, lancer le débogueur et bien d'autres choses. GeoNode fournit des commandes de gestion pour la synchronisation avec un GeoServer ou mettre à jour les couches déjà dans votre GeoNode. Vous devez vous familiariser avec les commandes de gestion de base qui viennent avec Django, et plus particulièrement avec les commandes qui font partie de GeoNode. Les commandes spécifiques GeoNode sont couvertes dans la section. Plus d'informations sur les commandes de gestion peuvent être trouvées dans les liens ci-dessous.

source: Django Admin Interface
fr: Interface d'administration de Django

source: Django provides a build-in management console that administrators and developers can use to look at the data in the database that is part of the installed applications. Administrators can use this console to perform many common administration tasks that are a necessary part of running a GeoNode instance, and as a developer, you will use this interface during your development process to inspect the database and the data stored in your models. More information about the django admin interface can be found in the links below.
fr: Django fournit une console de gestion accumulation que les administrateurs et les développeurs peuvent utiliser pour examiner les données dans la base de données qui fait partie des applications installées. Les administrateurs peuvent utiliser cette console pour effectuer de nombreuses tâches d'administration courantes qui sont une partie nécessaire de la gestion d'une instance GeoNode, et en tant que développeur, vous utiliser cette interface lors de votre processus de développement pour 'inspecter la base de données et les données stockées dans vos modèles. Plus d'informations sur l'interface d'admin de Django peut être trouvé dans les liens ci-dessous.

source: Template Tags
fr: Etiquette du Modèle

source: Django templates make use of a set of tags to inject, filte and format content into a rendered HTML page. Django itself includes a set of built-in template tags and filters that you will use in your own templates, and GeoNode provides a geonode specific set of tags that are used in the GeoNode templates. You should become familiar with the built-in tag set and with GeoNode's specific tags as you work on developing your own templates or extending from GeoNode's. More information about Django template tags can be found in the links below.
fr: Les modèles de Django font usage d'un ensemble de balises pour injecter, filte et le contenu de format dans une page HTML rendue. Django lui-même comprend un ensemble de balises et filtres modèles intégrés que vous allez utiliser dans vos propres modèles, et GeoNode fournit un ensemble spécifique de geonode de balises qui sont utilisés dans les modèles de GeoNode. Vous devez vous familiariser avec l'étiquette ensemble intégré et avec des étiquettes spécifiques de GeoNode. Vous travaillez sur le développement de vos propres modèles ou de l'extension de son GeoNode. Plus d'informations sur Django balises de modèle peut être trouvé dans les liens ci-dessous.

source: Install GDAL for Development
fr: Installer GDAL pour le développement

source: In order to install GDAL (1.10.0+) in developing mode, in a virtual environment, on Ubuntu 12.04 the following steps may be required. If you have already tried any of the approaches suggested elsewhere, it is recommended that, unless you know that this may affect other software, you do a full purge of any existing GDAL-related packages.
fr: Afin d'installer GDAL (1.10.0+) dans le développement de mode, dans un environnement virtuel, sur Ubuntu 12.04 les étapes suivantes peuvent être nécessaires. Si vous avez déjà essayé des approches suggérées ailleurs, il est recommandé que, sauf si vous savez que cela peut affecter les autres logiciels, vous faire une purge complète de tous les packages existants liés GDAL.

source: Install GDAL in your host environment
fr: Installation de GDAL dans votre environnement hôte

source: Test that GDAL is installed in your host environment
fr: Test que GDAL est installé dans votre environnement hôte

source: Take note of the GDAL Version
fr: Prendre note de la Version de GDAL

source: Assuming that your geonode directory is installed directly off of your home directory, download and configure GDAL
fr: En supposant que votre répertoire geonode est installé directement hors de votre répertoire home, télécharger et configurer GDAL

source: Test that GDAL is installed in your virtual environment
fr: Test que GDAL est installé dans votre environnement virtuel

source: Install GeoNode for Development
fr: Installer GeoNode pour le développement

source: In order to install Geonode 2.0 in developing mode on Ubuntu 12.04 the following steps are required:
fr: Afin d'installer Geonode 2.0 dans le développement de mode sur Ubuntu 12.04 les étapes suivantes sont nécessaires :

source: For Windows: (:ref:`install_win_devmode`)
fr: Pour Windows: (:ref:`install_win_devmode`)

source: Summary of the installation steps
fr: Résumé de la procédure d'installation

source: Retrieve latest apt-get list
fr: Récupérer la dernière liste d'apt-get

source: Install build tools and libraries
fr: Installer les outils et bibliothèques de compilation

source: Install dependencies (Python, Postgresql and Java) and supporting tools
fr: Installez les dépendances (Python, Postgresql et Java) et outils de soutien

source: Add Nodejs PPA and other tools required for static development
fr: Ajouter Nodejs PPA et autres outils nécessaires au développement statique

source: Set up a virtual environment (virtualenv)
fr: Mettre en place un environnement virtuel (virtualenv)

source: Clone geonode from github and install it in the virtual environment
fr: Clone geonode de github et installez-le dans l'environnement virtuel

source: Run paver to get install geoserver and start the development servers
fr: Exécutez paver pour obtenir geoserver installer et démarrer les développement des serveurs

source: Compile and Start the server
fr: Compiler et démarrer le serveur

source: Start Geonode instance
fr: Démarrer une instance Geonode

source: To stop the server
fr: Pour arrêter le serveur

source: Next create a superuser for your django geonode
fr: Ensuite, créez un superutilisateur pour votre geonode de django

source: The following steps have to be executed in your terminal. The steps have to be done as a **root user**, therefore don´t forget to type sudo in front!
fr: Les étapes suivantes doivent être exécutées dans votre terminal. Les étapes doivent être faites comme un **root user**, donc don´t oublier de taper sudo devant !

source: Don't forget to stop the **GeoNode Production** services if enabled
fr: N'oubliez pas d'arrêter le **GeoNode Production** services si activée

source: If possible log as **root** user, open a terminal and ``cd /home/geonode/dev``
fr: Si possible, connectez-vous comme **root** utilisateur, ouvrez un terminal et ``cd /home/geonode/dev``

source: Install dependencies
fr: Installer les dépendances

source: *Python native dependencies*
fr: *Python natif dépendances*

source: *Install Python Virtual Environment*
fr: *Installer Python environnement virtuel*

source: The following steps must be executed **only** if you don't have PostgreSQL and PostGIS already installed on your system (see :ref:`install_geonode_application`)
fr: Les étapes suivantes doivent être exécutées **seulement** si vous n'avez pas PostgreSQL et PostGIS déjà installés sur votre système (voir :ref:`install_geonode_application`)

source: Change postgres UNIX password
fr: Changer mot de passe postgres UNIX

source: Create geonode role and database
fr: Créer la base de données et le rôle de geonode

source: Edit PostgreSQL configuration file ::
fr: Modifiez le fichier de configuration de PostgreSQL::

source: Scroll to the bottom of the file and edit this line ::
fr: Faites défiler vers le bas du fichier et modifiez cette ligne::

source: As follows ::
fr: Comme suit ::

source: Restart PostgreSQL to make the changes effective ::
fr: Redémarrez PostgreSQL pour valider les modifications ::

source: *Java dependencies*
fr: *Java dépendances*

source: The following steps must be executed **only** if you don't have a Java JDK or JRE already installed on your system (see :ref:`install_geonode_application`)
fr: Les étapes suivantes doivent être exécutées **seulement** si vous n'avez pas un Java JDK ou un JRE installé sur votre système (voir :ref:`install_geonode_application`)

source: *supporting tools*
fr: *Outils de support*

source: Set up a virtual environment
fr: Mettre en place un environnement virtuel

source: Here is where Geonode will later be running.
fr: Voici où Geonode plus tard s'exécutera.

source: Add the virtualenvwrapper to your new environement.
fr: Ajouter le virtualenvwrapper à votre nouvel environnement.
