Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: The gsconfig library provides a rich interface to interacting with GeoServer's REST API. This allows high-level functions as well as viewing raw REST responses.
fr: La bibliothèque de gsconfig fournit une interface riche pour interagir avec l'API REST de GeoServer. Cela permet à des fonctions de haut niveau ainsi que la visualisation des réponses premières REST.

source: GeoNode debugging techniques
fr: Techniques de débogage GeoNode

source: GeoNode can be difficult to debug as there are several different components involved:
fr: GeoNode peut être difficile à déboguer, car il y a plusieurs composants impliqués :

source: Browser - includes HTML/CSS issues, JavaScript, etc.
fr: Navigateur - comprend des questions HTML/CSS, JavaScript, etc..

source: Django - GeoNode HTML views and web APIs
fr: Django - vues GeoNode HTML et web API

source: GeoServer - Core Wxx services and Platform REST APIs
fr: GeoServer - Wxx Core services et API de la plate-forme reste

source: When attempting to diagnose a specific problem, often the order of investigation mirrors the order above - that is, start with the client: Is this a bug in code running on the browser. If not, step to the next level: the Django responses to client requests. Often this is possible via the browser using the correct tools. Many requests require Django communications with GeoServer. This is the next stage of investigation if a specific bug does not appear to originate in Django or the client.
fr: Lorsque vous tentez de diagnostiquer un problème spécifique, souvent l'ordre d'enquête reflète l'ordre ci-dessus - qui commence par le client : est-ce un bug dans le code qui s'exécute sur le navigateur. Si non, l'étape au niveau suivant : les réponses de Django aux demandes du client. Souvent, cela est possible via le navigateur en utilisant les bons outils. Nombreuses demandes exigeant des communications de Django avec GeoServer. Il s'agit de la prochaine étape de l'enquête si un bug spécifique ne semble pas provenir de Django ou le client.

source: The following section covers techniques to help diagnose and debug errors.
fr: La section suivante couvre les techniques permettant de diagnostiquer et de déboguer les erreurs.

source: Debugging GeoNode's Python Components
fr: Débogage des composants Python de GeoNode

source: Logging is controlled by the contents of the logging data structure defined in the :file:`settings.py`. The default settings distributed with GeoNode are configured to only log errors. During development, it's a good idea to override the logging data structure with something a bit more verbose.
fr: L' enregistrement est contrôlé par le contenu de l'enregistrement des données de structure défini dans le :file:`settings.py`. Les paramètres par défaut distribués avec GeoNode sont configurés pour n'enregistrer que des erreurs. Au cours du développement, c'est une bonne idée de remplacer la structure de données de journalisation avec quelque chose d'un peu plus bavard.

source: Output
fr: Sortie

source: In production, logging output will go into the apache error log. This is located in :file:`/var/log/apache2/error.log`. During development, logging output will, by default, go to standard error.
fr: En production, la sortie du logging ira dans le log d'erreur apache. Celui-ci se trouve dans :file:`/var/log/apache2/error.log`. Au cours du développement,les sorties d'enregistrement iront, par défaut, à l'écart-type.

source: Configuring
fr: Configuration

source: Ensure the 'console' handler is at the appropriate level. It will ignore log messages below the set level.
fr: Assurez-vous que le gestionnaire de "console" est au niveau approprié. Il ignorera les messages du journal sous le niveau de jeu.

source: Ensure the specific logger you'd like to use is set at the correct level.
fr: Vérifiez que le journal spécifique que vous souhaitez utiliser soit défini au niveau correct.

source: If attempting to log SQL, ensure ``DEBUG=True`` in your :file:`local_settings.py`.
fr: Si vous prévoyez de vous connecter à SQL, faire en sorte ``DEBUG=True`` dans vos :file:`local_settings.py`.

source: Debugging SQL
fr: Débogage SQL

source: To trace all SQL in django, configure the ``django.db.backends`` logger to ``DEBUG``
fr: Pour Vectoriser tous SQL dans django, configurer l'enregistreur de la ``django.db.backends`` à ``DEBUG``

source: To examine a specific query object, you can use the ``query`` field: str(Layer.objects.all().query)
fr: Pour examiner un objet de requête spécifique, vous pouvez utiliser le champ ``query``: str(Layer.objects.all().query)

source: You can gather more information by using ``django.db.connection.queries``. When ``DEBUG`` is enabled, query SQL and timing information is stored in this list.
fr: Vous pouvez collecter plus d'informations à l'aide de ``django.db.connection.queries``. Lorsque ``DEBUG`` est activée, requête SQL et la synchronisation des informations sont stockées dans cette liste.

source: Hints
fr: Astuces

source: Don't use print statements. They are easy to use in development mode but in production they will cause failure.
fr: N'utilisez pas des instructions print. Elles sont faciles à utiliser en mode de développement, mais causeront un échec dans la production .

source: Take advantage of python. Instead of:
fr: Profitez de python. Au lieu de:

source: Use:
fr: Usage:

source: Excercises:
fr: Exercices :

source: Enable logging of all SQL statements. Visit some pages and view the logging output.
fr: Activer la journalisation de toutes les instructions SQL. Visitez quelques pages et affichez la sortie d'enregistrement.

source: Using the python shell, use the ``queries`` object to demonstrate the results of specific queries.
fr: À l'aide de l'interpréteur de commandes python, utilisez l'objet de ``questions`` pour démontrer les résultats des requêtes spécifiques.

source: Reference:
fr: Référence :

source: For the adventurous, ``pdb`` allows for an interactive debugging session. This is only possible when running in a shell via ``manage.py runserver`` or ``paver runserver``.
fr: Pour le plus aventureux, ``pdb`` permet une session de débogage interactive. Cela n'est possible que lors de l'exécution dans un shell via ``manage.py runserver`` ou ``paver runserver``.

source: To set a breakpoint, insert the following code before the code to debug.
fr: Pour définir un point d'arrêt, insérez le code suivant avant le code de débogage.

source: When execution reaches this statement, the debugger will activate. The commands are noted in the link above. In addition to those debugger specific commands, general python statements are supported. For example, typing the name of a variable in scope will yield the value via string coersion. Typing "n" will execute the next line, "c" wil continue the execution of the program, "q" will quit.
fr: Lorsque l'exécution atteint cette instruction, le débogueur s'activera. Les commandes sont indiquées dans le lien ci-dessus. En plus de ces commandes de débogueur spécifique, des déclarations générales python sont pris en charge. Par exemple, taper le nom d'une variable dans la portée donnera la valeur via la chaîne contrainte. "n" exécutera la ligne suivante, "c" continuera l'exécution du programme, "q" va renoncer.

source: gsconfig is a python library for manipulating a GeoServer instance via the GeoServer RESTConfig API.
fr: gsconfig est une bibliothèque python pour manipuler une instance GeoServer via l'API RESTConfig de GeoServer.

source: The project is distributed under a `MIT License <LICENSE.txt>`_ .
fr: Le projet est distribué sous une `MIT License <LICENSE.txt>`_ .

source: Installing
fr: Installation

source: For developers:
fr: Pour les développeurs.

source: Getting Help
fr: Obtention d'aide

source: There is a brief manual at http://boundlessgeo.github.io/gsconfig/ . If you have questions, please ask them on the GeoServer Users mailing list: http://geoserver.org/comm/ .
fr: Il y a un bref manuel à http://boundlessgeo.github.io/gsconfig/. Si vous avez des questions, veuillez les poser sur la liste de diffusion des utilisateurs de GeoServer : http://geoserver.org/comm/.

source: Please use the Github project at http://github.com/boundlessgeo/gsconfig for any bug reports (and pull requests are welcome, but please include tests where possible.)
fr: S'il vous plaît utiliser le projet Github à http://github.com/boundlessgeo/gsconfig pour tout rapport de bug (et pull requêtes sont les bienvenus, mais s'il vous plaît incluez des essais si possible).

source: Sample Layer Creation Code
fr: Code de création de couche échantillon

source: Running Tests
fr: Exécution de Tests

source: Since the entire purpose of this module is to interact with GeoServer, the test suite is mostly composed of `integration tests <http://en.wikipedia.org/wiki/Integration_testing>`_. These tests necessarily rely on a running copy of GeoServer, and expect that this GeoServer instance will be using the default data directory that is included with GeoServer. This data is also included in the GeoServer source repository as ``/data/release/``. In addition, it is expected that there will be a postgres database available at ``postgres:password@localhost:5432/db``. You can test connecting to this database with the ``psql`` command line client by running ``$ psql -d db -Upostgres -h localhost -p 5432`` (you will be prompted interactively for the password.)
fr: Alors que le but de ce module est d'interagir avec GeoServer, la suite de test est principalement composée de `tests d'intégration <http://en.wikipedia.org/wiki/Integration_testing>`_. Ces tests reposent nécessairement sur une copie de fonctionnement de GeoServer, et attendent que cette instance GeoServer utilise le répertoire de données par défaut qui est inclus avec GeoServer. Ces données sont également inclues dans le référentiel source GeoServer que ``/data/release/``. En outre, il est prévu qu'il y aura une base de données postgres disponible à ``postgres:password@localhost:5432/db``. Vous pouvez tester la connexion à cette base de données avec le client en ligne de commande ``psql`` en exécutant ``$ psql -d db -Upostgres -h localhost -p 5432`` (vous serez invité interactivement pour le mot de passe.)

source: To override the assumed database connection parameters, the following environment variables are supported:
fr: Pour substituer les paramètres de connexion de base de données supposé,des variables d'environnement suivants sont prises en charge :

source: If present, psycopg will be used to verify the database connection prior to running the tests.
fr: S'il est présent, psycopg servira à vérifier la connexion de base de données avant d'exécuter les tests.

source: If provided, the following environment variables will be used to reset the data directory:
fr: Si fourni, les variables d'environnement suivantes serviront à réinitialiser le répertoire de données :

source: Location of git repository to read the clean data from. If only this option is provided `git clean` will be used to reset the data.
fr: Emplacement du dépôt git pour lire les données propres . Si cette option est fournie `git clean` servira à réinitialiser les données.

source: Optional location of the data dir geoserver will be running with. If provided, `rsync` will be used to reset the data.
fr: L'emplacement optionnel de la données dir geoserver s'exécutera. Si fourni, `rsync` servira à réinitialiser les données.

source: Optional environment variable allowing the catalog test cases to automatically download and start a vanilla GeoServer WAR form the web. Be sure that there are no running services on HTTP port 8080.
fr: Variable d'environnement facultatif permettant les cas de test de catalogue pour automatiquement télécharger et démarrer une forme de guerre GeoServer vanille le web. N'oubliez pas qu'il n'y a aucun service en cours d'exécution sur le port HTTP 8080.

source: Here are the commands that I use to reset before running the gsconfig tests:
fr: Voici les commandes que j'utilise pour remettre à zéro avant d'exécuter les tests de gsconfig :

source: At this point, GeoServer will be running foregrounded, but it will take a few seconds to actually begin listening for http requests. You can stop it with ``CTRL-C`` (but don't do that until you've run the tests!) You can run the gsconfig tests with the following command:
fr: À ce stade, GeoServer s'exécutera en avant, mais il faudra quelques secondes pour commencer réellement à l'écoute des requêtes http. Vous pouvez l'arrêter avec ``CTRL-C`` (mais ne le faites pas jusqu'à ce que vous avez exécuté les tests!) Vous pouvez exécuter les tests de gsconfig avec la commande suivante :

source: Instead of restarting GeoServer after each run to reset the data, the following should allow re-running the tests:
fr: Au lieu de redémarrer GeoServer après chaque course , réinitialiser les données, ce qui suit devrait permettre réexécuter les tests :

source: More Examples - Updated for GeoServer 2.4+
fr: Exemples plus - mise à jour pour GeoServer 2.4 +

source: Loading the GeoServer ``catalog`` using ``gsconfig`` is quite easy. The example below allows you to connect to GeoServer by specifying custom credentials.
fr: Il est assez facile de charger la GeoServer ``catalog`` à l'aide de ``gsconfig``. L'exemple ci-dessous permet de vous connecter à GeoServer en spécifiant les informations d'identification personnalisées.

source: The code below allows you to create a FeatureType from a Shapefile
fr: Le code ci-dessous permet de créer un FeatureType d'un Shapefile

source: It is possible to create JDBC Virtual Layers too. The code below allow to create a new SQL View called ``my_jdbc_vt_test`` defined by a custom ``sql``.
fr: Il est possible de créer un calque virtuel JDBC trop. Le code ci-dessous permet de créer une nouvelle vue de SQL, appelée ``my_jdbc_vt_test``, définie par une coutume ``sql``.

source: This example shows how to easily update a ``layer`` property. The same approach may be used with every ``catalog`` resource
fr: Cet exemple montre comment mettre à jour une propriété de la ``couche``. La même approche peut être utilisée avec toutes les ressources ``catalogue``

source: Deleting a ``store`` from the ``catalog`` requires to purge all the associated ``layers`` first. This can be done by doing something like this:
fr: Pour supprimer une ``store`` du ``catalogue``, vous devez purger tous les associés ``couches`` tout d'abord. Ceci peut être fait en faisant quelque chose comme ceci :

source: There are some functionalities allowing to manage the ``ImageMosaic`` coverages. It is possible to create new ImageMosaics, add granules to them, and also read the coverages metadata, modify the mosaic ``Dimensions`` and finally query the mosaic ``granules`` and list their properties.
fr: Il y a certaines fonctionnalités permettant de gérer les couvertures de ``ImageMosaic``. Il est possible de créer de nouvelles ImageMosaics,de leur ajouter des granules, lire les métadonnées de couvertures, modifier la mosaïque ``Dimensions`` et enfin interroger la mosaïque ``granulés`` et leurs propriétés de la liste.

source: The gsconfig methods map the `REST APIs for ImageMosaic <http://docs.geoserver.org/stable/en/user/rest/examples/curl.html#uploading-and-modifying-a-image-mosaic>`_
fr: Les méthodes gsconfig cartent le `REST API pour ImageMosaic <http://docs.geoserver.org/stable/en/user/rest/examples/curl.html#uploading-and-modifying-a-image-mosaic>`_

source: In order to create a new ImageMosaic layer, you can prepare a zip file containing the properties files for the mosaic configuration. Refer to the GeoTools ImageMosaic Plugin guide in order to get details on the mosaic configuration. The package contains an already configured zip file with two granules. You need to update or remove the ``datastore.properties`` file before creating the mosaic otherwise you will get an exception.
fr: Afin de créer une nouvelle couche de ImageMosaic, vous pouvez préparer un fichier zip contenant les fichiers de propriétés pour la configuration de la mosaïque. Consultez le guide de GeoTools ImageMosaic Plugin afin d'obtenir des détails sur la configuration de la mosaïque. Le package contient un fichier zip déjà configuré avec deux granules. Vous devez mettre à jour ou supprimer le fichier ``datastore.properties`` avant de créer la mosaïque sinon vous obtiendrez une exception.

source: By defualt the ``cat.create_imagemosaic`` tries to configure the layer too. If you want to create the store only, you can specify the following parameter
fr: Par defaut le ``cat.create_imagemosaic`` essaie de configurer la couche aussi. Si vous souhaitez créer le magasin seulement, vous pouvez spécifier le paramètre suivant

source: In order to retrieve from the catalog the ImageMosaic coverage store you can do this
fr: Afin de récupérer le catalogue du magasin de couverture ImageMosaic vous pouvez le faire

source: It is possible to add more granules to the mosaic at runtime. With the following method you can add granules already present on the machine local path.
fr: Il est possible d'ajouter plus de granules à la mosaïque à l'exécution. Avec la méthode suivante, vous pouvez ajouter granules déjà présents sur le chemin d'accès local de la machine.

source: The method below allows to send granules remotely via POST to the ImageMosaic. The granules will be uploaded and stored on the ImageMosaic index folder.
fr: La méthode ci-dessous permet d'envoyer des granules à distance via POST à l'ImageMosaic. Les granules seront téléchargées et stockées sur le dossier d'index ImageMosaic.

source: To delete an ImageMosaic store, you can follow the standard approach, by deleting the layers first. *ATTENTION*: at this time you need to manually cleanup the data dir from the mosaic granules and, in case you used a DB datastore, you must also drop the mosaic tables.
fr: Pour supprimer un magasin ImageMosaic, vous pouvez suivre l'approche standard, en supprimant les couches tout d'abord. *ATTENTION*: en ce moment vous devez nettoyer manuellement le répertoire de données des granules mosaïque et, dans le cas où vous avez utilisé un magasin de données de DB, vous devez également supprimer les tableaux de mosaïque.

source: The method below allows you the load and update the coverage metadata of the ImageMosaic. You need to do this for every coverage of the ImageMosaic of course.
fr: La méthode ci-dessous permet la charge et mise à jour des métadonnées de la couverture de l' ImageMosaic. Vous devez procéder ainsi pour chaque couverture de l' ImageMosaic bien sûr.

source: By default the ImageMosaic layer has not the coverage dimensions configured. It is possible using the coverage metadata to update and manage the coverage dimensions. *ATTENTION*: notice that the ``presentation`` parameters accepts only one among the following values {'LIST', 'DISCRETE_INTERVAL', 'CONTINUOUS_INTERVAL'}
fr: Par défaut, la couche de ImageMosaic n'a pas les dimensions de couverture configurées. Il est possible en utilisant les métadonnées de couverture pour mettre à jour et gérer les dimensions de la couverture. *ATTENTION*: Notez que les paramètres de ``présentation`` n'accepte qu'une des valeurs suivantes {'LIST', 'DISCRETE_INTERVAL', 'CONTINUOUS_INTERVAL'}

source: One the ImageMosaic has been configures, it is possible to read the coverages along with their granule schema and granule info.
fr: L' ImageMosaic a été configurée, il est possible de lire des couvertures ainsi que leur schéma de granule et les infos de la granule.

source: The granules details can be easily read by doing something like this:
fr: Les détails de granules peuvent être lues facilement en faisant quelque chose comme ceci :

source: When the mosaic grows up and starts having a huge set of granules, you may need to filter the granules query through a CQL filter on the coverage schema attributes.
fr: Lorsque la mosaïque grandit et commence à avoir un vaste ensemble de granules, vous devrez filtrer la requête de granules à travers un filtre CQL sur les attributs de schéma de couverture.

source: gsimporter is a python library for using GeoServer's importer API.
fr: gsimporter est une bibliothèque python utilisant l' importateur de GeoServer API.

source: Please use the Github project at http://github.com/boundlessgeo/gsimporter for any bug reports (and pull requests are welcome, but please include tests where possible.)
fr: S'il vous plaît utiliser le projet Github à http://github.com/boundlessgeo/gsimporter pour tout rapport de bug (et pull requêtes sont les bienvenus, mais s'il vous plaît incluenez des essais si possible).

source: The tests are integration tests. These require having a running GeoServer instance with the community/importer modules installed. Because some of the tests use a postgres database, a data base is required to run. **It is strongly advised to run with a data directory you don't care about.**
fr: Les tests sont des tests d'intégration. Ceux-ci exigent d'avoir une instance GeoServer avec les modules / l'importateur de la communauté. Étant donné que certains des essais utilisent une base de données postgres, une base de données est nécessaire à l'exécution. **Il est fortement conseillé de courir avec un répertoire de données dont vous ne vous souciez pas.**

source: The test suite will first attempt to verify a connection to GeoServer and a connection to the database. If the default values are not appropriate, provide them via environment variables on the command line or via `export`. For example::
fr: La suite de tests tentera d'abord de vérifier une connexion à GeoServer et une connexion à la base de données. Si les valeurs par défaut ne sont pas appropriées, les fournir via les variables d'environnement sur la ligne de commande ou via `export`. Par example::

source: A convenient way to deal with connection or other settings (besides setting things up to use the defaults) is to put them all in a bash (or other shell) script.
fr: Un moyen pratique de traiter avec les autres paramètres (sans compter que la configuration choses pour utiliser les valeurs par défaut) ou de connexion est de les mettre tous dans un bash (ou autre shell) script.

source: The tests are designed to create a workspace named `importer` and `importer2` for use in testing. `importer` will be set to the default workspace. As much as possible, things are cleaned up after test execution.
fr: Les tests sont conçus pour créer un workspace nommé `importer` et `importer2` pour une utilisation dans les essais. `importer` sera réglé sur l'workspace par défaut. Autant que possible, les choses sont nettoyés après l'exécution du test.

source: To run all of the tests, one way is via `setup.py`. `python setup.py test` should do the trick.
fr: Pour exécuter tous les tests, un seul moyen est `setup.py`. `python setup.py test` devrait faire l'affaire.

source: If developing and finer grained control is desired, specific tests and other flags can be provided using `python test/uploadtests.py`. Supported arguments are:
fr: Si développer et plus fine grain contrôle est désirées, spécifiques tests et autres drapeaux peuvent être fournis à l'aide de `python test/uploadtests.py`. Les arguments pris en charge sont :

source: **--clean** delete layers and stores in the test workspaces. useful for cleanup.
fr: **--clean** supprimer des couches et des magasins dans les espaces de travail de test. utile pour le nettoyage.

source: **--skip-teardown** don't delete things after running. may cause errors but useful for a single test.
fr: **--skip-teardown** ne pas supprimer des choses après l'exécution peut entraîner des erreurs mais est utile pour un seul test.
