Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: Exercises
fr: Exercices

source: Components and Services
fr: Composants et Services

source: Hint, if ``bash-completion`` is installed, try <TAB><TAB> to get completions.
fr: Astuce, si ``bash-completion`` est installé, essayez <TAB><TAB> pour obtenir les achèvements.

source: start/stop services
fr: Démarrer/arrêter les services

source: basic psql interactions
fr: interactions de base psql

source: Use the layer preview functionality in GeoServer to bring up a web map.
fr: Utilisez la fonctionnalité d'aperçu dans la couche GeoServer pour faire apparaître une carte web.

source: Copy a the URL for the image in the map.
fr: Copie une l'URL de l'image dans la carte.

source: Alter URL parameters for the request.
fr: Modifier les paramètres d'URL de la requête.

source: Use *curl* to get the capabilities document
fr: Utilisation *curl* pour obtenir le document de capacités

source: More: http://docs.geoserver.org/stable/en/user/services/wms/index.html
fr: Plus: http://docs.geoserver.org/stable/en/user/services/wms/index.html

source: Describe a feature type using curl (replace ws:name with your layer)
fr: Décrire un type de fonctionnalité en utilisant curl (remplacer ws:name avec votre calque)

source: More: http://docs.geoserver.org/stable/en/user/services/wfs/reference.html
fr: Plus: http://docs.geoserver.org/stable/en/user/services/wfs/reference.html

source: Introduction to GeoNode development
fr: Introduction au développement de GeoNode

source: This module will introduce you to the components that GeoNode is built with, the standards that it supports and the services it provides based on those standards, and an overview its architecture.
fr: Ce module vous fera découvrir les composants que GeoNode a construit avec les normes qu'il soutient, et les services qu'elle offre son architecture basée sur ces normes, ainsi qu'un aperçu.

source: GeoNode is a web based GIS tool, and as such, in order to do development on GeoNode itself or to integrate it into your own application, you should be familiar with basic web development concepts as well as with general GIS concepts.
fr: GeoNode est un web based outil SIG, et par conséquent, afin de faire du développement sur GeoNode elle-même ou l' intégrer dans votre propre application, vous devez être familiarisé avec les concepts du développement web de base, ainsi qu'avec les concepts généraux de GIS.

source: A set of reference links on these topics is included at the end of this module.
fr: Un ensemble de liens de référence sur ces sujets est inclus à la fin de ce module.

source: Development References
fr: Références de développement

source: Basic Web based GIS Concepts and Background
fr: Basée sur le Web base notions de SIG et de fond

source: OGC Services
fr: Services OGC

source: Web Application Architecture
fr: Architecture de l'application

source: AJAX and REST
fr: AJAX et REST

source: GeoServer Administration
fr: Administration de GeoServer

source: PostgreSQL and PostGIS Administration - http://workshops.opengeo.org/postgis-intro/ - http://workshops.opengeo.org/postgis-spatialdbtips/
fr: PostgreSQL et PostGIS Administration - http://workshops.opengeo.org/postgis-intro/ - http://workshops.opengeo.org/postgis-spatialdbtips/

source: Core development tools and libraries
fr: Bibliothèques et outils de développement de base

source: Standards
fr: Normes

source: GeoNode is based on a set of Open Geospatial Consortium (OGC) standards. These standards enable GeoNode installations to be interoperable with a wide variety of tools that support these OGC standards and enable federation with other OGC compliant services and infrastructure. Reference links about these standards are also included at the end of this module.
fr: GeoNode repose sur un ensemble de normes de l'Open Geospatial Consortium (OGC). Ces normes permettent à installations GeoNo de fonctionner avec une grande variété d'outils prenant en charge ces standards de l'OGC et activer la Fédération avec d'autres services conformes à l'OGC et l'infrastructure. Liens de référence sur ces normes sont également inclus à la fin de ce module.

source: GeoNode is also based on Web Standards ...
fr: GeoNode est également basé sur les Standards du Web...

source: Open Geospatial Consortium (OGC) Standards
fr: Normes de l'Open Geospatial Consortium (OGC)

source: The Web Map Service (WMS) specification defines an interface for requesting rendered map images across the web. It is used within GeoNode to display maps in the pages of the site and in the GeoExplorer application to display rendered layers based on default or custom styles.
fr: La spécification Web Map Service (WMS) définit une interface pour demander des images rendus cartographiques sur le web. Elle est utilisée dans GeoNode pour afficher des cartes dans les pages du site et dans l'application GeoExplorer affiche rendu couches issus des styles personnalisés ou par défaut.

source: The Web Feature Service (WFS) specification defines an interface for reading and writing geographic features across the web. It is used within GeoNode to enable downloading of vector layers in various formats and within GeoExplorer to enable editing of Vector Layers that are stored in a GeoNode.
fr: La spécification Web Feature Service (WFS) définit une interface pour lire et écrire des éléments géographiques à travers le web. Il est utilisé au sein de GeoNode pour permettre le téléchargement de couches vectorielles dans différents formats et GeoExplorer pour permettre la modification des couches vectorielles qui sont stockées dans un GeoNode.

source: The Web Coverage Service (WCS) specification defines an interface for reading and writing geospatial raster data as "coverages" across the web. It is used within GeoNode to enable downloading of raster layers in various formats.
fr: La spécification du Service de Web Coverage Service (WCS) définit une interface pour lire et écrire des données géospatiales raster comme "coverages" à travers le web. Elle est utilisée dans GeoNode pour permettre le téléchargement des calques pixellisés dans différents formats.

source: The Catalogue Service for Web (CSW) specification defines an interface for exposing a catalogue of geospatial metadata across the web. It is used within GeoNode to enable any application to search GeoNode's catalogue or to provide federated search that includes a set of GeoNode layers within another application.
fr: La spécification du Catalogue Service for Web (CSW) définit une interface permettant d'exposer un catalogue de métadonnées géospatiales sur le web. Elle est utilisée dans GeoNode pour permettre à n'importe quelle application de rechercher le catalogue de GeoNode ou de fournir la recherche fédérée qui inclut un ensemble de couches GeoNode dans une autre application.

source: The Tile Mapping Service (TMS) specification defines and interface for retrieving rendered map tiles over the web. It is used within geonode to enable serving of a cache of rendered layers to be included in GeoNode's web pages or within the GeoExplorer mapping application. Its purpose is to improve performance on the client vs asking the WMS for rendered images directly.
fr: La spécification définit Tile Mapping Service (TMS) et l'interface pour récupérer des rendu tuiles de carte sur le web. Elle est utilisée dans geonode pour permettre la desserte d'un cache de rendu couches d' être inclus dans les pages web de GeoNode ou dans l'application de cartographie GeoExplorer. Son but est d'améliorer les performances sur le vs client demandant le service WMS pour les images rendues directement.

source: Web Standards
fr: Standards du Web

source: **HyperText Markup Language**, commonly referred to as **HTML**, is the standard markup language used to create web pages. [1]_ Web browsers can read HTML files and render them into visible or audible web pages. HTML describes the structure of a website semantically along with cues for presentation, making it a markup language, rather than a programming language.
fr: **HyperText Markup Language**, communément appelé **HTML**, est le langage de balisage standard utilisé pour créer des pages web. [1]_ navigateurs web peuvent lire des fichiers HTML et les rendre dans des pages web visible ou audible. HTML décrit la structure d'un site sémantiquement avec repères pour la présentation, ce qui en fait un langage de balisage, plutôt qu'un langage de programmation.

source: HTML elements form the building blocks of all websites. HTML allows images and objects to be embedded and can be used to create interactive forms. It provides a means to create structured documents by denoting structural semantics for text such as headings, paragraphs, lists, links, quotes and other items.
fr: Les éléments HTML constituent les blocs de construction de tous les sites Web. HTML permet les images et les objets incorporés et peut être utilisé pour créer des formulaires interactifs. Il fournit un moyen de créer des documents structurés qui dénote la sémantique structurale de texte tels que titres, paragraphes, listes, liens, citations et autres éléments.

source: The language is written in the form of HTML elements consisting of *tags* enclosed in angle brackets (like < >). Browsers do not display the HTML tags and scripts, but use them to interpret the content of the page.
fr: La langue s'écrit sous la forme d'éléments HTML composés d'* étiquettes * placée entre crochets pointus (comme < >). Les navigateurs n'affichent pas les balises HTML et les scripts, mais utilisent pour interpréter le contenu de la page.

source: HTML can embed scripts written in languages such as JavaScript which affect the behavior of HTML web pages. Web browsers can also refer to Cascading Style Sheets (CSS) to define the look and layout of text and other material. The World Wide Web Consortium (W3C), maintainer of both the HTML and the CSS standards, has encouraged the use of CSS over explicit presentational HTML since 1997.
fr: HTML peut incorporer des scripts écrits dans des langages tels que JavaScript, qui affectent le comportement des pages web HTML. Navigateurs Web peuvent également faire référence à Cascading Style Sheets (CSS) pour définir l'apparence et la mise en page du texte et tout autre matériel. Le World Wide Web Consortium (W3C), mainteneur de l'HTML et les normes CSS, a encouragé l'utilisation de CSS sur HTML présentation explicite depuis 1997.

source: **Cascading Style Sheets** (**CSS**) is a style sheet language used for describing the presentation of a document written in a markup language. [2]_ Although most often used to set the visual style of web pages and user interfaces written in HTML and XHTML, the language can be applied to any XML document, including plain XML, SVG and XUL, and is applicable to rendering in speech, or on other media. Along with HTML and JavaScript, CSS is a cornerstone technology used by most websites to create visually engaging webpages, user interfaces for web applications, and user interfaces for many mobile applications. [3]_
fr: **Cascading Style Sheets** (**CSS**) est un langage de feuille de style utilisée pour décrire la présentation d'un document écrit dans un langage de balisage. [2]_ Bien que le plus souvent utilisé pour définir le style visuel des pages web et des interfaces utilisateur écrites en HTML et XHTML, la langue peut être appliqué à tout document XML, y compris XML brut, SVG et XUL, et est applicable à rendre dans le discours , ou sur d'autres supports. Avec HTML et JavaScript, CSS est une technologie clé utilisée par la plupart des sites Web pour créer des pages Web visuellement engageantes, des interfaces utilisateur pour les applications web et des interfaces utilisateur pour de nombreuses applications mobiles. [3]_

source: CSS is designed primarily to enable the separation of document content from document presentation, including aspects such as the layout, colors, and fonts. [4]_ This separation can improve content accessibility, provide more flexibility and control in the specification of presentation characteristics, enable multiple HTML pages to share formatting by specifying the relevant CSS in a separate .css file, and reduce complexity and repetition in the structural content, such as semantically insignificant tables that were widely used to format pages before consistent CSS rendering was available in all major browsers. CSS makes it possible to separate presentation instructions from the HTML content in a separate file or style section of the HTML file. For each matching HTML element, it provides a list of formatting instructions. For example, a CSS rule might specify that “all heading 1 elements should be bold”, leaving pure semantic HTML markup that asserts “this text is a level 1 heading” without formatting code such as a ``<bold>`` tag indicating how such text should be displayed.
fr: CSS est conçu principalement pour permettre la séparation du contenu du document de présentation des documents, y compris des aspects tels que la mise en page, les couleurs et les polices. [4]_ Cette séparation peut améliorer l'accessibilité du contenu, offrir plus de souplesse et de contrôle dans la spécification des caractéristiques de présentation, activer plusieurs pages HTML à partager le formatage en spécifiant le CSS pertinente dans un fichier .css séparée, et de réduire la complexité et la répétition dans la structure contenu, tels que des tables sémantiquement insignifiantes qui ont été largement utilisées pour les pages de format avant que CSS soit rendu compatible et disponible dans tous les principaux navigateurs. CSS permet de séparer les instructions de présentation du contenu HTML dans une section de fichier ou le style distinct du fichier HTML. Pour chaque élément HTML correspondant, fournit une liste des instructions de formatage. Par exemple, une règle CSS peut spécifier que "les 1 éléments de titre devraient être audacieux", laissant balisage sémantique HTML pur qui affirme “ce texte est un titre de niveau 1“, sans le formatage du code comme un ``<bold>`` étiquette indiquant comment un tel texte doit être affiché.

source: This separation of formatting and content makes it possible to present the same markup page in different styles for different rendering methods, such as on-screen, in print, by voice (when read out by a speech-based browser or screen reader) and on Braille-based, tactile devices. It can also be used to display the web page differently depending on the screen size or device on which it is being viewed. Although
fr: Cette séparation du contenu et de mise en forme permet de présenter la même page de balisage dans des styles différents pour les méthodes de rendu différents, tels qu'à l'écran, dans la presse, par la voix (lecture d'un discours basé sur navigateur ou lecteur d'écran) et sur les appareils tactiles, axée sur le Braille. Il peut également être utilisé pour afficher la page web différemment selon la taille de l'écran ou sur lequel il est en cours de visualisation. Bien que

source: In computing, **Representational State Transfer** (**REST**) is the software architectural style of the World Wide Web. [5]_ [6]_ [7]_ REST gives a coordinated set of constraints to the design of components in a distributed hypermedia system that can lead to a higher performing and more maintainable architecture.
fr: En informatique, **Representational State Transfer** (**REST**) est le style architectural du logiciel du World Wide Web. [5]_ [6]_ [7]_ REST qui donne un ensemble coordonné de contraintes à la conception des composants dans un système hypermédia distribués qui peut entraîner une exécution plus élevée et plus d'architecture maintenable.

source: To the extent that systems conform to the constraints of REST they can be called RESTful. RESTful systems typically, but not always, communicate over the Hypertext Transfer Protocol with the same HTTP verbs (GET, POST, PUT, DELETE, etc.) which web browsers use to retrieve web pages and to send data to remote servers. [8]_ REST interfaces usually involve collections of resources with identifiers, for example ``/people/tom``, which can be operated upon using standard verbs, such as ``DELETE /people/tom``.
fr: Dans la mesure où les systèmes sont conformes aux contraintes de REST, ils peuvent être appelés RESTful. Systèmes RESTful généralement, mais pas toujours, communiquer sur l'Hypertext Transfer Protocol avec les mêmes verbes HTTP (GET, POST, PUT, DELETE, etc.) que les navigateurs Web utilisent pour récupérer des pages Web et d'envoyer des données à des serveurs distants. [8] _ interfaces REST impliquent généralement des collections de ressources avec des identifiants, par exemple ``/people/tom``, qui peut être actionné à l'aide de verbes standard, telles que ``DELETE /people/tom``.

source: Fielding, Roy Thomas (2000). `"Chapter 5: Representational State Transfer (REST)" <http://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm>`_. *Architectural Styles and the Design of Network-based Software Architectures* (Ph.D.). University of California, Irvine. This chapter introduced the Representational State Transfer (REST) architectural style for distributed hypermedia systems. REST provides a set of architectural constraints that, when applied as a whole, emphasizes scalability of component interactions, generality of interfaces, independent deployment of components, and intermediary components to reduce interaction latency, enforce security, and encapsulate legacy systems."
fr: Fielding, Roy Thomas (2000). `"Chapter 5: Representational State Transfer (REST)" <http://www.ics.uci.edu/~fielding/pubs/dissertation/rest_arch_style.htm>`_. *Architectural Styles and the Design of Network-based Software Architectures* (Ph.D.). University of California, Irvine. Ce chapitre introduit Representational State Transfer ( REST ) de style architectural pour les systèmes hypermédia distribués . REST Fournit un ensemble de contraintes architecturales qui, appliqué dans son ensemble , souligne l'évolutivité des interactions de composants , de la généralité des interfaces , déploiement indépendant de composants et les composants intermédiaires pour réduire l'interaction de latence , respecter la sécurité , et d'encapsuler les systèmes existants " .

source: Getting Started With Django
fr: Mise en route de Django

source: Object-relational mapper
fr: Mappeur objet / relationnel

source: Data models can be defined entirely in Python. DJango makes available a rich, dynamic database-access API for free, but it is still possible to write SQL if needed.
fr: Modèles de données peuvent être définis entièrement en Python. DJango met à disposition une API riche et dynamique de base de données-accès gratuitement, mais il est toujours possible d'écrire du SQL si nécessaire.

source: The following documentation is based on official `documentation <https://docs.djangoproject.com/en>`_ of the project Django.
fr: La documentation suivante est basée sur l'officiel `documentation <https://docs.djangoproject.com/en>`_ du projet Django.

source: The following examples are taken from the official Django documentation for the sole purpose of introducing the general concepts.
fr: Les exemples suivants proviennent de la documentation officielle de Django dans le seul but d'introduire les concepts généraux.

source: Models
fr: Modèles

source: A model is a Python class containing the essential fields and behaviors of the data stored on the DB. Generally, each model maps to a single database table.
fr: Un modèle est une classe de Python qui contient les domaines essentiels et les comportements des données stockées sur le DB. Généralement, les cartes de chaque modèle à une table de base de données unique.

source: Each model is a Python class that subclasses ``django.db.models.Model``.
fr: Chaque modèle est une classe de Python que sous-classes ``django.db.models.Model``.

source: Each attribute of the model represents a database field.
fr: Chaque attribut du modèle représente un champ de base de données.

source: A model is an automatically-generated database-access API; see :ref:`making_queries`.
fr: Un modèle est une API de base de données-accès généré automatiquement ; Voir :ref:`making_queries`.

source: Quick example
fr: Petit exemple

source: This example model defines a ``Person``, which has a **first_name** and **last_name**:
fr: Ce modèle de l'exemple définit une ``Person``, qui a un **prenom** et **last_name** :

source: **first_name** and **last_name** are fields of the model. Each field is specified as a class attribute, and each attribute maps to a database column.
fr: **prénom** et **last_name** sont des champs du modèle. Chaque champ est spécifié comme un attribut de classe, et chaque attribut est mappé à une colonne de base de données.

source: The above ``Person`` model would create a database table like this:
fr: Le modèle ``Person`` créerait une table de base de données comme ceci :

source: Some technical notes:
fr: Notes techniques:

source: The name of the table, **myapp_person**, is automatically derived from some model metadata but can be overridden.
fr: Le nom de la table, **myapp_person**, est dérivé automatiquement des métadonnées de modèle mais peut être substituée.

source: An **id** field is added automatically, but this behavior can be overridden.
fr: Un **id** champ est ajouté automatiquement, mais ce comportement peut être substitué.

source: The **CREATE TABLE** SQL in this example is formatted using PostgreSQL syntax, but it’s worth noting Django uses SQL tailored to the database backend specified in the settings file.
fr: Le **CREATE TABLE** SQL dans cet exemple est formaté à l'aide de la syntaxe de PostgreSQL, mais cela vaut la peine notant Django utilise SQL adapté à la base de données principale spécifiée dans le fichier de paramètres.

source: Using models
fr: En utilisant des modèles

source: Once models have been defined, Django must be instructed on how to use those models. This is possible by editing the DJango settings file and changing the **INSTALLED_APPS** setting to add the name of the module that contains the **model class**.
fr: Une fois que les modèles ont été définis, Django il faut indiquer sur la façon d'utiliser ces modèles. Ceci est possible en modifiant le fichier de paramètres de DJango et en changeant le paramètre **INSTALLED_APPS** pour ajouter le nom du module qui contient le **modèle classe**.

source: For example, if the models for the application is defined in the module **myapp.models**, **INSTALLED_APPS** should read, in part:
fr: Par exemple, si les modèles d'application est définie dans le module **myapp.models**, **INSTALLED_APPS ** doit se lire, en partie :

source: When you add new apps to **INSTALLED_APPS**, be sure to run **manage.py migrate**, optionally making migrations for them first with **manage.py makemigrations**.
fr: Lorsque vous ajoutez de nouvelles applications à **INSTALLED_APPS**, assurez-vous d'exécuter **manage.py migrate**, éventuellement faire des migrations pour eux tout d'abord avec **manage.py makemigrations**.

source: GeoNode uses the specific command **manage.py syncdb** to perform the models update and migration.
fr: GeoNode utilise la commande spécifique **manage.py syncdb** pour effectuer la mise à jour de modèles et de la migration.

source: Fields
fr: Champs

source: The list of DB fields is reflected (and specified) by the model class attributes.
fr: La liste des champs DB est réfléchie (et spécifiée) par les attributs de classe modèle.

source: Be careful not to choose field names that conflict with the models API like **clean**, **save**, or **delete**.
fr: Veillez à ne pas choisir des noms de domaine que le conflit avec les modèles API comme **propre**, **enregistrer** ou **supprimer**.

source: Example:
fr: Exemple:
