Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: More: `Field Types <https://docs.djangoproject.com/en/1.8/topics/db/models/#field-types>`_
fr: Plus: `Field Types <https://docs.djangoproject.com/en/1.8/topics/db/models/#field-types>`_

source: Model methods
fr: Méthodes de modèle

source: Custom methods on a model can be used to add custom “row-level” functionality to an object. This is a valuable technique for keeping business logic in one place.
fr: Méthodes personnalisées sur un modèle peuvent servir à ajouter des fonctionnalités personnalisées « row-level » en objet. Il s'agit d'une technique précieuse pour garder la logique métier en un seul endroit.

source: For example, the following model has a few **custom methods**:
fr: Par exemple, le modèle suivant a quelques **méthodes personnalisées** :

source: The last method in this example is a `property <https://docs.djangoproject.com/en/1.8/glossary/#term-property>`_.
fr: La dernière méthode dans cet exemple est une `propriété <https://docs.djangoproject.com/en/1.8/glossary/#term-property>`_.

source: The `model instance reference <https://docs.djangoproject.com/en/1.8/ref/models/instances/>`_ has a complete list of `methods automatically given to each model <https://docs.djangoproject.com/en/1.8/ref/models/instances/#model-instance-methods>`_. It is possible to override most of these; see `overriding predefined model methods <https://docs.djangoproject.com/en/1.8/topics/db/models/#overriding-predefined-model-methods>`_
fr: Le `modèle de référence d'instance <https://docs.djangoproject.com/en/1.8/ref/models/instances/>`_ a une liste complète des `méthodes automatiquement données à chaque modèle <https://docs.djangoproject.com/en/1.8/ref/models/instances/#model-instance-methods>`_. Il est possible de substituer la plupart d'entre eux ; Voir `substituant prédéfinis méthodes modèle <https://docs.djangoproject.com/en/1.8/topics/db/models/#overriding-predefined-model-methods>`_

source: More: `Models Methods <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-methods>`_
fr: Plus: `Models Methods <https://docs.djangoproject.com/en/1.8/topics/db/models/#model-methods>`_

source: `Making queries`_
fr: `Faire des requêtes`_

source: Django automatically gives a database-abstraction API that allows to create, retrieve, update and delete objects.
fr: Django donne automatiquement une API d'abstraction de base de données qui permet de créer, récupérer, mettre à jour et supprimer des objets.

source: As an example:
fr: Par exemple:

source: Creating objects
fr: Création d'objets

source: As already said before, a model class represents a database table, and an instance of that class represents a particular record in the database table.
fr: Comme déjà dit précédemment, une classe de modèle représente une table de base de données, et une instance de cette classe représente un enregistrement dans la table de base de données.

source: To create an object, instantiate it using keyword arguments to the model class, then call **save()** to save it to the database.
fr: Pour créer un objet, instancier à l'aide des arguments de mot-clé à la classe de modèle, puis appelez **save()** pour l'enregistrer dans la base de données.

source: Assuming models live in a file **mysite/blog/models.py**, here’s an example:
fr: En supposant que les modèles en direct dans un fichier **mysite/blog/models.py**, voici un exemple :

source: This performs an **INSERT SQL** statement behind the scenes. Django doesn’t hit the database until you explicitly call **save()**. The **save()** method has no return value.
fr: Il effectue un instruction **INSERT SQL** dans les coulisses. Django ne touche pas la base de données jusqu'à ce que vous appeliez explicitement **save()**. Le méthode **save()** n'a aucune valeur de retour.

source: This performs an **UPDATE SQL** statement behind the scenes. Django doesn’t hit the database until you explicitly call **save()**.
fr: Il effectue un mise à jour **UPDATE SQL** déclaration dans les coulisses. Django ne touche pas la base de données jusqu'à ce que vous appeliez explicitement **save()**.

source: Retrieving objects
fr: Récupération des objets

source: Retrieving objects from the database can be done by constructing a **QuerySet** via a **Manager** on the model class.
fr: Récupérer des objets de la base de données peut se faire en construisant une **QuerySet** via un **Manager** sur la classe de modèle.

source: A **QuerySet** represents a collection of objects from the database. It can have zero, one or many filters. Filters narrow down the query results based on the given parameters. In SQL terms, a **QuerySet** equates to a **SELECT** statement, and a filter is a limiting clause such as **WHERE** or **LIMIT**.
fr: A **QuerySet** représente une collection d'objets de la base de données. Il peut avoir zéro, un ou plusieurs filtres. Filtres à affiner les résultats de la requête fondées sur les paramètres donnés. En termes SQL, un **QuerySet** équivaut à un ** instruction **SELECT** et un filtre est une clause limitante comme **WHERE** ou **LIMIT**.

source: Each model has at least one **Manager**, and it’s called ``objects`` by default.
fr: Chaque modèle possède au moins un **Manager** et qu'il est appelé ``objects`` par défaut.

source: It can be accessed directly via the model class, like so:
fr: Il est accessible directement via la classe de modèle, comme suit :

source: **Managers** are accessible only via model classes, rather than from model instances, to *enforce a separation* between “table-level” operations and “record-level” operations. The **Manager** is the main source of **QuerySets** for a model. For example, ``Blog.objects.all()`` returns a **QuerySet** that contains all Blog objects in the database.
fr: **Cadres** sont accessibles uniquement via les classes du modèle, plutôt que les instances de modèle, à * appliquer une séparation * entre les opérations de "niveau de la table" et "au niveau des enregistrements". Le ** gestionnaire ** est la principale source de ** QuerySets ** pour un modèle. Par exemple, '' Blog.objects.all()'' retourne un ** QuerySet ** qui contient tous les objets de Blog dans la base de données.

source: The simplest way to retrieve objects from a table is to get all of them. To do this, use the **all()** method on a **Manager**:
fr: La façon la plus simple pour récupérer des objets d'une table est d'obtenir l'ensemble d'entre eux. Pour ce faire, utilisez le **all()** méthode sur un **Manager**:

source: The **all()** method returns a **QuerySet** of all the objects in the database. The **QuerySet** returned by **all()** describes all objects in the database table. To select only a subset of the complete set of objects, it must be refined by adding filter conditions.
fr: Le **all()** méthode retourne un **QuerySet** de tous les objets dans la base de données. Le **QuerySet** retourné par **all()** décrit tous les objets de la table de base de données. Pour sélectionner uniquement un sous-ensemble d'un ensemble complet d'objets, il doit être amélioré par l'ajout de conditions de filtre.

source: The two most common ways to refine a **QuerySet** are:
fr: Les deux façons principales d'affiner un **QuerySet** sont :

source: Returns a new **QuerySet** containing objects that match the given lookup parameters.
fr: Retourne un nouveau **QuerySet** contenant des objets qui correspondent aux paramètres de recherche donnée.

source: Returns a new **QuerySet** containing objects that do not match the given lookup parameters. The lookup parameters (****kwargs** in the above function definitions) should be in the format described in **Field** lookups below.
fr: Retourne un nouveau **QuerySet** contenant des objets qui ne correspondent pas les paramètres de recherche donnée. Les paramètres de recherche (****kwargs** dans les définitions de fonction ci-dessus) doit être au format décrit dans **Field** recherches ci-dessous.

source: For example, to get a **QuerySet** of blog entries from the year 2006, use **filter()** like so:
fr: Par exemple, pour obtenir un **QuerySet** des entrées de blog par rapport à l'année 2006, utiliser **filter()** comme suit :

source: With the default manager class, it is the same as:
fr: Avec la classe de gestionnaire par défaut, c'est le même que :

source: The result of refining a **QuerySet** is itself a **QuerySet**, so it’s possible to chain refinements together.
fr: Le résultat de raffinage un **QuerySet** est en soi un **QuerySet**, il est donc possible de raffinements chaîne ensemble.

source: For example:
fr: Par exemple:

source: This takes the initial **QuerySet** of all entries in the database, adds a filter, then an exclusion, then another filter. The final result is a **QuerySet** containing all entries with a headline that starts with “What”, that were published between January 30, 2005, and the current day.
fr: Cela prend l'initiale **QuerySet** de toutes les entrées de la base de données, ajoute un filtre, puis une exclusion, puis un autre filtre. Le résultat final est un **QuerySet** contenant toutes les entrées avec un titre qui commence par « Quoi », qui ont été publiés entre le 30 janvier 2005 et la date du jour.

source: More: `Making queries <https://docs.djangoproject.com/en/1.8/topics/db/queries/#making-queries>`_
fr: Plus: `Faire des requêtes <https://docs.djangoproject.com/en/1.8/topics/db/queries/#making-queries>`_

source: URLs and views
fr: URL et vues

source: A clean elegant URL scheme is an important detail in a high-quality Web application. Django encourages beautiful URL design and does not put junk in URLs, like .php or .asp.
fr: Un schéma d'URL propre élégant est un détail important dans une application Web de haute qualité. Django encourage la belle conception de l'URL et ne met pas indésirable dans les URL, comme .php ou .asp.

source: In DJango a Python module called URLconf is like a table of contents for the application. It contains a simple mapping between URL patterns and the **views**.
fr: Dans DJango, un module Python appelé URLconf est comme une table des matières d'application. Il contient un simple mappage entre modèles d'URL et le **vues**.

source: More: `URL dispatcher <https://docs.djangoproject.com/en/1.8/topics/http/urls/>`_
fr: Plus: `URL dispatcher <https://docs.djangoproject.com/en/1.8/topics/http/urls/>`_

source: Templates
fr: Mises à jour

source: Django’s template language allows developers to put logic into the HTML:
fr: Langage de template de Django permet aux développeurs de mettre la logique dans le code HTML :

source: More: `Templates <https://docs.djangoproject.com/en/1.8/topics/templates/>`_
fr: Plus: `Templates <https://docs.djangoproject.com/en/1.8/topics/templates/>`_

source: Forms
fr: Formulaires

source: Django provides a library that handles rendering HTML forms, validation of data submitted by users, and converting the data to native Python types. Django also provides a way to generate forms from your existing models and to use these forms to create and update data.
fr: Django fournit une bibliothèque qui gère le rendu des formulaires HTML, validation des données fournies par les utilisateurs et en convertissant les données pour les types natifs de Python. Django fournit également un moyen de générer des formes de vos modèles existants et d'utiliser ces formes pour créer et mettre à jour les données.

source: GET and POST
fr: GET et POST

source: **GET** and **POST** are the only HTTP methods to use when dealing with forms.
fr: **GET** et **POST** sont les seules méthodes HTTP à utiliser lorsqu'il s'agit de formes.

source: Django’s login form is returned using the **POST** method, in which the browser bundles up the form data, encodes it for transmission, sends it to the server, and then receives back its response.
fr: Formulaire de connexion de Django est retourné à l'aide de la **POST** méthode, dans laquelle les faisceaux de navigateur, les données de formulaire, il code pour la transmission, il envoie au serveur et puis reçoit sa réponse.

source: **GET**, by contrast, bundles the submitted data into a string, and uses this to compose a URL. The URL contains the address where the data must be sent, as well as the data keys and values. You can see this in action if you do a search in the Django documentation, which will produce a URL of the form ``https://docs.djangoproject.com/search/?q=forms&release=1``.
fr: **GET**, en revanche, regroupe les données soumises dans une chaîne et l'utilise pour composer une URL. L'URL contient l'adresse où doivent être envoyées les données, ainsi que les données clés et les valeurs. Vous pouvez voir cela en action si vous effectuez une recherche dans la documentation de Django, qui produira une URL de la forme ``https://docs.djangoproject.com/search/?q=forms&release=1``.

source: **GET** and **POST** are typically used for different purposes.
fr: **GET** et **POST** sont généralement utilisés à des fins différentes.

source: Any request that could be used to change the state of the system - for example, a request that makes changes in the database - should use **POST**. **GET** should be used only for requests that do not affect the state of the system.
fr: Toute demande qui pourrait être utilisé pour modifier l'état du système - par exemple, une demande qui apporte des modifications dans la base de données - doit utiliser **POST**. **GET** doit être utilisé uniquement pour les demandes qui n'affectent pas l'état du système.

source: **GET** would also be unsuitable for a password form, because the password would appear in the URL, and thus, also in browser history and server logs, all in plain text. Neither would it be suitable for large quantities of data, or for binary data, such as an image. A Web application that uses **GET** requests for admin forms is a security risk: it can be easy for an attacker to mimic a form’s request to gain access to sensitive parts of the system. **POST**, coupled with other protections like Django’s CSRF protection offers more control over access.
fr: **GET** serait également impropre à une forme de mot de passe, parce que le mot de passe apparaît dans l'URL, et donc, aussi dans l'histoire de navigateur et le serveur, tous les journaux en texte brut. Il ne serait pas approprié pour de grandes quantités de données, ou pour des données binaires, comme une image. Une application Web qui utilise **GET** demandes pour des formes d'administration est un risque de sécurité: il peut être facile pour un attaquant pour imiter la demande d'un formulaire pour accéder à des parties sensibles du système. **POST**, couplé avec d'autres protections comme la protection CSRF de Django offre plus de contrôle sur l'accès.

source: On the other hand, **GET** is suitable for things like a web search form, because the URLs that represent a **GET** request can easily be bookmarked, shared, or resubmitted.
fr: En revanche, **GET** convient pour des choses comme la recherche d'un web form, car les URL qui représentent un demande **GET** facilement peut être mis en signet, partagé ou soumis de nouveau.

source: More: `Working With Forms <https://docs.djangoproject.com/en/1.8/topics/forms/#working-with-forms>`_
fr: Plus: `Working With Forms <https://docs.djangoproject.com/en/1.8/topics/forms/#working-with-forms>`_

source: Authentication
fr: Authentification

source: Django supports a full-featured and secure authentication system. It handles user accounts, groups, permissions and cookie-based user sessions.
fr: Django utilise un système d'authentification complet et sûr. Il gère les comptes d'utilisateurs, les groupes, les autorisations et les sessions utilisateur basée sur les cookies.

source: More: `User authentication in Django <https://docs.djangoproject.com/en/stable/topics/auth/>`_
fr: Plus: `User authentication in Django <https://docs.djangoproject.com/en/stable/topics/auth/>`_

source: Admin
fr: Administrateur

source: One of the most powerful parts of Django is its automatic admin interface. It reads metadata from models in order to provide a powerful and ready-to-use GUI for **CRUD** operations against the model.
fr: Une des parties plus puissants de Django est son interface d'administration automatique. Il lit les métadonnées des modèles afin de fournir une interface utilisateur graphique puissante et prêt à l'emploi pour opérations **CRUD** selon le modèle.

source: The advanced workshop for Developers will provide more details on GeoNode specific models and admin interface
fr: L'atelier avancé pour les développeurs fournira plus de détails sur GeoNode des modèles spécifiques et interface d'administration

source: More: `The Django admin site <https://docs.djangoproject.com/en/stable/ref/contrib/admin/>`_
fr: Plus: `The Django admin site <https://docs.djangoproject.com/en/stable/ref/contrib/admin/>`_

source: Internationalization
fr: Internationalisation

source: Django offers full support for translating text into different languages, plus locale-specific formatting of dates, times, numbers and time zones. It lets developers and template authors specify which parts of their apps should be translated or formatted for local languages and cultures, and it uses these hooks to localize Web applications for particular users according to their preferences.
fr: Django offre un support complet pour la traduction du texte dans des langues différentes, plus spécifiques aux paramètres régionaux de mise en forme des dates, des heures, des nombres et des fuseaux horaires. Il permet aux développeurs et créateurs de modèles spécifient quelles sont les parties de leurs applications doivent être traduits ou formatés pour les cultures et les langues locales, et il utilise ces crochets pour localiser des applications Web pour des utilisateurs particuliers selon leurs préférences.

source: The advanced workshop for Developers will provide more details on how to create languages and translations on GeoNode using `Transifex <https://www.transifex.com/>`_
fr: L'atelier avancé pour les développeurs fournira plus de détails sur la façon de créer des langues et traductions sur l'utilisation de GeoNode `Transifex <https://www.transifex.com/>`_

source: More: `Internationalization and localization <https://docs.djangoproject.com/en/stable/topics/i18n/>`_
fr: Plus: `Internationalization and localization <https://docs.djangoproject.com/en/stable/topics/i18n/>`_

source: Security
fr: Sécurité

source: Django provides multiple protections against:
fr: Django dispose de multiples protections contre :

source: Clickjacking
fr: Détournement de clic

source: Clickjacking is a type of attack where a malicious site wraps another site in a frame. This attack can result in an unsuspecting user being tricked into performing unintended actions on the target site.
fr: Clickjacking est un type d'attaque où un site malveillant encapsule un autre site dans un cadre. Cette attaque peut entraîner par un utilisateur non averti dupé en effectuant des actions inattendues sur le site cible.

source: The **X-Frame-Options middleware** contained in a form allow a supporting browser to prevent a site from being rendered inside a frame
fr: Le **X-Frame-Options middleware** contenu dans un formulaire permettent un prise en charge navigateur empêcher un site d'être restitués à l'intérieur d'un cadre

source: XSS attacks allow a user to inject client side scripts into the browsers of other users. This is usually achieved by storing the malicious scripts in the database where it will be retrieved and displayed to other users, or by getting users to click a link which will cause the attacker’s JavaScript to be executed by the user’s browser. However, XSS attacks can originate from any untrusted source of data, such as cookies or Web services, whenever the data is not sufficiently sanitized before including in a page.
fr: Les attaques XSS permettent à un utilisateur d'injecter des scripts côté client dans les navigateurs des autres utilisateurs. Ceci est habituellement réalisé en stockant les scripts malveillants dans la base de données où il sera récupéré et affiché aux autres utilisateurs, ou en obtenant les utilisateurs à cliquer sur un lien qui va provoquer JavaScript de l'attaquant à être exécuté par le navigateur de l'utilisateur. Cependant, les attaques XSS peuvent provenir de toute source non fiable des données, telles que les cookies ou les services Web, chaque fois que les données ne sont pas suffisamment filtrées avant d'y compris dans une page.

source: CSRF attacks allow a malicious user to execute actions using the credentials of another user without that user’s knowledge or consent.
fr: Les attaques CSRF permettent à un utilisateur malveillant d'exécuter des actions en utilisant les informations d'identification d'un autre utilisateur sans la connaissance ou le consentement de l'utilisateur.

source: CSRF protection works by checking for a nonce in each POST request. This ensures that a malicious user cannot simply “replay” a form POST to your Web site and have another logged in user unwittingly submit that form. The malicious user would have to know the nonce, which is user specific (using a cookie).
fr: CSRF protection fonctionne en recherchant un nonce dans chaque requête POST. Cela fait en sorte qu'un utilisateur malveillant ne peut pas simplement « rejouer » un POST de formulaire à votre site Web et avoir un autre utilisateur connecté sans le vouloir soumettre ce formulaire. L'utilisateur malveillant devra connaître le nonce, qui est l'utilisateur spécifique (à l'aide d'un cookie).

source: SQL injection
fr: Injection SQL

source: SQL injection is a type of attack where a malicious user is able to execute arbitrary SQL code on a database. This can result in records being deleted or data leakage.
fr: Injection SQL est un type d'attaque où un utilisateur malveillant est capable d'exécuter du code arbitraire SQL sur une base de données. Cela peut entraîner dans les dossiers en cours de suppression ou de fuites de données.

source: Host header validation
fr: Validation d'en-tête hôte

source: Django uses the **Host** header provided by the client to construct URLs in certain cases. While these values are sanitized to prevent Cross Site Scripting attacks, a fake **Host** value can be used for Cross-Site Request Forgery, cache poisoning attacks, and poisoning links in emails.
fr: Django utilise le **Accueil** en-tête fournie par le client pour construire des URL dans certains cas. Bien que ces valeurs sont désinfectées pour prévenir des attaques Cross Site Scripting, un faux **Accueil** valeur peut être utilisée pour Cross-Site Request Forgery, cache attaques d'empoisonnement et l'empoisonnement des liens dans les e-mails.

source: Because even seemingly-secure web server configurations are susceptible to fake **Host** headers, Django validates **Host** headers against the **ALLOWED_HOSTS** setting in the ``django.http.HttpRequest.get_host()`` method.
fr: Parce que les configurations de serveur web sécurisé même apparemment sont susceptibles d'être faux **Accueil** en-têtes, Django valide **hôte** en-têtes contre le **ALLOWED_HOSTS** paramètre dans la méthode de``django.http.HttpRequest.get_host()``.

source: This validation only applies via **get_host()**; if your code accesses the Host header directly from **request.META** you are bypassing this security protection.
fr: Cette validation s'applique uniquement **get_host()**; Si votre code accède directement à partir de l'en-tête d'hôte **request.META** vous êtes contourner cette protection de sécurité.
