Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: It is always better for security, though not always practical in all cases, to deploy your site behind HTTPS. Without this, it is possible for malicious network users to sniff authentication credentials or any other information transferred between client and server, and in some cases – active network attackers – to alter data that is sent in either direction.
fr: Il est toujours préférable pour la sécurité, mais pas toujours pratique dans tous les cas, pour déployer votre site derrière HTTPS. Sans cela, il est possible pour les utilisateurs de réseau malveillant de renifler les informations d'authentification ou d'autres informations transférées entre le client et le serveur et dans certains cas – les attaquants réseau actif – de modifier les données qui sont envoyées dans les deux sens.

source: Django provides some settings to secure your site unser SSL/HTTPS.
fr: Django fournit certains paramètres pour sécuriser votre site unser SSL/HTTPS.

source: While Django provides good security protection out of the box, it is still important to properly deploy your application and take advantage of the security protection of the Web server, operating system and other components.
fr: Alors que Django offre une bonne sécurité protection out of the box, il est toujours important déployer votre application correctement et de tirer parti de la protection de la sécurité du serveur Web, système d'exploitation et d'autres composants.

source: Make sure that your Python code is outside of the Web server’s root. This will ensure that your Python code is not accidentally served as plain text (or accidentally executed).
fr: Assurez-vous que votre code Python est à l'extérieur de la racine du serveur Web. Cela fera en sorte que votre Python code n'est pas accidentellement servi sous forme de texte brut (ou accidentellement exécuté).

source: Take care with any user uploaded files.
fr: Faites attention avec tous les fichiers utilisateur téléchargée.

source: Django does not throttle requests to authenticate users. To protect against brute-force attacks against the authentication system, you may consider deploying a Django plugin or Web server module to throttle these requests.
fr: Django ne pas throttle demandes pour authentifier les utilisateurs. Pour se protéger contre les attaques en force contre le système d'authentification, vous pouvez envisager de déployer un plugin de Django ou le module de serveur Web d'étrangler ces demandes.

source: Keep your **SECRET_KEY** a secret.
fr: Gardez votre **SECRET_KEY** un secret.

source: It is a good idea to limit the accessibility of your caching system and database using a firewall.
fr: C'est une bonne idée pour limiter l'accessibilité de votre cache système et base de données à l'aide d'un pare-feu.

source: More: `Security in Django <https://docs.djangoproject.com/en/stable/topics/security/>`_
fr: Plus: `Security in Django <https://docs.djangoproject.com/en/stable/topics/security/>`_

source: Django Overview
fr: Prèsentation de Django

source: This section introduces some basic concepts of DJango, the Python based web framework on top of which GeoNode has been developed.
fr: Cette section présente quelques concepts de base de DJango, Python base framework web au sommet de laquelle GeoNode a été développé.

source: The main objective of Django is to facilitate the creation of complex sites oriented databases. Django emphasizes reusability and "pluggability" of components, rapid development, and the principle of not repeating yourself. Python is used everywhere, even for settings, files, and data models.
fr: L'objectif principal de Django est de faciliter la création de bases de données orientées de sites complexes. Django souligne la réutilisabilité et le « offre » de composants, un développement rapide et le principe de ne pas répéter vous-même. Python est utilisé dans le monde, même pour les modèles de données, fichiers et paramètres.

source: Django also provides an administrative interface to create, read, update and delete models that is dynamically generated by introspection and configured through the Administrative Templates.
fr: Django fournit également une interface d'administration pour créer, lire, mettre à jour et supprimer les modèles dynamiquement généré par introspection et configurés par les modèles d'administration.

source: GeoNode's Core Modules
fr: Modules de base de GeoNode

source: GeoNode is made up of a set of core Django pluggable modules (known as apps in Django) that provide the functionality of the application. Together they make up the key components of a GeoNode site. While your own use case and implementation may not require that you work directly on these modles, it is important that you become familiar with their layout, structure and the functionality that they provide. You may need to import these apps into your own apps, and as such, becoming familiar with them is an important step in becoming a proficient GeoNode developer.
fr: GeoNode est constitué d'un ensemble de modules enfichables base Django (connus sous le nom des applications dans Django) qui fournissent les fonctionnalités de l'application. Ensemble, ils forment les éléments clés d'un site GeoNode. Alors que votre propre cas et la mise en œuvre utilisation ne peuvent pas exiger que vous travaillez directement sur ces modles, il est important de vous familiariser avec leur mise en page, la structure et la fonctionnalité qu'ils fournissent. Vous avez besoin d'importer ces applications dans vos propres applications, et en tant que telle, de vous familiariser avec elles qui est une étape importante pour devenir un développeur de GeoNode compétent.

source: geonode.layers is the most key GeoNode module. It is used to represent layers of data stored in a GeoNode's paired GeoServer. The layer model class inherits fields from the ResourceBase class which provides all of the fields necessary for the metadata catalogue, and adds fields that map the object to its corresponding layer in GeoServer. When your users upload a layer via the user interface, the layer is imported to GeoServer and a record is added to GeoNode's database to represent that GeoServer layer within GeoNode itself.
fr: geonode.layers est le plus grand module clé de GeoNode . Il est utilisé pour représenter les couches de données stockées dans la GeoServer jumelé d'un GeoNode. La classe de modèle de couche hérite champs de la classe ResourceBase qui fournit tous les champs nécessaires pour le catalogue de métadonnées, et ajoute des champs qui correspondent à l'objet et à sa couche correspondante dans GeoServer. Lorsque vos utilisateurs téléchargent une couche par l'intermédiaire de l'interface utilisateur, la couche est importée dans GeoServer et un enregistrement est ajouté à la base de données GeoNode pour représenter cette couche GeoServer au sein de GeoNode lui-même.

source: The Layer model class provides a set of helper methods that are used to perform operations on a Layer object, and also to return things such as the list of Download or Metadata links for that layer. Additional classes are used to model the layers Attributes, Styles, Contacts and Links. The Django signals framework is used to invoke specific functions to synchronize with GeoServer before and after the layer is saved.
fr: La classe de modèle de Couche fournit un ensemble de méthodes d'assistance qui sont utilisées pour effectuer des opérations sur un objet de couche et également de retourner les choses telles que la liste de liens de téléchargement ou les métadonnées pour ce calque. Classes supplémentaires sont utilisées pour modéliser les couches des attributs, des Styles, des Contacts et des liens. Le Django cadre de signaux est utilisé pour appeler des fonctions spécifiques à synchroniser avec GeoServer, avant et après la couche d'enregistrement.

source: The views in the layers app are used to perform functions such as uploading, replacing, removing or changing the points of contact for a layer, and views are also used to update layer styles, download layers in bulk or change a layers permissions.
fr: Les points de vue dans l'application de couches sont utilisés pour exécuter des fonctions telles que le téléchargement, le remplacement, d'enlever ou de changer les points de contact pour une couche, et les vues sont également utilisées pour mettre à jour les styles de calque, de télécharger des couches en vrac ou de modifier une autorisations de couches.

source: The forms module in the layer app is used to drive the user interface forms necessary for performing the business logic that the views provide.
fr: Le module de formulaires dans l'application de la couche est utilisé pour exciter les formes d'interface utilisateur nécessaires pour exécuter la logique métier qui fournissent les points de vue.

source: The Layers app also includes a set of templates that are paired with views and used to drive the user interface. A small set of layer template tags is also used to help drive the layer explore and search pages.
fr: L'application de couches comprend également un ensemble de modèles qui est jumelé avec des vues et utilisé pour piloter l'interface utilisateur. Un petit ensemble de balises de modèle de couche est également utilisé pour aider à générer la couche Explorer et Rechercher des pages.

source: Some helper modules such as geonode.layers.metadata and geonode.layers.ows are used by the layer views to perform specific functions and help keep the main views module more concise and legible.
fr: Certains modules d'assistance tels que geonode.layers.metadata et geonode.layers.ows sont utilisés par les vues de la couche pour exécuter des fonctions spécifiques et aident à garder le module des vues principales plus concise et lisible.

source: Additionally, the GeoNode specific management commands are a part of the geonode.layers app.
fr: En outre, les commandes de gestion spécifique de GeoNode font partie de l'application geonode.layers.

source: You should spend some time to review the layers app through GitHubs code browsing interface.
fr: Vous devriez passer quelque temps à examiner l'application de couches GitHubs code interface de navigation.

source: The geonode.maps app is used to group together GeoNodes multi layer map functionality. The Map and MapLayer objects are used to model and implement maps created with the GeoExplorer application. The Map object also extends from the ResourceBase class which provides the ability to manage a full set of metadata fields for a Map.
fr: L'application geonode.maps est utilisée pour regrouper les fonctionnalités de carte GeoNodes multi couche. Les objets de la carte et MapLayer sont utilisés pour modéliser et mettre en œuvre des cartes créées avec l'application GeoExplorer. L'objet de la carte s'étend également de la classe de ressources qui offre la possibilité de gérer un ensemble complet de champs de métadonnées pour une carte.

source: The views in the maps app perform many of the same functions as the views in the layers app such as adding, changing, replacing or removing a map and also provide the endpoints for returning the map configuration from the database that is used to initialize the GeoExplorer app.
fr: Les points de vue dans l'application maps exécutent plusieurs des mêmes fonctions que les points de vue dans l'application de couches comme ajout, modification, remplacement ou l'enlèvement d'une carte et fournissent également les points de terminaison pour la configuration de la carte de retour de la base de données qui est utilisée pour initialiser l'application GeoExplorer.

source: The maps app also includes a set of forms, customization of the Django admin, some utility functions and a set of templates and template tags.
fr: L'application maps inclut également un ensemble de formulaires, personnalisation de l'admin de Django, certaines fonctions de l'utilitaire , un ensemble de modèles et les balises de modèle.

source: You can familiarize yourself with the maps app on GitHub.
fr: Vous pouvez vous familiariser avec l'application maps sur GitHub.

source: The geonode.security app is used to provide object level permissions within the GeoNode Django application. It is a custom Django authentication backend and is used to assign Generic, User and Group Permissions to Layers, Maps and other objects in the GeoNode system. Generic permissions are used to enable public anonymous or authenticated viewing and/or editing of your data layers and maps, and User and Group specific permissions are used to allow specific users or groups to access and edit your layers.
fr: L'application de geonode.security est utilisée pour fournir des autorisations au niveau de l'objet dans l'application GeoNode Django. Elle est une coutume Django authentification backend et est utilisée pour attribuer des génériques, Autorisations d'accès vers les calques, cartes et autres objets dans le système GeoNode.Les autorisations génériques sont utilisées pour permettre la visualisation anonyme ou authentific de public et / ou l'édition de vos couches de données et cartes. L'utilisateur et les autorisations spécifiques de groupe sont utilisés pour permettre à des utilisateurs ou groupes spécifiques d'accéder et de modifier vos couches.

source: The geonode.search module provides the search API that is used to drive the GeoNode search pages. It is configured to index layers, maps, documents and profiles, but is extensible to allow you to use it to index your own model classes. This module is currently based on the Django ORM and as such has a limited set of search features, but the GeoNode development team is actively working on making it possible to use this module with more feature-rich search engines.
fr: Le module geonode.search fournit la recherche API qui est utilisée pour diriger les pages de recherche GeoNode. Il est configuré pour les couches d'index, des cartes, des documents et des profils, mais il est extensible pour vous permettre de l'utiliser pour vos propres classes de modèle de l'index. Ce module est actuellement basé sur l'ORM de Django et à ce titre a un ensemble limité de fonctionnalités de recherche, mais l'équipe de développement de GeoNode travaille activement sur ce qui permet d'utiliser ce module avec plusieurs moteurs de recherche riche en fonctionnalités.

source: The geonode.catalogue app provides a key set of metadata catalogue functions within GeoNode itself. GeoNode is configured to use an integrated version of the pycsw library to perform these functions, but can also be configured to use any OGC compliant CS-W implementation such as GeoNetwork or Deegree. The metadata app allows users to import and/or edit metadata for their layers, maps and documents, and it provides an OGC compliant search interface for use in federating with other systems.
fr: L'app geonode.catalogue fournit un ensemble de clés de métadonnées des fonctions de catalogue au sein de la GeoNode elle-même. GeoNode est configurée pour utiliser une version intégrée de la bibliothèque pycsw pour remplir ces fonctions, mais peut également être configurée pour utiliser n'importe quelle implémentation de CS-W compatible OGC comme GeoNetwork ou Deegree. L'application de métadonnées permet aux utilisateurs d'importer et/ou de modifier des métadonnées pour leurs couches, cartes et documents et elle fournit une interface de recherche conformes de OGC devant servir à se fédérer avec d'autres systèmes.

source: The geonode.geoserver module is used to interact with GeoServer from within GeoNode's python code. It relies heavily on the gsconfig library which addresses GeoServer's REST configuration API. Additionally, the geonode.geoserver.uploader module is used to interact with GeoServers Importer API for uploading and configuring layers.
fr: Le module geonode.geoserver est utilisé pour interagir avec GeoServer de code python de GeoNode. Il dépend beaucoup de la bibliothèque de gsconfig qui traite des API de configuration pour le reste de GeoServer. En outre, le module geonode.geoserver.uploader est utilisé pour interagir avec GeoServers importateur API pour le téléchargement et la configuration des couches.

source: The geonode.people module is used to model and store information about both GeoNode users and people outside of the system who are listed as Points of Contact for particular layers. It is the foundational module for GeoNode's social features. It provides a set of forms for users to edit and manage their own profiles as well as to view and interact with the profiles of other users.
fr: Le module geonode.people est utilisé pour modéliser et stocker des informations sur les utilisateurs GeoNode et les gens en dehors du système qui est répertoriés comme Points de Contact pour les couches particulières. C'est le module fondamental pour des fonctionnalités sociales de GeoNode. Il fournit un ensemble de formulaires pour les utilisateurs pour éditer et gérer leurs propres profils ainsi qu'afficher et interagir avec les profils des autres utilisateurs.

source: GeoNode's core GIS client functions are performed by GeoExplorer. The GeoExplorer app is in turn based on GeoExt, OpenLayers and ExtJS. It provides functionality for constructing maps, styling layers and connecting to remote services. GeoExplorer is the reference implementation of the OpenGeo Suite SDK which is based on GXP. GeoNode treats GeoExplorer as an external module that is used out of the box in GeoNode, but it is possible for you to create your own Suite SDK app and integrate it with GeoNode.
fr: Les fonctions du client de SIG de base de GeoNode sont effectuées par GeoExplorer. L'application GeoExplorer est à son tour fondée sur geoext, OpenLayers et ExtJS. elle fournit des fonctionnalités pour construire des cartes, couches coiffer et se connecter à des services distants. GeoExplorer est l'implémentation de référence de la Suite SDK OpenGeo qui est basé sur GXP. GeoNode traite GeoExplorer comme un module externe qui est utilisé hors de la boîte dans GeoNode, mais il est possible pour vous de créer votre propre application SDK de Suite et de l'intégrer avec GeoNode.

source: Static Site
fr: Site statique

source: The front end of GeoNode is composed of a set of core templates, specific templates for each module, cascading style sheets to style those pages and a set of javascript modules that provide the interactive functionality in the site.
fr: L'extrémité avant de GeoNode est composée d'un ensemble de modèles de base, des modèles spécifiques pour chaque module, les feuilles de style en cascade pour le style de ces pages et un ensemble de modules javascript qui fournissent les fonctionnalités interactives du site.

source: GeoNode includes a basic set of core templates that use Django's template inheritance system to provide a modular system for constructing the web pages in GeoNode's interface. These core templates drive the overall page layout and things like the home page. You will start the process of customizing your GeoNode instance by overriding these templates, so you should familiarize yourself with their tructure and how they inherit from each other to drive the pages.
fr: GeoNode comprend un ensemble de modèles de base qui utilisent le système de succession de template de Django pour fournir un système modulaire permettant de construire les pages web dans l'interface de GeoNode. Ces modèles de base conduise la mise en page globale et des choses comme la page d'accueil. Vous commencerez le processus de personnalisation de votre instance de GeoNode en substituant ces modèles, donc vous devriez vous familiariser avec leur structure et comment ils héritent de l'autre pour conduire les pages.

source: Additionally, most of the apps described above have their own set of templates that are used to drive the pages for each module. You may also want to override these templates for your own purposes and as such should familiarize yourself with a few of the key ones.
fr: En outre, la plupart des applications décrites ci-dessus ont leur propre ensemble de modèles qui sont utilisés pour piloter les pages pour chaque module. Vous pouvez également substituer ces modèles pour vos propres besoins et ainsi devriez vous familiariser avec quelques uns de la touche ceux.

source: GeoNode's css is based on Twitter's Bootstrap Library which uses the lessc dynamic stylesheet language. GeoNode extends from the basic Boostrap style and you are able to create your own bootstrap based style to customize the look and feel of your own GeoNode instance. Sites like bootswatch.com also provide ready made styles that you can simply drop in to your project to change the style.
fr: Css de GeoNode est basé sur Bootstrap bibliothèque Twitter qui utilise le langage de feuille de style dynamique lessc. GeoNode s'étend de la base style bootstrap et vous êtes en mesure de créer votre propre style de base "bootstrap" pour personnaliser l'apparence de votre propre instance de GeoNode. Des sites comme bootswatch.com fournissent également la cle que vous pouvez simplement déposer dans votre projet pour modifier le style.

source: The interactive functionality in GeoNode pages is provided by the jQuery javascript framework and a set of jQuery plugins. The core set of GeoNode javascript modules closely aligns with the apps described above, and there are also a few pieces of functionality provided as javascript modules that are used through out all of the apps. You are able to add your own jQuery code and/or plugins to perform interactive functionality in your own application.
fr: La fonctionnalité interactive des pages de GeoNode est fournie par le framework javascript jQuery et un ensemble de plugins jQuery. Le noyau ensemble de GeoNode modules javascript s'aligne étroitement sur les applications décrites ci-dessus, et il y a aussi quelques morceaux de fonctionnalité fournie sous forme de modules javascript qui est utilisés par toutes les applications. Vous êtes en mesure d'ajouter votre propre code jQuery et/ou des plugins pour exécuter des fonctionnalités interactives dans votre propre application.

source: Shell and Utilities
fr: Enveloppe et services

source: *ssh* into your virtual machine or other instance
fr: *ssh* dans votre machine virtuelle ou autre instance

source: *sudo* to modify the *sshd_config* settings to verify disabling of dns resolution (UseDNS=no)
fr: *sudo* pour modifier les *sshd_config* paramètres pour vérifier la désactivation de la résolution dns (UseDNS=no)

source: install a command line helper
fr: installer un programme d'assistance de la ligne de commande

source: exercise command completion
fr: exercice commande achèvement

source: activate/deactivate the *virtualenv* on your instance
fr: activer/désactiver le *virtualenv* sur votre instance

source: set the *DJANGO_SETTINGS_MODULE* env variable
fr: Définissez le *DJANGO_SETTINGS_MODULE* env variable

source: install the *httpie* utility via pip
fr: installer le *httpie* utilitaire via pip

source: launch *ipython* and experiment
fr: lancer *ipython* et expérience

source: execute a script with *ipython* and open the REPL
fr: exécuter un script avec *ipython* et ouvrez le REPL

source: Development Prerequsites and Core Modules
fr: Développement Prerequsites et Modules de base

source: This module will introduce you to the basic tools and skills required to start actively developing GeoNode.
fr: Ce module vous fera connaître les outils de base et les compétences nécessaires pour commencer à développer activement GeoNode.

source: GeoNode's Development Prerequisites
fr: Conditions de développement de GeoNode

source: Basic Shell Tools
fr: Outils de base de Shell

source: ssh and sudo
fr: ssh et sudo
