Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: The Layer Importer user interface is a component of the GeoServer web interface. You can access it from the GeoServer web interface by clicking the :guilabel:`Import Data` link, found on the left side of the screen after logging in.
fr: L'interface utilisateur de couche importateur est un composant de l'interface web de GeoServer. Vous pouvez y accéder depuis l'interface web de GeoServer en cliquant sur le lien :guilabel:`Import Data` , trouvé sur le côté gauche de l'écran après la connexion.

source: Data sources page
fr: Sources de données

source: The front page of the Layer Importer is where the data source and format are set. The following options are displayed:
fr: La première page de l'importateur de couche, c'est où la source de données et le format sont définies. Les options suivantes sont affichée :

source: Choose a data source to import from
fr: Choisir une source de données pour importer de la'

source: Select one of the following data sources to use for the import:
fr: Sélectionnez l'une des sources de données suivantes à utiliser pour l'importation :

source: Choose a data source
fr: Choisir une source de données

source: The contents of the next section is dependent on the data source chosen here.
fr: Le contenu de la section suivante dépend de la source de données choisie ici.

source: Configure the data source: Spatial Files
fr: Configurer la source de données : fichiers spatiale

source: There is a single box for selecting a file or directory. Click the :guilabel:`Browse` link to bring up a file chooser. To select a file, click on it. To select a directory, click on a directory name to open it and then click :guilabel:`OK`.
fr: Il y a une seule boîte de sélection d'un fichier ou un répertoire. Cliquez sur le :guilabel:`Browse` lien pour faire apparaître un sélecteur de fichier. Pour sélectionner un fichier, cliquez dessus. Pour sélectionner un répertoire, cliquez sur un nom de répertoire pour l'ouvrir et puis cliquez sur :guilabel:`OK`.

source: Spatial file data source
fr: Source de données fichier spatiale

source: File chooser for selecting spatial files
fr: Sélecteur de fichier pour sélectionner les fichiers spatiales

source: Configure the data source: PostGIS
fr: Configurer la source de données: PostGIS

source: Fill out fields for :guilabel:`Connection type` (Default or JNDI) :guilabel:`Host`, :guilabel:`Port`, :guilabel:`Database` name, :guilabel:`Schema`, :guilabel:`Username` to connect with, and :guilabel:`Password`.
fr: Complétez les champs pour :guilabel:`Connection type` (Default or JNDI) :guilabel:`Host`, :guilabel:`Port`, nom :guilabel:`Database`de la "Base", :guilabel:`Schema`, :guilabel:`Username` se connecter avec, et :guilabel:`Password`.

source: There are also advanced connection options, which are common to the standard PostGIS store loading procedure. (See the `PostGIS data store <../../geoserver/data/database/>`_ page in the GeoServer reference documentation.)
fr: Il y a aussi des options avancée de connexion, qui sont fréquentes dans le magasin de PostGIS standard procédure de chargement. (Voir la page `PostGIS data store <../../geoserver/data/database/>`_ dans la documentation de référence de GeoServer.)

source: PostGIS data source connection
fr: Connexion de source de données PostGIS

source: Configure the data source: Oracle
fr: Configurer la source de données : Oracle

source: The parameter fields for the Oracle import are identical to that of PostGIS. The fields aren't populated with default credentials with the exception of the port, which is set to **1521** by default.
fr: Les champs de paramètre pour l'importation d'Oracle sont identiques à celle de PostGIS. Les champs ne sont pas remplis avec les informations d'identification par défaut à l'exception du port, qui est définie sur **1521** par défaut.

source: This option is only enabled if the :ref:`Oracle <data_oracle>` extension is installed.
fr: Cette option est activée uniquement si le :ref:`Oracle <data_oracle>` extension est installée.

source: Oracle data source connection
fr: Connexion de source de données Oracle

source: Configure the data source: SQL Server
fr: Configurer la source de données : SQL Server

source: The parameter fields for the SQL Server import are identical to that of PostGIS. The fields aren't populated with default credentials with the exception of the port, which is set to **4866** by default.
fr: Les champs de paramètre pour l'importation de SQL Server sont identiques à celle de PostGIS. Les champs ne sont pas remplis avec les informations d'identification par défaut à l'exception du port, qui est définie sur **4866** par défaut.

source: This option is only enabled if the :ref:`SQL Server <data_sqlserver>` extension is installed.
fr: Cette option est activée uniquement si le :ref:`SQL Server <data_sqlserver>` extension est installé.

source: SQL Server data source connection
fr: Connexion de source de données SQL Server

source: Specify the target for the import
fr: Spécifiez la cible pour l'importation

source: This area specifies where in the GeoServer catalog the new data source will be stored. This does not affect file placement.
fr: Cette zone spécifie où est stockée dans le catalogue de GeoServer la nouvelle source de données. Cela n'affecte pas l'emplacement du fichier.

source: Select the name of an existing workspace and store.
fr: Sélectionnez le nom d'un workspace existant et le magasin.

source: Target workspace and store in GeoServer
fr: Espace de travail cible et magasin dans GeoServer

source: Alternately, select :guilabel:`Create New` and type in a names for a new workspace or store. During the import process, these will be created.
fr: Vous pouvez également sélectionner :guilabel:`Create New` et tapez un nom pour un nouvel workspace ou un magasin. Pendant le processus d'importation, ceux-ci seront créés.

source: Creating a new workspace and store
fr: Création d'un nouvel workspace et du magasin

source: Recent imports
fr: Récentes importations

source: This section will list previous imports, and whether they were successful or not. Items can be removed from this list with the :guilabel:`Remove` button, but otherwise cannot be edited.
fr: Cette section répertorie les importations effectuées précédemment, et si ils ont réussi ou non. Les éléments peuvent être retirés de cette liste avec le :guilabel:`Remove` bouton, mais dans le cas contraire ne peuvent pas être modifiés.

source: When ready to continue to the next page, click :guilabel:`Next`.
fr: Lorsque vous êtes prêt à continuer à la page suivante, cliquez sur :guilabel:`Next`.

source: Layer listing page
fr: Page de la liste de couche

source: On the next page will be a list of layers found by the Layer Importer. The layers will be named according to the source content's name (file name of database table name). For each entry there will be a :guilabel:`Status` showing if the source is ready to be imported.
fr: Sur la prochaine page il y aura une liste des couches trouvées par l'importateur de la couche. Les couches seront nommées selon le nom du contenu de la source (nom de fichier du nom de la table de base de données). Pour chaque entrée, il y aura un affichage de :guilabel:`Statut` si la source est prête à être importé.

source: All layers will be selected for import by default, but can be deselected here by unchecking the box next to each entry.
fr: Tous les calques seront sélectionnés pour l'importation par défaut, mais peuvent être désélectionnés ici en décochant la case en regard de chaque entrée.

source: List of layers to be imported
fr: Liste des couches à importer

source: A common issue during the import process is when a CRS cannot be determined for a given layer. In this case, a dialog box will display where the CRS can be declared explicitly. Enter the CRS and Click :guilabel:`Apply`.
fr: Un problème courant pendant le processus d'importation est quand un CRS ne peut être déterminé par une couche donnée. Dans ce cas, une boîte de dialogue s'affiche lorsque les CRS peuvent être déclarés explicitement. Entrez le CRS et cliquez sur :guilabel:`Apply`.

source: Declaring a CRS
fr: Déclarant un CRS

source: When ready to perform the import, click :guilabel:`Import`.
fr: Lorsque vous êtes prêt à effectuer l'importation, cliquez sur :guilabel:`Importer`.

source: Each selected layer will be added to the GeoServer catalog inside a new or existing store, and published as a layer.
fr: Chaque calque sélectionné est ajouté au catalogue de GeoServer à l'intérieur d'un magasin existant ou nouveau et est publié sous le titre une couche.

source: After the import is complete the status area will refresh showing if the import was successful for each layer. If successful, a dialog box for previewing the layer will be displayed, with options for :guilabel:`Layer Preview` (OpenLayers), :guilabel:`Google Earth`, and :guilabel:`GeoExplorer`.
fr: Une fois l'importation terminée ,la zone d'État rafraîchira, en montrant si l'importation a réussi pour chaque couche. Si réussie, une boîte de dialogue pour la prévisualisation de la couche apparaît, avec des options pour :guilabel:`Aperçu de calque` (OpenLayers), :guilabel:`Google Earth`, et :guilabel:`GeoExplorer`.

source: Layers successfully imported
fr: Calques importés avec succès

source: Advanced import settings page
fr: Page Paramètres avancés d'importation

source: The :guilabel:`Advanced` link next to each layer will lead to the Advanced import settings page.
fr: Le lien de :guilabel:`Advanced` à côté de chaque calque mènera à la page Paramètres avancés d'importation.

source: On this page, data can be set to be reprojected from one CRS to another during the import process. To enable reprojection, select the :guilabel:`Reprojection` box, and enter the source and target CRS.
fr: Sur cette page, des données peuvent être définies pour être projetées d'une CRS à l'autre pendant le processus d'importation. Pour activer la reprojection, sélectionnez la :guilabel:`Reprojection` boîte et entrez la source et cible les CRS.

source: In addition, on this page attributes can be renamed and their type changed. Click on the :guilabel:`Add` link under :guilabel:`Attribute Remapping` to select the attribute to alter, its type, and its new name. Click :guilabel:`Apply` when done.
fr: En outre, sur cette page les attributs peuvent être renommés et leur type peut changer. Cliquez sur le lien :guilabel:`Ajouter` sous :guilabel:`attribut Remapping` pour sélectionner l'attribut à modifier son type et son nouveau nom. Cliquez sur :guilabel:`Applique` lorsque terminé.

source: Click :guilabel:`Save` when finished.
fr: Cliquez sur :guilabel:`Enregistrer` lorsque vous avez terminé.

source: Advanced layer list page
fr: Page liste couche avancée

source: The Importer extension gives a GeoServer administrator an alternate, more-streamlined method for uploading and configuring new layers.
fr: L'extension de l'importateur donne à un administrateur de GeoServer une méthode alternes, plus-simplifiée pour le téléchargement et la configuration de nouveaux calques.

source: There are two primary advantages to using the Importer over the standard GeoServer data-loading workflow:
fr: Il y a deux principaux avantages à l'utilisation de l'importateur sur le workflow de chargement de données GeoServer standard :

source: **Supports batch operations** (loading and publishing multiple spatial files or database tables in one operation)
fr: **Lot de supports opérations** (chargement et édition de plusieurs fichiers spatiales ou les tables de base de données en une seule opération)

source: **Creates unique styles** for each layer, rather than linking to the same (existing) styles.
fr: **Crée des styles uniques** pour chaque couche, plutôt que d'un lien vers les mêmes styles (existants).

source: This section will discuss the Importer extension.
fr: Cet article discutera de l'extension de l'importateur.

source: Installing the Importer extension
fr: Installation de l'extension de l'importateur

source: The Importer extension is an official extension, available on the `GeoServer download <http://geoserver.org/download>`_ page.
fr: L'extension de l'importateur est une extension officielle, disponible sur le `téléchargement de GeoServer <http://geoserver.org/download>`_ page.

source: Download the extension for your version of GeoServer. (If you see an option, select :guilabel:`Core`.)
fr: Télécharger l'extension pour votre version de GeoServer. (Si vous voyez une option, sélectionnez :guilabel:`Core`.)

source: Make sure to match the version of the extension to the version of GeoServer.
fr: Assurez-vous de correspondre à la version de l'extension à la version de GeoServer.

source: Extract the archive and copy the contents into the GeoServer :file:`WEB-INF/lib` directory.
fr: Extraire l'archive et copier le contenu dans le GeoServer : file:'WEB-INF/lib' annuaire.

source: Restart GeoServer.
fr: Redémarrer GeoServer.

source: To verify that the extension was installed successfully, open the :ref:`web_admin` and look for an :guilabel:`Import Data` option in the :guilabel:`Data` section on the left-side menu.
fr: Pour vérifier que l'extension a été correctement installée, ouvrez le : Réf: "web_admin" et recherchez l'option :guilabel:`Importer des données` dans la section :guilabel:`Données` dans le menu de gauche.

source: Importer extension successfully installed.
fr: Importer l'extension correctement installée.

source: For additional information please see the section on :ref:`extensions_importer_using`.
fr: Pour plus d'informations, veuillez consulter la section sur : Réf: "extensions_importer_using".

source: Importer REST API examples
fr: Exemples d'API REST Importer

source: Mass configuring a directory of shapefiles
fr: Configuration d'un répertoire des shapefiles de masse

source: In order to initiate an import of the ``c:\data\tasmania`` directory into the existing ``tasmania`` workspace the following JSON will be POSTed to GeoServer::
fr: Afin d'initier une importation de la ``c:\data\tasmania`` répertoire en l'workspace ``tasmania`` existant le JSON suivant sera affiché à GeoServer::

source: This curl command can be used for the purpose::
fr: Cette commande curl peut être utilisée pour le but::

source: The importer will locate the files to be imported, and automatically prepare the tasks, returning the following response::
fr: L'importateur va rechercher les fichiers à importer et préparer automatiquement les tâches, en retournant la réponse suivante::

source: After checking every task is ready, the import can be initiated by executing a POST on the import resource::
fr: Après avoir vérifié que chaque tâche est prête, l'importation peut être initiée en exécutant un POST sur les ressources d'importation::

source: The resource can then be monitored for progress, and eventually final results::
fr: La ressource peut alors être surveillée pour le progrès et les résultats définitifs par la suite::

source: Which in case of successful import will look like::
fr: Qui dans le cas d'importation réussie va ressembler::

source: Configuring a shapefile with no projection information
fr: Configuration d'un shapefile avec aucune information de projection

source: In this case, let's assume we have a single shapefile, tasmania_cities.shp, that does not have the .prj anciliary file (the example is equally good for any case where the prj file contents cannot be matched to an official EPSG code).
fr: Dans ce cas, supposons que nous avons un seul shapefile, tasmania_cities.shp, qui n'a pas le fichier d'accessoires .prj (l'exemple est tout aussi bon pour tous les cas où le contenu du fichier prj ne peut pas correspondre à un code EPSG officiel).

source: We are going to post the following import definition::
fr: Nous allons afficher la définition d'importation suivants::

source: With the usual curl command::
fr: Avec l'usuel curl commande::

source: The response in case the CRS is missing will be::
fr: La réponse dans le cas où les CRS sont manquant sera::

source: Drilling into the task layer we can see the srs information is missing::
fr: Percer la couche de la tâche, nous pouvons voir les informations du srs sont manquantes::

source: The following PUT request will update the SRS::
fr: La demande PUT suivante met à jour le SRS::

source: Where ``layerUpdate.json`` is::
fr: Où est la ``layerUpdate.json``::

source: Getting the import definition again, we'll find it ready to execute::
fr: Obtenir la définition d'importation encore une fois, nous le trouverons prêt à exécuter::

source: A POST request will make it execute::
fr: Une requête POST le fera exécuter::

source: And eventually succeed::
fr: Et finalement réussir::

source: Uploading a CSV file to PostGIS while transforming it
fr: Télécharger un fichier CSV vers PostGIS tout en transformant

source: A remote sensing tool is generating CSV files with some locations and measurements, that we want to upload into PostGIS as a new spatial table. The CSV file looks as follows::
fr: Outil de télé détection génère des fichiers CSV avec des emplacements et des mesures, que nous voulons charger dans PostGIS comme une nouvelle table spatiale. Le fichier CSV se présente comme suit::

source: First, we are going to create a empty import with an existing postgis store as the target::
fr: Tout d'abord, nous allons créer une importation vide avec un magasin de postgis existant comme cible::

source: Where import.json is::
fr: Où import.json est::

source: Then, we are going to POST the csv file to the tasks list, in order to create an import task for it::
fr: Ensuite, nous allons POST du fichier csv à la liste des tâches, afin de créer une tâche d'importation pour elle::

source: And we are going to get back a new task definition, with a notification that the CRS is missing::
fr: Et nous allons récupérer une nouvelle définition de la tâche, avec une notification que la CRS est manquante::

source: As before, we are going to force the CRS by updating the layer::
fr: Comme avant, nous allons forcer les CRS en mettant à jour la couche::

source: Then, we are going to create a transformation mapping the Lat/Lon columns to a point::
fr: Ensuite, nous allons créer une transformation, mappez les colonnes de Lat/Lon jusqu'à un point situé::

source: The above will be uploaded to GeoServer as follows::
fr: Ce qui précède est téléchargé sur GeoServer comme suit::

source: Now the import is ready to run, and we'll execute it using::
fr: Maintenant, l'importation est prête à fonctionner, et nous allons l'exécuter à l'aide de::

source: If all goes well the new layer is created in PostGIS and registered in GeoServer as a new layer.
fr: Si tout va bien le nouveau calque est créé dans PostGIS et enregistré dans GeoServer comme un nouveau calque.

source: In case the features in the CSV need to be appended to an existing layer a PUT request against the task might be performed, changing its updateMode from "CREATE" to "APPEND". Changing it to "REPLACE" instead will preserve the layer, but remove the old conents and replace them with the newly uploaded ones.
fr: Dans le cas où les caractéristiques dans le fichier CSV doivent être ajoutées à un calque existant une demande PUT contre la tâche peut être exécutée, changeant son updateMode de "Créer" à "Ajouter". Changer pour "Remplacer" au lieu de cela va préserver la couche, mais enlever les matières anciennes et remplacez-les par ceux nouvellement téléchargés.

source: Uploading and optimizing a GeoTiff with ground control points
fr: Télécharger et optimiser un GeoTiff avec points de contrôle au sol

source: A data supplier is periodically providing GeoTiffs that we need to configure in GeoServer. The GeoTIFF is referenced via Ground Control Points, is organized by stripes, and has no overviews. The objective is to rectify, optimize and publish it via the importer.
fr: Un fournisseur de données fournit périodiquement GeoTiffs dont nous avons besoin de configurer dans GeoServer. Le GeoTIFF est référencé par l'intermédiaire de Points de contrôle au sol, est organisée par des bandes et n'a aucuns aperçus. L'objectif est de réparer, optimiser et publier par l'intermédiaire de l'importateur.

source: First, we are going to create a empty import with no store as the target::
fr: Tout d'abord, nous allons créer une importation vide sans magasin comme cible::

source: Then, we are going to POST the GeoTiff file to the tasks list, in order to create an import task for it::
fr: Ensuite, nous allons poster le fichier GeoTiff à la liste de tâches, afin de créer une tâche d'importation pour elle::

source: We are then going to append the transformations to rectify (gdalwarp), retile (gdal_translate) and add overviews (gdaladdo) to it::
fr: Nous sommes donc ajouter les transformations pour rectifier (gdalwarp), retile (gdal_translate) et y ajouter les aperçus (gdaladdo)::

source: A new layer ``box_gcp_fixed`` layer will appear in GeoServer, with an underlying GeoTiff file ready for web serving.
fr: Une nouvelle couche de ``box_gcp_fixed`` apparaîtra dans GeoServer, avec un fichier GeoTiff sous-jacent prêt pour le service web.

source: Adding a new granule into an existing mosaic
fr: Ajout d'un granule de nouveau en une mosaïque existante

source: A data supplier is periodically providing new time based imagery that we need to add into an existing mosaic in GeoServer. The imagery is in GeoTiff format, and lacks a good internal structure, which needs to be aligned with the one into the other images.
fr: Un fournisseur de données fournit périodiquement de nouvelles images de base dont nous avons besoin d'ajouter en une mosaïque existante dans GeoServer. L'imagerie est au format GeoTiff et manque d'une bonne structure interne, qui doit être alignée sur celle des autres images.

source: First, we are going to create a import with an indication of where the granule is located, and the target store:
fr: Tout d'abord, nous allons créer une importation en indiquant où se trouve le granule et la banque cible :

source: curl -u admin:geoserver -XPOST -H "Content-type: application/json" -d @import.json "http://localhost:8080/geoserver/rest/imports"
fr: curl -u admin:geoserver - XPOST -H "Content-type : application/json" le @import.json -d "http://localhost:8080/geoserver/repos/imports"

source: We are then going to append the transformations to harmonize the file with the rest of the mosaic::
fr: Nous allons ensuite ajouter les transformations afin d'harmoniser le fichier avec le reste de la mosaïque::

source: The new granule will be ingested into the mosaic, and will thus be available for time based requests.
fr: La nouvelle granule sera ingérée dans la mosaïque et sera donc disponible pour les demandes de temps basé.

source: Asynchronously fetching and importing data from a remote server
fr: Extraction de façon asynchrone et importation de données depuis un serveur distant

source: We assume a remote FTP server contains multiple shapefiles that we need to import in GeoServer as new layers. The files are large, and the server has much better bandwith than the client, so it's best if GeoServer performs the data fetching on its own.
fr: Nous supposons qu'un serveur FTP distant contient des shapefiles multiples que nous devons importer dans GeoServer comme nouveaux calques. Les fichiers sont volumineux, et le serveur a une meilleure largeur de bande que le client, il est donc préférable si GeoServer effectue la récupération de donnéespar soi meme

source: In this case a asynchronous request using ``remote`` data will be the best fit::
fr: Dans ce cas, une demande asynchrone à l'aide de données ``distantes`` sera le meilleur ajustement::
