Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: GeoNode has a mailing list (https://groups.google.com/d/forum/geonode-users) where users can ask and answer questions about the software. There are also IRC chats on Gitter where users (https://gitter.im/GeoNode/general) and developers (https://gitter.im/GeoNode) can discuss GeoNode in real time. Sometimes users also post interesting tips for managing sites running GeoNode. If you want to help out with GeoNode, one easy way is to sign up for the mailing list and help answer questions.
fr: GeoNode a une liste de diffusion (https://groups.google.com/d/forum/geonode-users), où les utilisateurs peuvent demander et répondre aux questions sur le logiciel. Il y a aussi des chats IRC sur Gitter où (https://gitter.im/GeoNode/general) les utilisateurs et les développeurs (https://gitter.im/GeoNode) pourront discuter des GeoNode en temps réel. Parfois les utilisateurs envoyer également des conseils intéressants pour la gestion des sites en cours d'exécution GeoNode. Si vous voulez nous aider avec GeoNode, vous pouvez vous inscrire à la mailing list et répondre aux questions des autres utilisateurs.

source: Report Problems on the Issue Tracking System
fr: Signaler des problèmes quant au système de suivi

source: Informative bug reports are a key part of the bug fixing process, so if you do run into a problem with GeoNode, please don't hesitate to report it on our bug tracker, available online at http://github.com/GeoNode/geonode/issues. Useful information for bug reports includes:
fr: Rapports de bogue informatives sont un élément clé du processus de fixation bug, si vous auriez un problème avec GeoNode, s'il vous plaît n'hésitez pas à le signaler sur notre traqueur de bogue, disponible en ligne à http://github.com/GeoNode/geonode/issues. Informations utiles pour les rapports de bogue comprennent :

source: What were you doing when the bug occurred? Does the problem occur every time you do that, or only occasionally?
fr: Que faisiez-vous lorsque le bug est survenu ? Le problème survient-il chaque fois que vous faites cela, ou qu'occasionnellement ?

source: What were you expecting to happen? What happened instead?
fr: Quoi vous attendiez-vous à arriver? Qu'est-il arrivé à la place?

source: What version of the software are you using? Please also note any changes from the default configuration.
fr: Quelle version du logiciel utilisez-vous ? Veuillez également noter tout changement de la configuration par défaut.

source: If there is a data file involved in the bug (such as a Shapefile that doesn't render properly), please consider including it in the bug report. Be aware that not all data files are freely distributable.
fr: Si il existe un fichier de données dans le bug (par exemple, un fichier de forme qui n'est pas rendu correctement), pensez à inclure dans le rapport de bogue. Sachez que tous les fichiers de données sont librement distribuables.

source: To help GeoNode to better address the issue you can tag the ticket with one or more lables that you can find on the side column.
fr: Pour aider GeoNode pour mieux résoudre le problème, vous pouvez marquer le billet avec une ou plusieurs étiquettes que vous trouverez sur la colonne.

source: Write Documentation
fr: Écrire la Documentation

source: GeoNode's documentation can always use improvement - there are always more questions to be answered. For managing contributions to the manual, GeoNode uses a process similar to that used for managing the code itself. The documentation is generated from source files in the `docs/` directory within the GeoNode source repository. See http://sphinx.pocoo.org/ for more information on the documentation system GeoNode uses.
fr: Documentation de GeoNode pouvez utiliser toujours amélioration - il y a toujours plus de questions à trancher. Pour la gestion des contributions au manuel, GeoNode utilise un procédé similaire à celui utilisé pour gérer le code lui-même. La documentation est générée à partir des fichiers sources dans le ' docs /' répertoire au sein du référentiel de source GeoNode. Voir le http://sphinx.pocoo.org/ pour plus d'informations sur le système de documentation qu'utilise GeoNode.

source: If you want to learn more about contributing to the documentation, please go ahead to the "`How to contribute to GeoNode’s Documentation <http://docs.geonode.org/en/latest/organizational/contribute/contribute_to_documentation.html#contrib-docu>`_". GeoNode also have some guidelines to help with writing once you are set up "`How to write Documentation <http://docs.geonode.org/en/latest/organizational/contribute/documentation_guidelines.html#doc-guidelines>`_".
fr: Si vous voulez en savoir plus sur les dons à la documentation, s'il vous plaît allez-y à la "`comment contribuer à la Documentation de GeoNode <http://docs.geonode.org/en/latest/organizational/contribute/contribute_to_documentation.html#contrib-docu>`_". GeoNode ont également quelques lignes directrices pour aider à la rédaction une fois que vous êtes prêt "`Comment écrire la Documentation <http://docs.geonode.org/en/latest/organizational/contribute/documentation_guidelines.html#doc-guidelines>`_".

source: Provide Translations
fr: Fournir des traductions

source: If GeoNode doesn't provide a user interface in your native language, consider contributing a new translation. To get started here are the instructions "`How to contribute to GeoNode’s Translation <http://docs.geonode.org/en/latest/organizational/contribute/contribute_to_translation.html>`_".
fr: Si GeoNode ne fournit pas une interface utilisateur dans votre langue maternelle, envisagez de contribuer une nouvelle traduction. Pour commencer Voici les instructions comment "`contribuer à la traduction de GeoNode <http://docs.geonode.org/en/latest/organizational/contribute/contribute_to_translation.html>`_".

source: Write Code
fr: Écrire du Code

source: Of course since GeoNode is an open source project which encourages contributions of source code as well. If you are interested in making small changes, you can find an open ticket on http://github.com/GeoNode/geonode/issues, hack away, and get started on the "`Patch Review Process <http://docs.geonode.org/en/latest/organizational/contribute/review_criteria.html>`_".
fr: Bien sûr, étant donné que GeoNode est un projet open source qui encourage ainsi les contributions du code source. Si vous êtes intéressé à faire de petits changements, vous pouvez trouver un billet ouvert sur http://github.com/GeoNode/geonode/issues, hack et lancez-vous sur la "`processus d'examen de Patch <http://docs.geonode.org/en/latest/organizational/contribute/review_criteria.html>`_".

source: Further Reading
fr: Voir aussi

source: Roadmap Process
fr: Processus de cheminement

source: The GeoNode Roadmap Process is designed to complement the more technical **GeoNode Improvement Proposals** and strives to make it easier for the various organizations invested in GeoNode to collaborate on features of common interest.
fr: Le processus de cheminement de GeoNode est conçu pour compléter la technique plus **GeoNode Improvement Proposals** et s'efforce de rendre plus facile pour les diverses organisations investies dans la GeoNode de collaborer sur des caractéristiques d'intérêt commun.

source: It is based on the "`roadmap items <https://spreadsheets.google.com/a/opengeo.org/spreadsheet/ccc?key=0AklXlBUnMqOrdDNackdvX3ZRS0Fha0xCeGhjSjZ1dEE>`_" developed at the `GeoNode Roadmapping Summit <http://geonode.org/2011/05/roadmapping-summit/>`_ held in May 2011.
fr: Il est basé sur le "`éléments de feuille de route <https://spreadsheets.google.com/a/opengeo.org/spreadsheet/ccc?key=0AklXlBUnMqOrdDNackdvX3ZRS0Fha0xCeGhjSjZ1dEE>`_" mis au point à la `GeoNode Roadmapping Summit <http://geonode.org/2011/05/roadmapping-summit/>`_ qui s'est tenue en mai 2011.

source: Overall, the process for adding items to the collective roadmap is as follows:
fr: Dans l'ensemble, le processus d'ajout d'éléments à la feuille de route collective est comme suit :

source: Organizational partner has an intent to add a feature to the roadmap.
fr: Partenaire d'organisation a l'intention d'ajouter une fonctionnalité à la feuille de route.

source: Organizational partner communicates with the `organizational partners list <https://groups.google.com/a/opengeo.org/group/geonode-org/>`_ about the change to gauge interest and determine who else is committed to making it happen.
fr: Partenaire d'organisation communique avec la `liste des partenaires d'organisation <https://groups.google.com/a/opengeo.org/group/geonode-org/>`_ sur le changement d'évaluer l'intérêt et de déterminer qui d'autre s'est engagé à passer.

source: Organizational partner creates a feature specification on the wiki to further flesh out the idea.
fr: Partenaire d'organisation crée une spécification de caractéristique sur le wiki d'étoffer davantage de l'idée.

source: Organizational partner finds a committer on the `developer list <https://groups.google.com/a/opengeo.org/group/geonode-dev/>`_ to shepherd the roadmap item through the **GeoNode Improvement Proposals**.
fr: Partenaire d'organisation conclut committer sur la `liste des développeurs <https://groups.google.com/a/opengeo.org/group/geonode-dev/>`_ prendra soin de l'élément de la feuille de route à travers la **GeoNode Improvement Proposals**.

source: Each roadmap item will go through four stages:
fr: Chaque élément de la feuille de route passera par quatre étapes :

source: Descriptive Stage (under discussion/"Active")
fr: Étape descriptive (en discussion / "Active")

source: Technical Stage
fr: Stage technique

source: Development Stage
fr: stade de développement

source: Released
fr: Publié

source: After communicating on the `organizational partners list <https://groups.google.com/a/opengeo.org/group/geonode-org/>`_ the roadmap items enters the *Descriptive Stage* and must have a wiki page that lays out the description, user stories, and other interested parties. Optionally, the roadmap item will also include an idea of the difficulty and goals as well as any wireframes, technical diagrams, or prior art.
fr: Après avoir communiqué sur les `organisations partenaires la liste <https://groups.google.com/a/opengeo.org/group/geonode-org/>`_ les éléments de la feuille de route pénètre dans le *descriptif étape* et doit avoir une page wiki qui énonce la description, récits utilisateur et autres parties intéressées. En option, l'élément de la feuille de route comprendra également une idée des difficultés et des objectifs ainsi que les maquettes, diagrammes techniques ou préalable art.

source: A roadmap item enters the *Technical Stage* once a committer has been found to shepherd the roadmap item through the **GeoNode Improvement Proposals** process, then the wiki page must contain a clear sense of the technical assumptions, requirements or dependencies, and suggested implementation. Some roadmap items may need to be divided into multiple independent GNIP proposals.
fr: Un élément de la feuille de route pénètre dans le * étape technique * une fois que committer a été trouvé pour paître l'élément de la feuille de route à travers le ** traiter les propositions d'amélioration GeoNode **, puis la page wiki doit contenir une idée claire des hypothèses techniques, exigences ou dépendances et mise en œuvre proposé. Certains éléments de la feuille de route doive être divisé en plusieurs propositions de GNIP indépendantes.

source: Once it passes through the **GeoNode Improvement Proposals** process, a roadmap item enters the *Development Stage* on its way to *Release*.
fr: Une fois qu'il traverse le traiter les propositions d'amélioration GeoNode, un élément de la feuille de route entre le *Development Stage* sur le chemin de *Release*.

source: Work With GitHub Issues and Pull Requests
fr: Travailler avec GitHub Issues et Pull Requests

source: An Issue is a note on a repository about something that needs attention. It could be a bug, a feature request, a question or lots of other things. On GitHub you can label, search and assign Issues, making managing an active project easier.
fr: Une Issue est une note sur une repository de quelque chose qui a besoin d'attention. Ça petu être un bug, une demande de fonctionnalité, une question ou beaucoup des d'autres choses. Sur GitHub, vous pouvez étiqueter, rechercher et assigner les Issues, rendant la gestion active du projet plus facile.

source: For example, let’s take a look at `Bootstrap’s Issues section <https://github.com/twbs/bootstrap/issues>`_:
fr: Par exemple, nous allons a voir la section `Issues des Bootstrap <https://github.com/twbs/bootstrap/issues>`_:

source: GitHub’s issue tracking is special because of our focus on collaboration, references, and excellent text formatting. A typical issue on GitHub looks a bit like this:
fr: La gestion des Issues sur GitHub est particulière en raison de son focalisation sur la collaboration, références et formatage de texte excellent. Une issues typique sur GitHub ressemble un peu à ceci :

source: A **title** and **description** describe what the issue is all about.
fr: A **titre** et *description* décrire ce que la question est tout au sujet.

source: Color-coded **labels** help you categorize and filter your issues (just like labels in email).
fr: Code couleur **étiquettes** vous aider à classer et filtrer vos problèmes (tout comme les étiquettes dans l'email).

source: A **milestone** acts like a container for issues. This is useful for associating issues with specific features or project phases (e.g. *Weekly Sprint 9/5-9/16 or Shipping 1.0*).
fr: A **milestone** agit comme un conteneur pour les questions. Ceci est utile pour associer des questions avec des caractéristiques spécifiques ou des phases du projet (p. ex. *Weekly Sprint 9/5-9/16 or Shipping 1.0*).

source: One **assignee** is responsible for working on the issue at any given time.
fr: Un **cessionnaire** est chargé de travailler sur la question à un moment donné.

source: **Comments** allow anyone with access to the repository to provide feedback.
fr: **Commentaires** permettre à toute personne ayant accès au référentiel pour fournir des commentaires.

source: Open an Issue
fr: Ouvrir une issue

source: Click the Issues tab from the sidebar.
fr: Cliquez sur l'onglet Issues de la barre latérale.

source: Click New Issue.
fr: Cliquez sur New Issue.

source: Give your Issue a title and description: *Add a new Logo to GeoNode custom*.
fr: Donner votre Issue, un titre et une description.

source: Click **Submit new Issue** when you’re done. Now this issue has a permanent home (URL) that you can reference even after it is closed.
fr: Cliquez sur **Submit new Issue** lorsque vous avez terminé. Maintenant, cette question a une résidence permanente (URL) que vous pouvez référencer la même après il est fermé.

source: Issues Pro Tips
fr: Délivre des conseils Pro

source: **Check existing issues** for your issue. Duplicating an issue is slower for both parties so search through open and closed issues to see if what you’re running into has been addressed already.
fr: **Vérifiez existant questions** pour votre question. Un problème de duplication est plus lente pour les deux parties afin de rechercher à travers des questions ouvertes et fermées pour voir si ce que vous exécutez dans a été abordée déjà.

source: **Be clear** about what your problem is: what was the expected outcome, what happened instead? Detail how someone else can recreate the problem.
fr: **Être clair** tout ce que votre problème est : quel était le résultat attendu, ce qui est arrivé à la place ? Détailler comment quelqu'un d'autre peut reproduire le problème.

source: **Link to demos** recreating the problem on things like JSFiddle or CodePen.
fr: **Lien vers démos** recréer le problème sur des choses comme JSFiddle ou CodePen.

source: **Include system details** like what the browser, library or operating system you’re using and its version.
fr: **Inclut système détails** comme ce que le navigateur, bibliothèque ou système d'exploitation que vous utilisez et sa version.

source: **Paste error output** or logs in your issue or in a Gist. If pasting them in the issue, wrap it in three backticks: ``````` so that it renders nicely.
fr: **Coller la sortie erreur** ou journaux dans votre livraison ou dans un Gist. Si en les collant dans le numéro, placez-le dans trois apostrophes inverses: ``````` alors qu'il rend très bien.

source: **Branching** is the way to work on different parts of a repository at one time.
fr: **Branching** est la façon de travailler sur les différentes parties d'un référentiel à un moment donné.

source: When you create a repository, by default it has one branch with the name ``master``. You could keep working on this branch and have only one, that’s fine. But if you have another feature or idea you want to work on, you can create another branch, starting from ``master``, so that you can leave ``master`` in its working state.
fr: Lorsque vous créez une repository, par défaut, il possède une branche avec le ``master`` de nom. Vous pouvez continuer à travailler sur cette branche et avoir qu'un seul, c'est très bien. Mais si vous avez une autre fonction ou idée que vous voulez travailler sur, vous pouvez créer une autre branche, à partir de ``master``, de sorte que vous pouvez confier ``master`` de son état de fonctionnement.

source: When you create a branch, you’re making a **copy** of the original branch as it was at that point in time (*like a photo snapshot*). If the original branch changes while you’re working on your new branch, no worries, you can always pull in those updates.
fr: Lorsque vous créez une branche, vous faites un **copie** de la branche d'origine telle qu'elle était à ce point dans le temps (*comme un instantané de photo*). Si la branche d'origine change pendant que vous travaillez sur votre nouvelle branche, pas de soucis, vous pouvez toujours tirer dans ces mises à jour.

source: At GeoNode developers use branches for keeping bug fixes and feature work separate from ``master`` (**production**) branch. When a feature or fix is ready, the branch is **merged** into master through a **Pull Request**.
fr: À GeoNode les développeurs utilisent des branches pour garder les corrections de bugs et de travail de la fonction séparée de ``master`` (**production**) branche. Lorsqu'une fonction ou un fix est prête, la branche est **fusionnée** en maître à travers un **Pull Request**.

source: To create a new branch
fr: Pour créer une nouvelle branche

source: Go to the project folder and create a new branch
fr: Allez dans le dossier de projet et créer une nouvelle branche

source: Check that you are working on the correct branch: ``add_logo``.
fr: Vérifiez que vous travaillez sur la branche correcte: ``add_logo``.

source: Push the new branch to GitHub.
fr: Pousser la nouvelle branche sur GitHub.

source: Make a commit
fr: Faire un commit

source: On GitHub, saved changes are called **commits**.
fr: Sur GitHub, modifications enregistrées sont appelées **commits**.

source: Each commit has an associated **commit message**, which is a description explaining why a particular change was made. Thanks to these messages, you and others can read through commits and understand what you’ve done and why.
fr: Chaque commit a un associé **commit message**, qui est une description expliquant pourquoi une modification particulière a été apportée. Grâce à ces messages, vous et autres peuvent lire par le biais de validations et comprendre ce que vous avez fait et pourquoi.

source: Add a new logo to your custom GeoNode as described in the section :ref:`theme_admin`
fr: Ajouter un nouveau logo à votre GeoNode personnalisé, comme décrit dans la section :ref:`theme_admin`

source: Stash the new files into the working project using ``git add``
fr: Planquer les nouveaux fichiers dans le projet de travail à l'aide de ``git add``

source: **Commit** the changes providing a **commit messages** and push them into your branch : ``add_logo``.
fr: **Validation** les changements fournissant un **commettre messages** et poussez-les dans votre branche: ``add_logo``.

source: Pull Requests are the heart of collaboration on GitHub. When you make a pull request, you’re proposing your changes and requesting that someone pull in your contribution - aka merge them into their branch. GitHub’s Pull Request feature allows you to compare the content on two branches. The changes, additions and subtractions, are shown in green and red and called diffs (differences).
fr: Requêtes d'extraction sont le cœur de la collaboration sur GitHub. Lorsque vous effectuez une demande de tirer, vous êtes proposer vos modifications et demandant que quelqu'un tirer dans votre contribution - aka fusionnez-les dans leur branche. Tirer demande fonctionnalité de GitHub vous permet de comparer le contenu de deux branches. Les modifications, additions et soustractions, sont indiquées en vert et rouge et appelées diffs (différences).

source: As soon as you make a change, you can open a Pull Request. People use Pull Requests to start a discussion about commits (code review) even before the code is finished. This way you can get feedback as you go or help when you’re stuck.
fr: Dès que vous apportez une modification, vous pouvez ouvrir une demande de tirer. Gens utilisent requêtes tirer pour lancer une discussion sur les validations (examen du code) même avant que le code soit terminé. De cette façon vous pouvez obtenir vos commentaires que vous allez ou aider quand vous êtes coincé.

source: By using GitHub’s @mention system in your Pull Request message, you can ask for feedback from specific people or teams.
fr: Grâce au système @mention de GitHub dans votre message de demande de tirer, vous pouvez demander des commentaires de personnes spécifiques ou des équipes.

source: Create a Pull Request for changes to the Logo
fr: Créer une demande de tirer pour faire modifier le Logo

source: Click the Pull Request icon on the sidebar, then from the Pull Request page, click the green **New pull request** button.
fr: Cliquez sur l'icône de demande de tirer sur la barre latérale, puis de la page demande de tirer, sur le vert **New pull request** bouton nouveau.

source: Select the branch you made, ``add_logo``, to compare with ``master`` (the original).
fr: Sélectionnez la branche que vous faites,``add_logo``, à comparer avec ``master`` (l'original).

source: Look over your changes in the diffs on the Compare page, make sure they’re what you want to submit.
fr: Regarder par-dessus vos modifications dans les diffs sur la page de comparaison, assurez-vous qu'ils sont ce que vous voulez soumettre.

source: When you’re satisfied that these are the changes you want to submit, click the big green Create Pull Request button.
fr: Lorsque vous êtes convaincu que ce sont les changements que vous voulez envoyer, cliquez sur le gros bouton vert créer tirez sur demande.

source: Give your pull request a title and since it relates directly to an open issue, include “fixes #” and the issue number in the title. Write a brief description of your changes.
fr: Donnez un titre à votre demande de tirer et puisqu'elle se rapporte directement à une question ouverte, ajouter “fixes #” et le numéro de la question dans le titre. Écrire une brève description de vos modifications.

source: When you’re done with your message, click **Create pull request!**
fr: Lorsque vous avez terminé avec votre message, cliquez sur **Create pull request!**

source: Merge your Pull Request
fr: Fusionnez votre Pull Request

source: It’s time to bring your changes together – merge your ``add_logo`` branch into the ``master`` (the original) branch.
fr: Il est temps de rassembler vos modifications – fusionner votre branche de ``add_logo`` dans la branche ``master`` (l'original).
