Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: Task transformations
fr: Transformations de tâche

source: Retrieve the list of transformations of a task with id <taskId> within import with id <importId>
fr: Récupérer la liste des transformations d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: A list of transfromations in JSON format
fr: Une liste des transfromations au format JSON

source: Create a new transormation and append it inside a task with id <taskId> within import with id <importId>
fr: Créer une nouveau transormation et ajoutez-la à l'intérieur d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: A JSON transformation representation
fr: Une représentation de transformation de JSON

source: The transform location
fr: L'emplacement de la transformation

source: Retrieving the transformation list
fr: Récupération de la liste de transformation

source: A GET request for the list of transformations will result in the following response::
fr: Une requête GET pour la liste des transformations se traduira par la réponse suivante::

source: Appending a new transformation
fr: En ajoutant une nouvelle transformation

source: Creating a new transformation requires posting a JSON document with a ``type`` property identifying the class of the transformation, plus any extra attribute required by the transformation itself (this is transformation specific, each one will use a different set of attributes).
fr: Création d'une nouvelle transformation, affichant un document JSON avec une propriété de ``type`` identifier la catégorie de la transformation, ainsi que n'importe quel attribut supplémentaire requis par la transformation elle-même (il s'agit de transformation spécifique, que chacun d'eux utilise un ensemble différent d'attributs).

source: The following POST request creates an attribute type remapping::
fr: La requête POST suivante crée un type d'attribut remappage::

source: The response will be::
fr: La réponse sera::

source: Retrieve a transformation identified by <transformId> inside a task with id <taskId> within import with id <importId>
fr: Récupérer une transformation identifiée par <transformId> à l'intérieur d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: A single transformation in JSON format
fr: Une seule transformation au format JSON

source: Modifies the definition of a transformation identified by <transformId> inside a task with id <taskId> within import with id <importId>
fr: Modifie la définition d'une transformation identifiée par <transformId> à l'intérieur d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: A JSON transformation representation (eventually just the portion of it that needs to be modified)
fr: Une représentation de transformation JSON (éventuellement juste la partie de celui-ci qui doit être modifiée)

source: The full transformation representation
fr: La représentation de la transformation complète

source: Removes the transformation identified by <transformId> inside a task with id <taskId> within import with id <importId>
fr: Supprime la transformation identifiée par <transformId> à l'intérieur d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: Retrieve a single transformation
fr: Récupérer une seule transformation

source: Requesting a single transformation by identifier will result in the following response::
fr: Demander une seule transformation par identificateur se traduira par la réponse suivante::

source: Modify an existing transformation
fr: Modifier une transformation existante

source: Assuming we have a reprojection transformation, and that we need to change the target SRS type, the following PUT request will do the job::
fr: En supposant que nous avons une transformation de la reprojection, et qu'il faut changer le type de cible SRS, la demande PUT suivante va faire le travail::

source: Transformation reference
fr: Référence de la transformation

source: Remaps a certain field to a given target data type
fr: Remappe un certain champ d'un type de données cible donnée

source: Parameter
fr: Paramètre

source: field
fr: champ

source: The name of the field to be remapped
fr: Le nom du champ à été remappé

source: The "target" field type, as a fully qualified Java class name
fr: Le champ "cible" type, comme un nom de classe qualifié complet Java

source: Transforms two numeric fields ``latField`` and ``lngField`` into a point geometry representation ``POINT(lngField,latField)``, the source fields will be removed.
fr: Deux champs de type numérique ``latField`` et ``lngField`` transforme une représentation de la géométrie de point ``POINT(lngField,latField)``, les sources de champs seront supprimées.

source: The "latitude" field
fr: Le champ "latitude"

source: The "longitude" field
fr: Le champ "longitude"

source: For database targets only, creates an index on a given column after importing the data into the database
fr: Pour les objectifs de base de données seulement, crée un index sur une colonne donnée après avoir importé les données dans la base de données

source: The field to be indexed
fr: Le champ à indexer

source: Parses a string representation of a date into a Date/Timestamp object
fr: Analyse une représentation sous forme de chaîne d'une date dans un objet Date/Timestamp

source: The field to be parsed
fr: Le domaine à analyser

source: A date parsing pattern, setup using the Java `SimpleDateFormat syntax <http://docs.oracle.com/javase/7/docs/api/java/text/SimpleDateFormat.html>`_. In case it's missing, a number of built-in formats will be tried instead (short and full ISO date formats, dates without any separators).
fr: Une date de l'analyse de modèle, le programme d'installation en utilisant le Java `SimpleDateFormat syntaxe <http://docs.oracle.com/javase/7/docs/api/java/text/SimpleDateFormat.html>`_. Dans le cas où il est absent, un certain nombre de mises en forme intégrées est jugée à la place (formats de date ISO courte et complet, dates sans séparateur).

source: Takes a integer field and transforms it to a date, interpreting the intereger field as a date
fr: Prend un champ de type entier et transforme le à une date, interpréter le champ comme une date

source: The field containing the year information
fr: Le champ contenant les informations de l'année

source: Reprojects a vector layer from a source CRS to a target CRS
fr: Reprojects une couche vecteur d'une source de CRS à une cible CRS

source: Identifier of the source coordinate reference system (the native one will be used if missing)
fr: Identificateur de la source référentiel (celui natif sera utilisé si absent)

source: Identifier of the target coordinate reference system
fr: Identificateur du système de coordonnées de référence cible

source: Applies ``gdal_translate`` to a single file raster input. Requires ``gdal_translate`` to be inside the PATH used by the web container running GeoServer.
fr: S'applique ``gdal_translate`` à un seul fichier raster d'entrée. ``gdal_translate`` a besoin pour se trouver dans le chemin d'accès utilisé par le conteneur web exécutant GeoServer.

source: Array of options that will be passed to ``gdal_translate`` (beside the input and output names, which are internally managed)
fr: Tableau des options qui seront transmises à ``gdal_translate``(à côté des noms d'entrée et de sortie, qui sont gérés en interne)

source: Applies ``gdalwarp`` to a single file raster input. Requires ``gdalwarp`` to be inside the PATH used by the web container running GeoServer.
fr: ``gdalwarp``s'applique à un seul fichier raster d'entrée. ``gdalwarp`` a besoin pour se trouver dans le chemin d'accès utilisé par le conteneur web exécutant GeoServer.

source: Array of options that will be passed to ``gdalwarp`` (beside the input and output names, which are internally managed)
fr: Tableau des options qui seront transmis à ``gdalwarp``(à côté des noms d'entrée et de sortie, qui sont gérés en interne)

source: Applies ``gdaladdo`` to a single file raster input. Requires ``gdaladdo`` to be inside the PATH used by the web container running GeoServer.
fr: Appliquer ``gdaladdo`` à un seul fichier raster d'entrée. ``gdaladdo`` a besoin de se trouver dans le chemin d'accès utilisé par le conteneur web exécutant GeoServer.

source: Array of options that will be passed to ``gdaladdo`` (beside the input file name, which is internally managed)
fr: Tableau d'options qui seront passées aux ``gdaladdo``(à côté de nom de fichier d'entrée, qui est géré en interne)

source: levels
fr: niveaux

source: Array of integers with the overview levels that will be passed to ``gdaladdo``
fr: Tableau d'entiers avec les niveaux de présentation qui seront passés au ``gdaladdo``

source: Using the Importer extension
fr: À l'aide de l'extension de l'importateur

source: Here are step-by-step instructions to import multiple shapefiles in one operation. For more details on different types of operations, please see the :ref:`extensions_importer_guireference`
fr: Voici les instructions étape par étape pour importer plusieurs fichiers en une seule opération. Pour plus de détails sur les différents types d'opérations, veuillez consulter le : Réf: "extensions_importer_guireference"

source: Find a directory of shapefiles and copy into your :ref:`data_directory`.
fr: Trouver un annuaire des shapefiles et copiez les dans votre : Réf: "data_directory".

source: You can always use the `Natural Earth Quickstart <http://www.naturalearthdata.com/downloads/>`_ data for this task.
fr: Vous pouvez toujours utiliser le `Natural Earth Quickstart <http://www.naturalearthdata.com/downloads/>`_ data pour cette tâche.

source: Log in as an administrator and navigate to the :guilabel:`Data --> Import Data` page.
fr: Ouvrez une session en tant qu'administrateur et accédez à la page :guilabel:`Data --> Import Data`.

source: For select :guilabel:`Spatial Files` as the data source.
fr: Pour select :guilabel:`Les fichiers spatiale` comme source de données.

source: Data source
fr: Source des données

source: Click :guilabel:`Browse` to navigate to the directory of shapefiles to be imported.
fr: Cliquez sur :guilabel:`Browse` pour accéder au répertoire de fichiers à importer.

source: The web-based file browser will show as options your home directory, data directory, and the root of your file system (or drive). In this case, select :guilabel:`Data directory`
fr: Le navigateur de fichiers basé sur le web s'affichera comme options de votre répertoire, répertoire de données et la racine de votre système de fichiers (ou lecteur). Dans ce cas, sélectionnez :guilabel:`Répertoire de données`

source: Directory
fr: Répertoire

source: Back on the main form, select :guilabel:`Create new` next to :guilabel:`Workspace`, and enter :kbd:`ne` to denote the workspace.
fr: Retour sur le formulaire principal, sélectionnez :guilabel:`Créer un nouveau` à côté de :guilabel:`Workspace`, puis entrez :kbd:`ne` pour désigner l'workspace.

source: Make sure the :guilabel:`Store` field reads :guilabel:`Create new` as well.
fr: Assurez-vous que la :guilabel:`Conserver` sur le terrain se lit comme suit :guilabel:`Créer un nouveau` aussi bien.

source: Import target workspace
fr: Importez le workspace cible

source: Click :guilabel:`Next` to start the import process.
fr: Cliquez sur :guilabel:`Suivant` pour commencer le processus d'importation.

source: On the next screen, any layers available for import will be shown.
fr: Sur l'écran suivant, toutes les couches disponibles pour l'importation seront montrées.

source: Non-spatial files will be ignored.
fr: Les fichiers non spatiales seront ignorés.

source: Import layer list
fr: Liste de couche d'importation

source: In most cases, all files will be ready for import, but if the the spatial reference system (SRS) is not recognized, you will need to manually input this but clicking :guilabel:`Advanced`
fr: Dans la plupart des cas, tous les fichiers seront prêts pour l'importation, mais si le système de référence spatiale (SRS) n'est pas reconnu, vous devrez entrer manuellement cela, mais en cliquant sur :guilabel:`Advanced`

source: You will need to manually input the SRS if you used the Natural Earth data above. For each layer click on :guilabel:`Advanced` and set reprojection to :kbd:`EPSG:4326`.
fr: Vous devrez entrer manuellement le SRS, si vous avez utilisé les données de terre naturelle ci-dessus. Pour chaque calque, cliquez sur :guilabel:`Avancé` et set reprojection à :kbd:`EPSG:4326`.

source: Advanced import settings
fr: Paramètres d'importation avancés

source: Check the box next to each layer you wish to import.
fr: Cochez la case à coté de chaque calque que vous souhaitez importer.

source: Setting the layers to import
fr: Définissant les couches à importer

source: When ready, click :guilabel:`Import`.
fr: Lorsque vous êtes prêt, cliquez sur :guilabel:`Importer`.

source: Don't click :guilabel:`Done` at this point, otherwise the import will be canceled.
fr: Ne cliquez pas sur :guilabel:`Fait` à ce stade, sinon l'importation sera annulée.

source: The results of the import process will be shown next to each layer.
fr: Les résultats du processus d'importation seront afficherés à côté de chaque calque.

source: When finished, click :guilabel:`Done`.
fr: Lorsque vous avez terminé, cliquez sur :guilabel:`Done`.

source: Recent import processes are listed at the bottom of the page. You may wish to visit these pages to check if any difficulties were encountered during the import process or import additional layers.
fr: Les processus d'importation récents figurent au bas de la page. Vous pouvez visiter ces pages pour vérifier si des difficultés ont été rencontrées durant le processus d'importation ou importation des couches supplémentaires.

source: Testing in GeoNode
fr: Test de GeoNode

source: The community encourages the Test Driven Development (TDD) and the contribution to write new tests to extend the coverage. Ideally every model, view, and utility should becovered by tests.
fr: La communauté encourage le Test Driven Development (ATS) et la contribution d'écrire de nouveaux tests pour étendre la couverture. Idéalement, chaque modèle, vue et utilitaire doivent etre couverte par des tests.

source: GeoNode has Unit, Integration and Javascript tests. The Unit tests are located in the tests file of every django app (Maps, Layers, Documents, Catalogue, Search, Security etc).
fr: GeoNode a des Unit, intégration et tests de Javascript. Les tests unitaires sont situés dans le fichier de tests de chaque appli django (cartes, couches, Documents, Catalogue, recherche, sécurité etc.).

source: The Integration, CSW and smoke tests are located under the tests folder).
fr: L'intégration, les CCF et les tests de fumée sont situés sous le dossier tests).

source: The tests are meant to be ran using the SQLite database, some of them may fail using PostgreSQL or others. Therefore **remove or rename your local_settings.py file before running the tests**.
fr: Les essais sont destinés à être exécuté à l'aide de la base de données SQLite, certains d'entre eux risquent de ne pas utiliser PostgreSQL ou autres. C'est pourquoi ** supprimez ou renommez votre fichier local_settings.py avant d'exécuter les tests **.

source: If running them in development mode make sure to have the jetty server
fr: Si leur exécution en mode développement Assurez vous d'avoir le serveur jetty

source: shut down otherwise the test could get stuck. To make sure it is run:
fr: fermer sinon le test pourrait se coincer. Pour vous assurer que c'est exécuté :

source: To run the unit tests make sure you have the virtualenv active (if running GeoNode under virtualenv) then run:
fr: Pour exécuter l'unité essais Assurez-vous que vous avez le virtualenv active (si vous exécutez GeoNode sous virtualenv) puis exécutez :

source: This will produce a detailed test report.
fr: Cela produira un rapport de test détaillé.

source: It's possible to run just specific apps tests by using the django command:
fr: Il est possible d'exécuter des tests des applications spécifiques juste en utilisant la commande django :

source: To run a single testcase or method (omit the method name to run the whole class), for example:
fr: Pour exécuter une méthode ou un seul test unitaire (omettre le nom de la méthode à exécuter l'ensemble de la classe), par exemple :

source: These tests are based on the Python/django unit test suite.
fr: Ces tests sont basés sur la suite de tests d'unité Python/django.

source: Integration Tests
fr: Tests d'intégration

source: To run the csw integration test run:
fr: Pour exécuter la série de tests de l'intégration :

source: Like the unit tests above, it is also possible to test specific modules, for example:
fr: Comme les tests unitaires ci-dessus, il est également possible de tester des modules spécifiques, par exemple :

source: To test with with coverage:
fr: Faire l'essai avec une couverture :

source: Javascript Tests
fr: Tests de JavaScript

source: Javascript tests has been currently disabled in GeoNode. There is a plan to improve and re-enable them in the future.
fr: Tests de JavaScript a été désactivé actuellement en GeoNode. Il existe un plan afin d'améliorer et de le réactiver à l'avenir.

source: Contributing to Open Source on GitHub
fr: Contribuer à l'Open Source sur GitHub

source: This section is freely adapted from the official `GitHub guides <https://guides.github.com>`_.
fr: Cette section est librement adaptée de l'official `GitHub guides <https://guides.github.com>`_.

source: A great way to get involved in open source is to contribute to the existing projects you’re using.
fr: Une excellente façon de s'impliquer dans l'open source est de contribuer aux projets existants que vous utilisez.

source: A Typical GitHub Project Structure
fr: Une Structure typique de projet GitHub

source: The Community
fr: La Communauté

source: Projects often have a community around them, made up of other users in different (formal or informal) roles:
fr: Des projets ont souvent une communauté autour d'eux, composé d'autres utilisateurs dans des rôles différents (formelles ou informelles) :

source: **Owner** is the user or organization that created the project has the project on their account.
fr: **Propriétaire** est l'utilisateur ou organisation qui a créé le projet le projet a-t-il sur leur compte.

source: **Maintainers** and Collaborators are the users primarily doing the work on a project and driving the direction. Oftentimes the owner and the maintainer are the same. They have write access to the repository.
fr: **Maintainers** et collaborateurs sont les utilisateurs principalement faire le travail sur un projet et la direction d'entraînement. Souvent, le propriétaire et le responsable sont les mêmes. Ils ont un accès en écriture au référentiel.

source: **Contributors** is everyone who has had a pull request merged into a project.
fr: **Contributeurs** est tout le monde qui a eu une demande de traction fusionnée dans un projet.

source: **Community** Members are the users who often use and care deeply about the project and are active in discussions for features and pull requests.
fr: **Communauté** membres sont les utilisateurs qui souvent utilisent et se soucient profondément le projet et sont actifs dans les discussions pour les fonctionnalités et tirez sur les requêtes.

source: Nearly all GitHub projects include a README.md file. The readme provides a lay of the land for a project with details on how to use, build and sometimes contribute to a project.
fr: Presque tous les projets de GitHub incluent un fichier de README.md. Le fichier readme fournit une configuration du terrain pour un projet avec des détails sur la façon de les utiliser, créer et parfois contribuer à un projet.

source: License
fr: Licence

source: A `LICENSE` file, well, is the license for the project. An open source project’s license informs users what they can and can’t do (e.g., use, modify, redistribute), and contributors, what they are allowing others to do.
fr: Un fichier `LICENSE` est la licence pour le projet. Une licence du projet open source informe les utilisateurs qu'ils peuvent et ne peuvent pas faire (par exemple, utiliser, modifier, redistribuer) et les contributeurs, qu'ils sont permettant à d'autres de le faire.

source: Documentation and Wikis
fr: Documentation et Wikis

source: Many larger projects go beyond a readme to give instructions for how people can use their project. In such cases you’ll often find a link to another file or a folder named `docs` in the repository.
fr: Beaucoup des projets fournissent plus que un readme pour donner des instructions pour comment les gens peuvent utiliser leur projet. Ils fournissent souvent un lien vers un autre fichier ou un dossier nommé `docs` dans le repository.

source: Alternatively, the repository may instead use the GitHub wiki to break down documentation.
fr: Alternativement, le référentiel peut utiliser le wiki de GitHub pour décomposer la documentation.

source: Issues are a great way to keep track of tasks, enhancements, and bugs for your projects. They’re kind of like email—except they can be shared and discussed with the rest of your team. Most software projects have a bug tracker of some kind. GitHub’s tracker is called Issues, and has its own section in every repository.
fr: Les Issues sont une excellente façon de garder une trace de tâches, des améliorations et des bugs pour vos projets. Ils peuvent être partagés et discutés avec le reste de votre équipe. La plupart des projets de logiciel ont un traqueur de bug. Le traqueur de GitHub est tres simple et il est fourni par la section Issues.

source: For more information on how Issues work, see the section ":ref:`work_with_github`"
fr: Pour plus d'informations sur le fonctionnement des questions, consultez la section ":ref:`work_with_github`"

source: If you’re able to patch the bug or add the feature yourself, make a pull request with the code. Be sure you’ve read any documents on contributing, understand the license and have signed a CLA if required.
fr: Si vous êtes capable de patcher un bogue ou ajouter une fonctionnalité vous-même, vous devez faire une une pull request avec le code sourc. Vous devez etre sure que vous avez lu tous les documents sur la contribution, que vous avez compri la licence et avez signé un CLA si nécessaire.

source: Once you’ve submitted a pull request the maintainer(s) can compare your branch to the existing one and decide whether or not to incorporate (pull in) your changes.
fr: Une fois que vous avez soumis une demande de tirer les maintainer(s) pouvez comparer votre succursale à celle existante et décider ou non d'intégrer (traction) vos modifications.

source: For more information on how Pull Requests work, see the section ":ref:`work_with_github`"
fr: Pour plus d'informations sur le fonctionnement de tirer les requêtes, reportez-vous à la section ":ref:`work_with_github`"

source: Contributing to GeoNode
fr: Contribuer au GeoNode

source: If you are interested in helping us to make GeoNode, there are many ways to do so.
fr: Si vous voulez nous aider àvec le developpement de GeoNode, il y a plusieurs façons de faire ça.

source: Participate in the Discussion
fr: Participer au débat
