Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: The request will return immediately with an import context in "INIT" state, and it will remain in such state until the data is fetched and the tasks created. Once the state switches to "PENDING" the import will be ready for execution. Since there is a lot of shapefiles to process, also the import run will be done in asynchronous mode::
fr: La requête retournera immédiatement avec un contexte d'importation en l'État "INIT", et il reste dans cet état jusqu'à ce que les données sont lues et les tâches créées. Une fois les commutateurs de l'Etat à "PENDING" l'importation sera prête pour l'exécution. Puisqu'il n'y a pas beaucoup de shapefiles à traiter, également l'importation exécutée se fera en mode asynchrone::

source: The response will return immediately in this case as well, and the progress can be followed as the tasks in the import switch state.
fr: La réponse retournera immédiatement dans ce cas également, et les progrès peuvent être suivis comme les tâches dans l'état de commutation d'importation.

source: Importer concepts
fr: Concepts de l'importateur

source: The importer REST api is built around a tree of objects representing a single import, structured as follows:
fr: L'importateur api REST est construit autour d'une arborescence d'objets représentant une importation unique, structurée comme suit :

source: import
fr: importation

source: target workspace
fr: workspace cible

source: data
fr: données

source: task (one or more)
fr: tâche (un ou plusieurs)

source: layer
fr: film d'émail

source: transformation (one or more)
fr: transformation (un ou plusieurs)

source: An **import** refers to the top level object and is a "session" like entity the state of the entire import. It maintains information relevant to the import as a whole such as user infromation, timestamps along with optional information that is uniform along all tasks, such as a target workspace, the shared input data (e.g., a directory, a database). An import is made of any number of task objects.
fr: Une ** importation ** fait référence à l'objet de niveau supérieur et est une "session" comme entité de l'état de l'importation de toute. Elle conserve les informations pertinentes à l'importation dans son ensemble comme utilisateur infromation, horodateurs, ainsi que les informations facultatives est uniformes le long de toutes les tâches, comme un workspace de cible, les données partagées d'entrée (par exemple, un répertoire, une base de données). Une importation est faite d'un nombre quelconque d'objets task.

source: A **data** is the description of the source data of a import (overall) or a task. In case the import has a global data definition, this normally refers to an aggregate store such as a directory or a database, and the data associated to the tasks refers to a single element inside such aggregation, such as a single file or table.
fr: A **données** est la description des données sources d'une importation (hors tout) ou une tâche. Dans le cas où l'importation a une définition globale des données, cela se réfère normalement à un magasin d'agrégation comme un répertoire ou une base de données et les données associées aux tâches se réfèrent à un seul élément à l'intérieur de cette agrégation, comme un seul fichier ou la table.

source: A **task** represents a unit of work to the importer needed to register one new layer, or alter an existing one, and contains the following information:
fr: A **tâche** représente une unité de travail à l'importateur qui a besoin d' enregistrer une nouvelle couche, ou modifier une déjà existante et contient les informations suivantes :

source: The data being imported
fr: Les données importées

source: The target store that is the destination of the import
fr: L'objectif de stocker qui est la destination de l'importation

source: The target layer
fr: Le calque cible

source: The data of a task, referred to as its source, is the data to be processed as part of the task.
fr: Les données d'une tâche, dénommée sa source, sont les données à traiter dans le cadre de la tâche.

source: The transformations that we need to apply to the data before it gets imported
fr: Les transformations que nous devons appliquer aux données avant elle, sont importées dedans

source: This data comes in a variety of forms including:
fr: Ces données proviennent de diverses formes, y compris :

source: A spatial file (Shapefile, GeoTiff, KML, etc...)
fr: Un fichier spatial (Shapefile, GeoTiff, KML, etc....)

source: A directory of spatial files
fr: Un répertoire de fichiers spatiales

source: A table in a spatial database
fr: Une table dans une base de données spatiales

source: A remote location that the server will download data from
fr: Un emplacement distant que le serveur va télécharger à partir des données

source: A task is classified as either "direct" or "indirect". A *direct task* is one in which the data being imported requires no transformation to be imported. It is imported directly. An example of such a task is one that involves simply importing an existing Shapefile as is. An *indirect task* is one that does require a **transformation** to the original import data. An example of an indirect task is one that involves importing a Shapefile into an existing PostGIS database. Another example of indirect task might involve taking a CSV file as an input, turning a x and y column into a Point, remapping a string column into a timestamp, and finally import the result into a PostGIS.
fr: Une tâche est classé comme "directe" ou "indirecte". Une *tâche directe* est celle dans laquelle les données importées ne nécessitent pas de transformation . Elle est importée directement. Un exemple d'une telle tâche est celle qui consiste simplement à importer un Shapefile existantt. Une *tâche indirecte* est une qui ne nécessite qu' une **transformation** aux données originales d'importation. Un exemple d'une tâche indirecte est celui qui consiste à importer un fichier de formes dans une base de données PostGIS existant. Un autre exemple de la tâche indirecte pourrait impliquer de prendre un fichier CSV comme une entrée, tourner hache et y colonne dans un point, à reconfigurer une colonne de chaîne dans un timestamp, et enfin importer le résultat dans un PostGIS.

source: REST API Reference
fr: Référence de l'API REST

source: All the imports
fr: Toutes les importations

source: Method
fr: ﻿Méthode

source: Status Code/Headers
fr: Code de statut/en-têtes

source: Input
fr: Entrée

source: Parameters
fr: Paramètres

source: Retrieve all imports
fr: Récupérer toutes les importations

source: Create a new import
fr: Créer une nouvelle importation

source: Retrieving the list of all imports
fr: Récupération de la liste de toutes les importations

source: results in::
fr: nous obtenons

source: Creating a new import
fr: Création d'une nouvelle importation

source: Posting to the /imports path a import json object creates a new import session::
fr: Afficher le chemin d'accès /imports un objet json d'importation qui crée une nouvelle session d'importation::

source: The parameters are:
fr: Les paramètres sont :

source: Name
fr: Nom

source: Optional
fr: Facultatif

source: The target workspace to import to
fr: Le workspace cible pour importer dans

source: The target store to import to
fr: Le magasin target pour importer dans

source: The data to be imported
fr: Les données à importer

source: The mere creation does not start the import, but it may automatically populate its tasks depending on the target. For example, by referring a directory of shapefiles to be importer, the creation will automatically fill in a task to import each of the shapefiles as a new layer.
fr: La simple création ne démarre pas l'importation, mais elle peut remplir automatiquement ses tâches en fonction de la cible. Par exemple, en faisant référence à un répertoire des shapefiles importateur, la création se remplit automatiquement à une tâche pour importer chaque shapefiles comme un nouveau calque.

source: The response to the above POST request will be::
fr: La réponse à la requête POST ci-dessus sera::

source: The operation of populating the tasks can require time, especially if done against a large set of files, or against a "remote" data (more on this later), in this case the POST request can include ``?async=true`` at the end of the URL to make the importer run it asynchronously. In this case the import will be created in INIT state and will remain in such state until all the data transfer and task creation operations are completed. In case of failure to fetch data the import will immediately stop, the state will switch to the ``INIT_ERROR`` state, and a error message will appear in the import context "message" field.
fr: L'opération de remplissage des tâches peut nécessiter du temps, surtout si elle se fait contre un grand nombre de fichiers, ou contre une donnée "à distance" (voir plus loin), dans ce cas, la requête POST peut inclure ``?async=true`` à la fin de l'URL pour faire de l'importateur exécuté de façon asynchrone. Dans ce cas, l'importation sera créé à l'état INIT et restera dans cet état jusqu'à ce que toutes les opérations de transfert de données et de création de tâches soient terminées. En cas d'échec pour récupérer les données de l'importation cela sera cesser immédiatement, l'Etat va passer à la état ``INIT_ERROR``, et un message d'erreur apparaîtra dans le contexte de l'importation "message" domaine

source: Import object
fr: Objet d'importation

source: Retrieve import with id <importId>
fr: Récupérer l'importation avec id <importId>

source: Execute import with id <importId>
fr: Exécuter l'import avec id <importId>

source: Create import with proposed id <importId>. If the proposed id is ahead of the current (next) id, the current id will be advanced. If the proposed id is less than or equal to the current id, the current will be used. This allows an external system to dictate the id management.
fr: Création d'importation ayant proposé id <importId>. Si l'id de projet devance le courant id (prochain), le code sera avancé. Si l'id proposé est inférieur ou égal à l'id courant, le courant servira. Cela permet à un système externe de dicter la gestion id.

source: Remove import with id <importId>
fr: Supprimer l'importation avec id <importId>

source: The representation of a import is the same as the one contained in the import creation response. The execution of a import can be a long task, as such, it's possible to add ``async=true`` to the request to make it run in a asynchronous fashion, the client will have to poll the import representation and check when it reaches the "COMPLETE" state.
fr: La représentation d'une importation est identique à celle contenue dans la réponse de création des importations. L'exécution d'une importation peut être une tâche longue, à ce titre, il est possible d'ajouter ``async=true`` à la demande pour le faire fonctionner de façon asynchrone, le client devra interroger la représentation importation et vérifier quand il atteint l'État "COMPLETE".

source: Data
fr: Données

source: A import can have a "data" representing the source of the data to be imported. The data can be of different types, in particular, "file", "directory", "mosaic", "database" and "remote". During the import initialization the importer will scan the contents of said resource, and generate import tasks for each data found in it.
fr: Une importation peut avoir une "données" qui représente la source de données à importer. Les données peuvent être de différents types, en particulier, "fichier", "répertoire", "mosaïque", "database" et "à distance". Lors de l'initialisation de l'importation, l'importateur fera analyser le contenu de ladite ressource et générer des tâches d'importation pour chaque donnée trouvée dedans.

source: Most data types are discussed in the task section, the only type that's specific to the whole import context is the "remote" one, that is used to ask the importer to fetch the data from a remote location autonomusly, without asking the client to perform an upload.
fr: La plupart des types de données sont discutées dans la section de la tâche, le seul type qui est spécifique au contexte toute importation est le "remote", qui est utilisée pour demander à l'importateur de récupérer les données depuis un emplacement distant autonome, sans demander au client d'effectuer un téléchargement.

source: The representation of a remote resource looks as follows::
fr: La représentation d'une ressource distante se présente comme suit::

source: The location can be `any URI supported by Commons VFS <http://commons.apache.org/proper/commons-vfs/filesystems.html>`_, including HTTP and FTP servers. The ``username``, ``password`` and ``domain`` elements are all optional, and required only if the remote server demands an authentication of sorts. In case the referred file is compressed, it will be unpacked as the download completes, and the tasks will be created over the result of unpacking.
fr: L'emplacement peut être n'`importe laquelle URI pris en charge par les communes de VFS <http://commons.apache.org/proper/commons-vfs/filesystems.html>`_, y compris les serveurs HTTP et FTP. Le ``nom d'utilisateur`` , ``mot de passe`` et ``domaine`` éléments sont facultatifs et servent uniquement si le serveur distant demande une authentification de toutes sortes. Dans le cas où le fichier visé est compressé, il sera déballé car le téléchargement est terminé, et les tâches seront créés sur le résultat de déballage.

source: Retrieve all tasks for import with id <importId>
fr: Récupérer toutes les tâches d'importation avec l'id <importId>

source: Create a new task
fr: Créez une nouvelle tâche.

source: Getting the list of tasks
fr: Obtention de la liste des tâches

source: Results in::
fr: nous obtenons

source: Creating a new task as a file upload
fr: Créer une nouvelle tâche dans le chargement d'un fichier

source: A new task can be created by issuing a POST to ``imports/<importId>/tasks`` as a "Content-type: multipart/form-data" multipart encoded data as defined by `RFC 2388 <https://www.ietf.org/rfc/rfc2388.txt>`_. One or more file can be uploaded this way, and a task will be created for importing them. In case the file being uploaded is a zip file, it will be unzipped on the server side and treated as a directory of files.
fr: Une nouvelle tâche peut être créée par l'émission d'un POST à ``imports/<importId>/tasks`` comme un "Content-type: multipart/form-data" données codées multipart tel que défini par `RFC 2388 <https://www.ietf.org/rfc/rfc2388.txt>`_. Un ou plusieurs fichier peut être téléchargé de cette façon, et une tâche sera créée pour les importer. Dans le cas où le fichier en cours de téléchargement est un fichier zip, il sera décompressé sur le côté serveur et traitée comme un répertoire de fichiers.

source: The response to the upload will be the creation of a new task, for example::
fr: La réponse à l'upload sera la création d'une nouvelle tâche, par exemple::

source: Creating a new task from form upload
fr: Création d'une tâche de téléchargement du formulaire

source: This creation mode assumes the POST to ``imports/<importId>/tasks`` of form url encoded data containing a ``url`` parameter::
fr: Ce mode de création assume le poste de ``imports/<importId>/tasks`` de forme url codée des données contenant un paramètre ``url``::

source: The creation response will be the same as the multipart upload.
fr: La réponse de création sera le même que le téléchargement en plusieurs partie.

source: Single task resource
fr: Ressource de tâche du seul

source: /imports/<importId>/task/<taskId>
fr: L'emplacement peut être n'`importe quelle URI prise en charge par les communes de VFS <http://commons.apache.org/proper/commons-vfs/filesystems.html>`_, y compris les serveurs HTTP et FTP. Le ``nom d'utilisateur`` , ``mot de passe`` et ``domaine`` éléments sont facultatifs et servent uniquement si le serveur distant demande une authentification de toutes sortes. Dans le cas où le fichier visé est compressé, il sera déballé car le téléchargement est terminé, et les tâches seront créés sur le résultat de déballage.

source: Retrieve task with id <taskId> within import with id <importId>
fr: Récupérer la tâche avec l'id <taskId> importation avec l'id <importId>

source: Modify task with id <taskId> within import with id <importId>
fr: Modifier la tâche avec l'id <taskId> importation avec l'id <importId>

source: Remove task with id <taskId> within import with id <importId>
fr: Supprimer la tâche avec l'id <taskId> importation avec l'id <importId>

source: The representation of a task resource is the same one reported in the task creation response.
fr: La représentation d'une ressource de tâche est la même mentionnées dans la réponse de création de tâche.

source: Updating a task
fr: Mise à jour d'une tâche

source: A PUT request over an existing task can be used to update its representation. The representation can be partial, and just contains the elements that need to be updated.
fr: Une requête PUT sur une tâche existante peut être utilisée pour mettre à jour sa représentation. La représentation peut être partielle et ne contient que les éléments qui doivent être mis à jour.

source: The updateMode of a task normally starts as "CREATE", that is, create the target resource if missing. Other possible values are "REPLACE", that is, delete the existing features in the target layer and replace them with the task source ones, or "APPEND", to just add the features from the task source into an existing layer.
fr: L'updateMode d'une tâche démarre normalement qu'avec "Créer", c'est-à-dire crée la ressource cible s'il manque. Les autres valeurs possibles sont "Remplacer", c'est-à-dire supprimer les fonctionnalités existantes dans le calque cible et remplacer les avec la source de la tâche , ou "APPEND", d'ajouter les fonctionnalités de la source de la tâche dans un calque existant.

source: The following PUT request updates a task from "CREATE" to "APPEND" mode::
fr: La demande PUT suivante met à jour une tâche de "Création" au mode "APPEND"::

source: Directory files representation
fr: Représentation de fichiers de répertoire

source: The following operations are specific to data objects of type ``directory``.
fr: Les opérations suivantes sont spécifiques aux objets de données de type ``répertoire``.

source: Retrieve the list of files for a task with id <taskId> within import with id <importId>
fr: Récupérer la liste des fichiers pour une tâche avec l'id <taskId> importation avec l'id <importId>

source: The response to a GET request will be::
fr: La réponse à une demande GET sera::

source: Retrieve the file with id <fileId> from the data of a task with id <taskId> within import with id <importId>
fr: Récupérer le fichier avec l'id <fileId> à partir des données d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: Remove a specific file from the task with id <taskId> within import with id <importId>
fr: Supprimer un fichier spécifique de la tâche avec l'id <taskId> importation avec l'id <importId>

source: Following the links we'll get to the representation of a single file, notice how in this case a main file can be associate to sidecar files::
fr: En suivant le lien pour arriver à la représentation d'un seul fichier, Notez comment dans ce cas un fichier principal peut être associé aux fichiers sidecar::

source: Mosaic extensions
fr: Extensions de mosaïque

source: In case the input data is of ``mosaic`` type, we have all the attributes typical of a directory, plus support for directly specifying the timestamp of a particular granule.
fr: Dans le cas où les données d'entrée sont de type ``mosaïque``, nous avons tous les attributs typiques d'un répertoire, plus support pour spécifier directement l'horodatage d'un granule particulière.

source: In order to specify the timestamp a PUT request can be issued against the granule::
fr: Afin de préciser l'horodatage d'une option de vente une PUT demande peut être émise contre le granule::

source: and the response will be::
fr: et la réponse sera::

source: Database data
fr: Vos données en base de données

source: The following operations are specific to data objects of type ``database``. At the time or writing, the REST API does not allow the creation of a database data source, but it can provide a read only description of one that has been created using the GUI.
fr: Les opérations suivantes sont spécifiques aux objets de données de type ``database``. À l'heure ou l'écriture, l'API REST n'autorise pas la création d'une source de données de base de données, mais il peut fournir une description lecture seule de celui qui a été créé à l'aide de l'interface graphique.

source: Retrieve the database connection parameters for a task with id <taskId> within import with id <importId>
fr: Récupérer les paramètres de connexion de base de données pour une tâche avec l'id <taskId> importation avec l'id <importId>

source: List of database connection parameters and available tables
fr: Liste des paramètres de connexion de base de données et tables disponibles

source: Performing a GET on a database type data will result in the following response::
fr: Effectuant un GET sur une base de données de type, entraînera la réponse suivante::

source: Database table
fr: Table de base de données

source: The following operations are specific to data objects of type ``table``. At the time or writing, the REST API does not allow the creation of a database data source, but it can provide a read only description of one that has been created using the GUI. A table description is normally linked to task, and refers to a database data linked to the overall import.
fr: Les opérations suivantes sont spécifiques aux objets de données de type ``tableau``. À l'heure ou l'écriture, l'API REST n'autorise pas la création d'une source de données de base de données, mais il peut fournir une description lecture seule de celui qui a été créé à l'aide de l'interface graphique. Une description de la table est normalement liée à la tâche et se réfère à une base de données liée à l'importation globale.

source: Retrieve the table description for a task with id <taskId> within import with id <importId>
fr: Récupérer la description de la table pour une tâche avec l'id <taskId> importation avec l'id <importId>

source: A table representation
fr: Une table de représentation

source: Task target layer
fr: Calque cible opérationnelle

source: The layer defines how the target layer will be created
fr: La couche définit comment le calque cible sera créé

source: Retrieve the layer of a task with id <taskId> within import with id <importId>
fr: Récupérer la couche d'une tâche avec l'id <taskId> importation avec l'id <importId>

source: A layer JSON representation
fr: Une couche de représentation JSON

source: Modify the target layer for a task with id <taskId> within import with id <importId>
fr: Modifier le calque cible pour une tâche avec l'id <taskId> importation avec l'id <importId>

source: Requesting the task layer will result in the following::
fr: Demander la couche spéciale se traduira par ce qui suit::

source: All the above attributes can be updated using a PUT request. Even if the above representation is similar to the REST config API, it should not be confused with it, as it does not support all the same properties, in particular the supported properties are all the ones listed above.
fr: Tous les attributs ci-dessus peuvent être mis à jour à l'aide d'une requête PUT. Même si la représentation ci-dessus est similaire à la config reste API, il ne faut pas le confondre avec lui, car il ne supporte pas toutes les mêmes propriétés, en particulier les propriétés prises en charge sont toutes celles énumérées ci-dessus.
