Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: The following instead instructs the mosaic to harvest a single :download:`polyphemus_20120401.nc` file into the mosaic, collecting its properties and updating the mosaic index:
fr: Ce qui suit indique plutôt à la mosaïque de récolter un seul :download:`polyphemus_20120401.nc` file dans la mosaïque, la collecte de ses propriétés et mise à jour de l'index de la mosaïque :

source: Once done you can get the list of coverages/granules available on that store.
fr: Une fois fait, vous pouvez obtenir la liste des couvertures/granules disponibles sur ce magasin.

source: Next step is configuring ONCE for coverage (as an instance NO2), an available coverage.
fr: L'étape suivante consiste à configurer une fois pour la couverture (comme NO2 exemple), une couverture disponible.

source: Where coverageconfig.xml may look like this
fr: Où coverageconfig.xml peut ressembler à ceci

source: When specifying only the coverage name, the coverage will be automatically configured
fr: Lorsque vous spécifiez uniquement le nom de la couverture, la couverture sera automatiquement configurée

source: Master Password Change
fr: Changement de mot de passe maître

source: The master password can be fetched wit a GET request.
fr: Le mot de passe peut être récupérés de wit une demande GET.

source: A generated master password may be **-"}3a^Kh**. Next step is creating an XML file.
fr: Un mot de passe maître généré peut être **-"}3a^Kh**. Prochaine étape consiste à créer un fichier XML.

source: File changes.xml
fr: Fichier changes.xml

source: Changing the master password using the file:
fr: Changer le mot de passe en utilisant le fichier :

source: REST configuration examples
fr: Exemples de configuration REST

source: This section contains a number of examples which illustrate various uses of the :ref:`REST configuration API <rest_api>`. The examples are grouped by the language or environment used.
fr: Cette section contient un certain nombre d'exemples qui illustrent les diverses utilisations de la :ref:`REST configuration API <rest_api>`. Les exemples sont regroupés par la langue ou l'environnement utilisé.

source: We are looking for volunteers to flesh out this section with examples.
fr: Nous recherchons des bénévoles pour étoffer cette section avec des exemples.

source: In the meantime, anyone looking to do Java scripting of the GeoServer REST API should use `GeoServer Manager <https://github.com/geosolutions-it/geoserver-manager/wiki/>`_, a REST client library with minimal dependencies on external libraries.
fr: En attendant, ceux qui cherchent à faire Java script de l'API REST de GeoServer devrait utiliser `GeoServer Manager <https://github.com/geosolutions-it/geoserver-manager/wiki/>`_, une bibliothèque client REST minimales dépendances vis-à-vis des bibliothèques externes.

source: Another option is `gsrcj <http://code.google.com/p/gsrcj/>`_. This project is a GeoServer REST client written in Java with no extra dependencies on GeoServer/GeoTools, unlike the standard GeoServer REST module. The project has minimal documentation, but does include a `Quickstart <http://code.google.com/p/gsrcj/wiki/Quickstart>`_.
fr: Une autre option est `gsrcj <http://code.google.com/p/gsrcj/>`_. Ce projet est un client de GeoServer qui reste écrit en Java sans dépendances supplémentaires sur GeoServer/GeoTools, contrairement au module de GeoServer qui reste standard. Le projet a une documentation minimale, mais comprend un `Quickstart <http://code.google.com/p/gsrcj/wiki/Quickstart>`_.

source: The examples in this section use the server-side scripting language `PHP <http://php.net/index.php/>`_, a popular language for dynamic webpages. PHP has `cURL functions <http://php.net/manual/en/ref.curl.php/>`_ , as well as `XML functions <http://www.php.net/manual/en/refs.xml.php/>`_, making it a convenient method for performing batch processing through the Geoserver REST interface. The following scripts execute single requests, but can be easily modified with looping structures to perform batch processing.
fr: Les exemples de cette section utilisent le langage de script côté serveur `PHP <http://php.net/index.php/>`_, une langue populaire pour les pages Web dynamiques. PHP a `fonctions cURL <http://php.net/manual/en/ref.curl.php/>`_, ainsi que des fonctions `XML <http://www.php.net/manual/en/refs.xml.php/>`_, ce qui en fait une méthode pratique pour effectuer un traitement par lots via l'interface REST Geoserver. Les scripts suivants vont exécuter des demandes individuelles, mais peuvent être facilement modifiés avec une boucle afin d'effectuer un traitement par lots.

source: In order to execute the examples just copy the script content into a ``test.php`` file and execute the following command:
fr: Afin d'exécuter l'exemples il suffit de copier le script contenu dans un fichier ``test.php`` et exécutez la commande suivante :

source: POST with PHP/cURL
fr: POST avec PHP et cURL

source: The following script attempts to add a new workspace.
fr: Le script suivant tente d'ajouter un nouveau workspace.

source: The logfile should look something like::
fr: Le fichier journal doit ressembler à::

source: If the cURL request fails, a code other than 201 will be returned. Here are some possible values:
fr: Si la demande de cURL échoue, un autre code que 201 sera retourné. Voici quelques valeurs possibles :

source: Meaning
fr: Signification

source: Couldn't resolve host; possibly a typo in host name
fr: Si vous ne pouvait pas résoudre hôte ; peut-être une faute de frappe dans le nom d'hôte

source: Successful POST
fr: POST avec succès

source: Redirect; possibly a typo in the URL
fr: Procédure de redirection ; peut-être une faute de frappe dans l'URL

source: Invalid username or password
fr: Nom d'utilisateur ou mot de passe incorrect

source: Method not Allowed: check request syntax
fr: Méthode non autorisée : vérifier la syntaxe de requête

source: Geoserver is unable to process the request, e.g. the workspace already exists, the xml is malformed, ...
fr: GeoServer est incapable de traiter la requête, par exemple le workspace existe déjà, le fichier xml est incorrect...

source: For other codes see `cURL Error Codes <http://curl.haxx.se/libcurl/c/libcurl-errors.html>`_ and `HTTP Codes <http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html>`_.
fr: Pour voir d'autres codes , `cURL Codes d'erreur <http://curl.haxx.se/libcurl/c/libcurl-errors.html>`_ et `Codes HTTP <http://www.w3.org/Protocols/rfc2616/rfc2616-sec10.html>`_.

source: GET with PHP/cURL
fr: GET avec PHP et cURL

source: The script above can be modified to perform a GET request to obtain the names of all workspaces by replacing the code blocks for required settings, data and return code with the following:
fr: Le script ci-dessus peut être modifié pour effectuer une requête GET pour obtenir les noms de tous les espaces de travail en remplaçant les blocs de code pour les paramètres requis, code données et retour par le texte suivant :

source: The logfile should now include lines like::
fr: Le fichier journal doit maintenant inclure des lignes comme::

source: DELETE with PHP/cURL
fr: DELETE avec PHP et cURL

source: To delete the (empty) workspace we just created, the script is modified as follows:
fr: Pour supprimer le workspace (vide), que nous venons de créer, le script est modifié comme suit :

source: The log file will include lines like::
fr: Le fichier journal comprendra des lignes comme::

source: In the meantime, anyone looking to do python scripting of the GeoServer REST config API should use `gsconfig.py <https://github.com/dwins/gsconfig.py/wiki>`_. It is quite capable, and is used in production as part of `GeoNode <http://geonode.org>`_, so examples can be found in that codebase. Documentation and examples can be found at the section :ref:`geonode_lib_apis`.
fr: En attendant, ceux qui cherchent à faire python scripting du reste GeoServer config API doit utiliser `gsconfig.py <https://github.com/dwins/gsconfig.py/wiki>`_. Il est tout à fait capable et est utilisé en production dans le cadre de `GeoNode <http://geonode.org>`_, alors on trouvera des exemples dans ce code. Documentation et exemples se trouvent à la section :ref:`geonode_lib_apis`.

source: The examples in this section use `rest-client <http://github.com/archiloque/rest-client>`_, a REST client for Ruby. There is also a project to create a GeoServer-specific REST client in Ruby: `RGeoServer <https://github.com/rnz0/rgeoserver>`_.
fr: Les exemples de cette section utilisent `rest-client <http://github.com/archiloque/rest-client>`_, un client REST pour Ruby. Il y a aussi un projet visant à créer un client OpenLayers spécifique reste en Ruby: `RGeoServer <https://github.com/rnz0/rgeoserver>`_.

source: Once installed on a system, ``rest-client`` can be included in a Ruby script by adding ``require 'rest-client'``.
fr: Une fois installé sur un système, ``rest-client`` peut être inclus dans un script Ruby en ajoutant ``require 'rest-client'``.

source: GET and PUT Settings
fr: les paramètres GET et PUT

source: In order to execute the example just copy the script content into a ``test.ruby`` file and execute the following command:
fr: Pour exécuter l' exemple copie le script contenu dans un fichier ``test.ruby`` et exécutez la commande suivante :

source: This example shows how to read the settings using GET, make a change and then use PUT to write the change to the server.
fr: Cet exemple montre comment lire les paramètres en utilisant GET, apporter une modification et ensuite utiliser PUT pour écrire la modification sur le serveur.

source: Create and Prepare the *nyc* Example DataBase
fr: Créer et préparer le *nyc* exemple base de données

source: This small section contains a step-by-step guide for the creation and population of an database containing few geospatial tables of New York City:
fr: Cette petite section contient un guide étape par étape pour la création et le remplissage d'une base de données contenant quelques tables géospatiales de New York City :

source: Log as *postgres* system user
fr: Ouvrez une session sous système utilisateur *postgres*

source: Create the role **bob** with password *postgres*
fr: Créer le rôle **bob** avec mot de passe *postgres*

source: Create the database **nyc** with the geospatial extensions
fr: Créer la base de données **nyc** avec les extensions de geospatial

source: Restore the tables into the database from the :download:`dump <resources/nyc.dump>`
fr: Restaurer les tables dans la base de données à partir de la :download:`dump <resources/nyc.dump>`

source: Test that everything is ok by connecting to the database and listing the tables
fr: Testez que tout est ok en vous connectant à la base de données listant les tables

source: Introducing REST concepts
fr: Introduisant des concepts REST

source: REST (REpresentational State Transfer) is a simple approach to web services strongly based on the basic HTTP infrastructure, such as URLs, HTTP methods and HTTP response codes.
fr: REST (REpresentational State Transfer) est une approche simple de web services fortement basée sur l'infrastructure de base HTTP, telles que des URL, les méthodes HTTP et les codes de réponse HTTP.

source: The basic elements of a REST service are:
fr: Les éléments de base d'un service REST sont :

source: **Resource**: each business entity is linked to a unique URL that represents it, and allows for its retrieval and eventual modification. In GeoServer such resources are layers, stores, styles and so on
fr: **Ressources**: chaque entité commerciale est liée à une URL unique qui le représente et permet son extraction et modification éventuelle. Dans GeoServer, ces ressources sont des couches, des magasins, des styles

source: **Connectedness**: the various resources are linked to one another following significant relationships. For example, in GeoServer a store contains a list of feature types or coverages, a layer is linked to a style and a feature type/coverage, and so on (in other terms, the set of resources is supposed to be crawable just like a web site).
fr: **Connectivité**: les différentes ressources sont liées l' un à l'autre après des relations significatives. Par exemple, dans GeoServer un magasin contient une liste des types de fonctions ou de couvertures, une couche est liée à un style et une fonctionnalité type/couverture et ainsi de suite (en d'autres termes, l'ensemble des ressources est censé pour être crawable comme un site web).

source: **Representation**: each resource can be represented in one or more way. For example in GeoServer resources are normally represented as HTML, XML and JSON.
fr: **Représentation**: chaque ressource peut être représentée d' une ou plusieurs maniére. Par exemple dans GeoServer,les ressources sont normalement représentées comme HTML, XML et JSON.

source: **Stateless-ness**: each communication with the server is atomic and not related to the communications happened before or after it. Whatever state needs to be managed needs to be stored as a publicly accessible resource.
fr: **Stateless-ness**: chaque communication avec le serveur est atomique et non liées à la communication qui s'est passée avant ou après elle. N'importe quel État doit être géré et stocké comme une ressource accessible au public.

source: **HTTP methods reuse**: each resource is manipulated via the common HTTP methods each having a common meaning, summarized by the following table
fr: **Réutilisation des méthodes HTTP**: chaque ressource est manipulée via les méthodes HTTP communes ayant chacune une signification commune, résumée par le tableau suivant

source: **Method**
fr: **﻿Méthode**

source: Retrieves the resource in the specified representation. Query parameters are often used to filter the contents of the returned resource, and sometimes to specify the desired representation format.
fr: Récupère la ressource dans la représentation spécifiée.Les paramètres de requête sont souvent utilisés pour filtrer le contenu de la ressource retournée et parfois pour spécifier le format de la représentation désirée.

source: Similar to GET, but instead of returning the full response it returns only the HTTP headers, which might contain information such as the last modification date of the resource
fr: Similaire à GET, mais au lieu de renvoyer la réponse complète elle retourne uniquement les en-têtes HTTP, qui peuvent contenir des informations telles que la date de dernière modification de la ressource

source: Stores the representation of a resource at a given URL. Used when the client already knows what the final URL of the resource will be
fr: Stocke la représentation d'une ressource à une URL donnée. Utilisé lorsque le client sait déjà ce qui sera la dernière URL de la ressource

source: Creates a new resource by either getting its contents in the request, or having some parameters to compute it. The main different is that the final URL of the created resource is not known to the client, and is returned by the server after creation via a redirect. It is also used to have the server perform certain actions that cannot be encoded as another method, for example, have it send a SMS (assuming creating a resource representing the SMS is not desirable)
fr: Crée une nouvelle ressource en obtenant son contenu dans la demande ou en ayant des paramètres pour le calculer. La principale différence est que la dernière URL de la ressource créée n'est pas connue pour le client et est retournée par le serveur après la création via une redirection. Il est également utilisé pour que le serveur execute certaines actions qui ne peuvent pas être codées comme une autre méthode. Par exemple, il ont envoyé un SMS (en supposant la création d'une ressource qui représente le SMS qui n'est pas souhaitable)

source: Destroys the specified resource.
fr: Détruit la ressource spécifiée.

source: The above results in a web services protocols that is easy to understand, implement and connect to from various languages, and with good scalability characteristics.
fr: Les résultats sont ci-dessus dans un protocoles de services web, ce qui est facile à comprendre, mettre en œuvre et se connecter à de diverses langues et présentant des caractéristiques de bonne évolutivité.

source: The GeoServer rest interface is located at ``http://localhost:8083/geoserver/rest``, by default a browser will show resources in HTML format allowing for a simple browsable interface to the GeoServer configuration.
fr: L'interface rest de GeoServer est situé au ``http://localhost:8083/geoserver/rest``, par défaut qu'un navigateur affichera les ressources au format HTML, ce qui permet une interface simple accessible directement à la configuration de GeoServer.

source: Browsing the REST interface with HTML format
fr: La navigation de l'interface REST avec format HTML

source: Follow the links into ``workspaces`` and then ``geosolutions`` and switch the format from ``.html`` to ``xml`` to see the XML representation:
fr: Suivez les liens dans les espaces de ``workspaces``, puis ``geosolutions`` et changer le format de ``.html`` à ``.xml`` pour voir la représentation XML :

source: The GeoSolutions workspace represented as XML
fr: L'espace de workspace GeoSolutions représenté sous la forme XML

source: GeoServer REST interface
fr: Interface REST GeoServer

source: This module is a walkthrough the GeoServer REST capabilities and APIs. Here also will be presented and deeply inspected several methods and frameworks to handle with REST APIs and functions.
fr: Ce module est une procédure pas à pas des capacités de Geonode REST de de ses API . Ici aussi nous présenterons et inspecterons plusieurs méthodes et cadres à gérer avec l'API REST et fonctions.

source: **What you will learn**
fr: **Ce que vous aller apprendre**

source: In this section you will learn:
fr: Dans cette section, vous apprendrez ce qui suit :

source: Using REST module
fr: Utilisation du module REST

source: This section contains a number of examples which illustrate various uses of the REST data configuration api.
fr: Cette section contient un certain nombre d'exemples qui illustrent différentes utilisations de l'API de configuration de données REST.

source: The GeoServer REST configuration module uses the REST principles to expose services allowing to edit the catalog, in particular to manage workspaces, stores, layers, styles and groups.
fr: Le module de configuration de GeoServer REST utilise les principes REST pour exposer des services permettant de modifier le catalogue, en particulier pour gérer les espaces de travail, de magasins, de couches, de styles et de groupes.

source: The REST configuration extension has normally to be installed separately, it is not come out of the box.
fr: L'extension de configuration REST doit normalement être installé séparément, il n'est pas sorti de la boîte.

source: The examples in this section use the `cURL <http://curl.haxx.se/>`_ utility, which is a handy command line tool for executing HTTP requests and transferring files.
fr: Les exemples de cette section utilisent le `cURL <http://curl.haxx.se/>`_ utilitaire, qui est un outil de ligne de commande très pratique pour l'exécution des requêtes HTTP et de transfert de fichiers.

source: Open the Terminal and enter the following command::
fr: Ouvrez le Terminal et entrez la commande suivante::

source: the response should contains the following:
fr: la réponse contient les éléments suivants :

source: Create a new workspace via REST
fr: Créer un nouvel workspace via REST

source: Go to the ``Workspaces`` section via Web interface to show the new workspace created
fr: Allez dans la section ``Workspaces`` via l'interface Web pour montrer le nouvel workspace créé

source: GET request to abtain new workspace details
fr: GET demande de nouveaux détails du workspace

source: Get the new created workspace details entering the following::
fr: Obtenez les nouveaux détails de workspace entrant ce qui suit::

source: GET request to obtain new workspace details
fr: Demande GET pour obtenir de nouveaux détails d'workspace

source: Publish the shapefile :download:`pointlands <resources/pointlands.zip>` using the ``myworkspace`` workspace entering the following
fr: Publier le shapefile :download:`pointlands <resources/pointlands.zip>` à l'aide du workspace ``myworkspace`` entrant ce qui suit

source: Go to the **Layer Preview** to show the layers in a OpenLayers Map.
fr: Aller à la **Couche Preview** pour montrer les couches dans une carte OpenLayers.

source: Showing the new layer created
fr: Montrant la nouvelle couche créé

source: The new layers created
fr: Les nouvelles couches créés

source: If you previously followed the security portion of the workshop the layer won't be accessible because the administrator does not have the required roles. Go back in the service security section and remove the rule limiting the GetMap requests.
fr: Si vous avez déjà suivi le passage de la sécurité de l'atelier , la couche ne sera pas accessible car l'administrateur n'a pas les rôles. Retournez dans la section sécurité de service et supprimer la règle limitant les requêtes GetMap.

source: Retrieves the created data store as XML entering the following::
fr: Récupère le magasin de données créé au format XML entrant ce qui suit::

source: By default when a shapefile is uploaded a feature type resource and the associated layer are automatically created.
fr: Par défaut lorsqu'un shapefile est téléchargé une ressource de type de fonction et la couche associée sont automatiquement créés.

source: Retrieve the layer as XML entering the following::
fr: Récupérer la couche comme XML entrant ce qui suit::

source: When the layer is created a default style named ``point`` is assigned to it.
fr: Lorsque le calque est créé un style par défaut nommé ``point`` est attribué à lui.

source: Create a new style named ``landmarks`` with the following SLD (using the GeoServer Admin UI):
fr: Créer un nouveau style appelé ``landmarks`` avec le SLD suivant (à l'aide de l'interface utilisateur Admin de GeoServer) :

source: Apply the existing ``landmarks`` style to the layer created ``myworkspace:pointlands`` (this operation does not overwrite the entire layer definition, updates it instead)::
fr: Appliquer le style de ``landmarks`` existant à la couche créée ``myworkspace:pointlands`` (cette opération n'écrase pas la définition de l'ensemble de la couche,la met à jour à plutot)::

source: Go to the **Layer Preview** to show the layers with the new ``landmarks`` style.
fr: Aller à la **Couche Preview** pour montrer les couches avec le nouveau style ``landmarks``.

source: Viewing the layers with the new created style ``landmarks``
fr: Affichage des couches avec le nouveau style créé ``landmarks``

source: Supported data formats
fr: Formats de données pris en charge

source: The importer supports any format that GeoServer can use a data store or coverage store. These include the most commonly used formats:
fr: L'importateur supporte n'importe quel format que GeoServer peut utiliser, un magasin de données ou un magasin de couverture. Ceux-ci incluent les formats les plus couramment utilisés :

source: And a few additional formats:
fr: Et quelques autres formats :

source: The following databases are supported:
fr: Les bases de données suivantes sont prise en charge :

source: Oracle and SQL Server require extra drivers to be installed.
fr: Oracle et SQL Server requièrent des pilotes supplémentaires à installer.

source: Importer interface reference
fr: Référence de l'interface importateur
