Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: To run a single case (or drop the method name to run the whole class)::
fr: Pour exécuter un seul cas (ou laisser tomber le nom de la méthode à exécuter l'ensemble de la classe)::

source: GeoNode's Ad-Hoc API
fr: Ad Hoc API de GeoNode

source: The examples in this section use `cURL <http://curl.haxx.se/>`_, a command line tool for executing HTTP requests and transferring files, to generate requests to GeoServer's REST interface. Although the examples are based on cURL, they could be adapted for any HTTP-capable tool or library. Please be aware, that cURL acts not entirely the same as a web-browser. In contrast to Mozilla Firefox or Google Chrome cURL will not escape special characters in your request-string automatically. To make sure, that your requests can be processed correctly, make sure, that characters like paranthesis, commas and the like are escaped before sending them via cURL. If you use libcurl in PHP 5.5 or newer you can prepare the url-string using the function curl_escape. In older versions of PHP hmlspecialchars should do the job also.
fr: Les exemples de cette section utilisent `cURL <http://curl.haxx.se/>`_, un outil de ligne de commande pour exécuter des requêtes HTTP et le transfert de fichiers, de générer des demandes à l'interface REST de GeoServer. Bien que les exemples sont basés sur cURL, ils pourraient être adaptés pour tout outil ou de la bibliothèque HTTP capable. S'il vous plaît soyez conscient que cURL n'agit pas pareil qu'un navigateur Web. Contrairement à Mozilla Firefox ou Google Chrome, cURL ne fera pas échapper les caractères spéciaux dans votre demande cordes automatiquement. Pour vous assurer que vos demandes puissent être traitées correctement, assurez-vous que des caractéres comme les parenthèses, virgules et similaires sont partie avant de les envoyer via cURL. Si vous utilisez PHP 5.5 libcurl plus récent, vous pouvez préparer la chaîne URL en utilisant la fonction curl_escape. Dans les anciennes versions de PHP hmlspecialchars qui devrait faire le travail aussi.

source: Adding a new workspace
fr: Ajout d'un nouvel workspace

source: The following creates a new workspace named "acme" with a POST request:
fr: L'exemple suivant crée un nouvel workspace nommé "acme" avec une requête POST :

source: Each code block below contains a single command that may be extended over multiple lines.
fr: Chaque bloc de code ci-dessous contient une commande unique qui peut être prolongée sur plusieurs lignes.

source: If executed correctly, the response should contain the following::
fr: Si régulier, la réponse doit contenir ce qui suit::

source: Note the ``Location`` response header, which specifies the location (URI) of the newly created workspace.
fr: Notez l'en-tête de réponse ``Location``, qui spécifie l'emplacement (URI) de l'workspace nouvellement créé.

source: The workspace information can be retrieved as XML with a GET request:
fr: Les informations de workspace peuvent être récupérées au format XML avec une requête GET :

source: The response should look like this:
fr: La réponse devrait ressembler à ceci :

source: This shows that the workspace can contain "``dataStores``" (for :ref:`vector data <data_vector>`), "``coverageStores``" (for :ref:`raster data <data_raster>`), and "``wmsStores``" (for :ref:`cascaded WMS servers <data_external_wms>`).
fr: Cela montre que le workspace peut contenir des magasins de "``dataStores``" (for :ref:`vector data <data_vector>`), "``coverageStores``" (for :ref:`raster data <data_raster>`) et "``wmsStores``" (for :ref:`cascaded WMS servers <data_external_wms>`).

source: The ``Accept`` header is optional. The following request omits the ``Accept`` header, but will return the same response as above.
fr: L'en-tête ``Accept`` est facultative. La requête suivante omet l'en-tête ``Accept``, mais retournera la même réponse que ci-dessus.

source: Uploading a shapefile
fr: Téléchargeant un shapefile

source: In this example a new store will be created by uploading a shapefile.
fr: Dans cet exemple on créera un nouveau magasin en téléchargeant un shapefile.

source: The following request uploads a zipped shapefile named :download:`roads.zip <resources/shapefiles/roads.zip>` and creates a new store named ``roads``.
fr: La requête suivante télécharge un shapefile zippé nommé :download:`roads.zip <resources/shapefiles/roads.zip>` et crée un nouveau magasin nommé ``roads``.

source: The ``roads`` identifier in the URI refers to the name of the store to be created. To create a store named ``somethingelse``, the URI would be ``http://localhost/geoserver/rest/workspaces/acme/datastores/somethingelse/file.shp``
fr: L' identifiant de ``roads`` dans l'URI fait référence au nom de la boutique pour être créé. Pour créer un magasin nommé ``somethingelse``, l'URI serait ``http://localhost/geoserver/rest/workspaces/acme/datastores/somethingelse/file.shp``

source: The store information can be retrieved as XML with a GET request:
fr: Le magasin d'informations peut être récupérée au format XML avec une requête GET :

source: By default when a shapefile is uploaded, a feature type is automatically created. The feature type information can be retrieved as XML with a GET request:
fr: Par défaut lorsqu'un shapefile est téléchargé, un type de fonctionnalité est automatiquement créé. Les informations de type de fonction peuvent être récupérées au format XML avec une requête GET :

source: If executed correctly, the response will be:
fr: Si règulier, la réponse sera :

source: The remainder of the response consists of layer metadata and configuration information.
fr: Le reste de la réponse se compose d'informations de configuration et des métadonnées de couche.

source: Notice that the name of the Layer (and of the FeatureType) corresponds to the physical name of the ShapeFile contained into the archive.
fr: Notez que le nom de la couche (et de la FeatureType) correspond au nom physique de ShapeFile contenue dans l'archive.

source: Adding an existing shapefile
fr: Ajout d'un fichier de forme existante

source: In the previous example a shapefile was uploaded directly to GeoServer by sending a zip file in the body of a PUT request. This example shows how to publish a shapefile that already exists on the server.
fr: Dans l'exemple précédent, un shapefile a été transféré directement à GeoServer en envoyant un fichier zip dans le corps d'une requête PUT. Cet exemple montre comment publier un shapefile qui existe déjà sur le serveur.

source: Consider a directory on the server ``/data/shapefiles`` that contains the shapefile ``rivers.shp``. The following adds a new store for the shapefile:
fr: Considérons un répertoire sur le serveur ``/data/shapefiles`` qui contient le shapefile ``rivers.shp``. L'exemple suivant ajoute un nouveau magasin pour le fichier de la forme :

source: In order to execute the exercise, create a folder ``shapefiles`` somewhere on the server and extract there the :download:`shapefiles.zip <resources/shapefiles/shapefiles.zip>`.
fr: Afin d'exécuter l'exercice, créez un dossier ``shapefiles`` quelque part sur le serveur et extraire les :download:`shapefiles.zip <resources/shapefiles/shapefiles.zip>`.

source: The ``external.shp`` part of the request URI indicates that the file is coming from outside the catalog.
fr: La partie de ``external.shp`` de l'URI de requête indique que le fichier est provenant de l'extérieur du catalogue.

source: The shapefile will be added to the existing store and published as a layer.
fr: Le shapefile sera ajouté au magasin existant et publié comme une couche.

source: To verify the contents of the store, execute a GET request. Since the XML response only provides details about the store itself without showing its contents, execute a GET request for HTML:
fr: Pour vérifier le contenu du magasin, exécutez une requête GET. Étant donné que la réponse XML fournit uniquement des détails sur le magasin lui-même sans montrer son contenu, exécutez une requête GET pour HTML :

source: Adding a directory of existing shapefiles
fr: Ajout d'un répertoire des shapefiles existants

source: This example shows how to load and create a store that contains a number of shapefiles, all with a single operation. This example is very similar to the example above of adding a single shapefile.
fr: Cet exemple montre comment charger et créer une banque qui contient un certain nombre de shapefiles, tous avec une seule opération. Cet exemple est très similaire à l'exemple ci-dessus de l'ajout d'un shapefile unique.

source: Consider a directory on the server ``/data/shapefiles`` that contains multiple shapefiles. The following adds a new store for the directory.
fr: Considérons un répertoire sur le serveur ``/data/shapefiles`` qui contient plusieurs fichiers de forme. L'exemple suivant ajoute un nouveau magasin pour le répertoire.

source: Note the ``configure=all`` query string parameter, which sets each shapefile in the directory to be loaded and published.
fr: Remarque Le ``configure=all`` paramètre de chaîne de requête, qui définit chaque shapefile dans le répertoire sera chargé et publié.

source: Creating a layer style
fr: Création d'un style de calque

source: This example will create a new style on the server and populate it the contents of a local SLD file.
fr: Cet exemple va créer un nouveau style sur le serveur et va remplir le contenu d'un fichier local de SLD.

source: The following creates a new style named ``roads_style``:
fr: L'exemple suivant crée un nouveau style appelé ``roads_style``:

source: This request uploads a file called :download:`roads.sld <resources/roads.sld>` file and populates the ``roads_style`` with its contents:
fr: Cette demande télécharge un fichier nommé :download:`roads.sld <resources/roads.sld>` du fichier et remplit le ``roads_style`` avec son contenu :

source: The SLD itself can be downloaded through a a GET request:
fr: Le SLD elle-même peut être téléchargé via une requête GET :

source: Changing a layer style
fr: Modification d'un style de calque

source: This example will alter a layer style. Prior to making any changes, it is helpful to view the existing configuration for a given layer.
fr: Cet exemple va modifier un style de calque. Avant d'effectuer tout changement, il est utile d'afficher la configuration existante pour une couche donnée.

source: The following retrieves the "acme:roads" layer information as XML:
fr: Ce qui suit récupère les informations de couche de "acme:roads" au format XML :

source: The response in this case would be:
fr: La réponse dans ce cas serait :

source: When the layer is created, GeoServer assigns a default style to the layer that matches the geometry of the layer. In this case a style named ``line`` is assigned to the layer. This style can viewed with a WMS request::
fr: Lorsque la couche est créée, GeoServer attribue un style par défaut à la couche correspondante à la géométrie de la couche. Dans ce cas, un style nommé ``line`` est affecté au calque. Ce style peut se lire avec une demande WMS::

source: In this next example a new style will be created called ``roads_style`` and assigned to the "acme:roads" layer:
fr: Dans ce prochain exemple un nouveau style sera crée appelé ``roads_style`` et affectée au calque "acme:roads" :

source: The new style can be viewed with the same WMS request as above::
fr: Le nouveau style est consultable avec la même demande WMS comme ci-dessus::

source: Note that if you want to upload the style in a workspace (ie, not making it a global style), and then assign this style to a layer in that workspace, you need first to create the style in the given workspace::
fr: Notez que si vous voulez télécharger le style dans un workspace (ne le rendant pas un style global), puis l'assigner à un calque à cet workspace, vous devez d'abord créer le style dans un workspace donné::

source: Upload the file within the workspace::
fr: Télécharger le fichier au sein de workspace::

source: And finally apply that style to the layer. Note the use of the ``<workspace>`` tag in the XML::
fr: Et enfin appliquer ce style au calque. Notez l'utilisation de la ``<workspace>`` tag dans le fichier XML::

source: Adding a PostGIS database
fr: Ajout d'une base de données de PostGIS

source: In this example a PostGIS database named ``nyc`` will be added as a new store.
fr: Dans cet exemple un PostGIS, base de données nommée ``nyc`` s'ajoutera comme un nouveau magasin.

source: This section assumes that a PostGIS database named ``nyc`` is present on the local system and is accessible by the user ``bob``.
fr: Cette section part du principe qu'une base de données PostGIS nommé ``nyc`` est présent sur le système local et est accessible par l'utilisateur ``bob``.

source: In order to create and setup the database locally, follow the instructions at :ref:`setup_nyc_db`
fr: Afin de créer et configurer la base de données localement, suivez les instructions sur :ref:`setup_nyc_db`

source: Create a new text file and add the following content to it. This will represent the new store. Save the file as :file:`nycDataStore.xml`.
fr: Créez un nouveau fichier texte et ajoutez le contenu suivant. Cela représentera le nouveau magasin. Enregistrez le fichier sous :file:`nycDataStore.xml`.

source: The following will add the new PostGIS store to the GeoServer catalog:
fr: Ce qui suit va ajouter que la nouvelle PostGIS stocker au catalogue de GeoServer :

source: The response should look like the following:
fr: La réponse devrait ressembler à ce qui suit :

source: Adding a PostGIS table
fr: Ajout d'une table PostGIS

source: In this example a table from the PostGIS database created in the previous example will be added as a featuretypes.
fr: Dans cet exemple, une table de la base de données PostGIS créée dans l'exemple précédent s'ajoutera comme un featuretypes.

source: This example assumes the table has already been created and the ``tiger_roads`` Layer deleted in case you have executed the previous steps.
fr: Cet exemple suppose que la table a déjà été créée et le ``tiger_roads`` couche supprimé dans le cas où vous avez exécuté les étapes précédentes.

source: The following adds the table ``tiger_roads`` as a new feature type:
fr: L'exemple suivant ajoute la table ``tiger_roads`` comme un nouveau type de fonctionnalité :

source: The featuretype information can be retrieved as XML with a GET request:
fr: Les informations de featuretype peuvent être récupérées au format XML avec une requête GET :

source: This layer can viewed with a WMS GetMap request::
fr: Cette couche peut se lire avec une demande GetMap WMS::

source: Creating a PostGIS table
fr: Création d'une table PostGIS

source: In the previous example, a new feature type was added based on a PostGIS table that already existed in the database. The following example will not only create a new feature type in GeoServer, but will also create the PostGIS table itself.
fr: Dans l'exemple précédent, un nouveau type de fonctionnalité a été ajouté en se basant sur un tableau de PostGIS qui existaient déjà dans la base de données. L'exemple suivant ne crée pas seulement un nouveau type de fonctionnalité dans GeoServer, mais crée également la table PostGIS elle-même.

source: Create a new text file and add the following content to it. This will represent the definition of the new feature type and table. Save the file as :file:`annotations.xml`.
fr: Créez un nouveau fichier texte et ajoutez le contenu suivant. Cette mesure représente la définition du nouveau type de fonctionnalité et de tableau. Enregistrez le fichier sous :file:`annotations.xml`.

source: This request will perform the feature type creation and add the new table:
fr: Cette demande va effectuer la création de type de fonction et ajoutez la nouvelle table :

source: The result is a new, empty table named "annotations" in the "nyc" database, fully configured as a feature type.
fr: Le résultat est une table vide nommée "annotations" dans la base de données "nyc", entièrement configurées comme un type de fonctionnalité.

source: Creating a layer group
fr: Création d'un groupe de calques

source: This example assumes the tables has already been created and the ``tiger_roads``, ``poly_landmarks``, ``poi``, ``giant_polygon`` Layers have been created.
fr: Cet exemple suppose que les tables ont déjà été créé et le ``tiger_roads``, ``poly_landmarks``, ``pi``, ``giant_polygon`` couches ont été créées.

source: In this example a layer group will be created, based on layers that already exist on the server.
fr: Dans cet exemple sera créé un groupe de calques, issu des couches qui existent déjà sur le serveur.

source: Create a new text file and add the following content to it. This file will represent the definition of the new layer group. Save the file as :file:`nycLayerGroup.xml`.
fr: Créez un nouveau fichier texte et ajoutez le contenu suivant. Ce fichier représente la définition du nouveau groupe de calque. Enregistrez le fichier sous :file:`nycLayerGroup.xml`.

source: The following request creates the new layer group:
fr: La requête suivante crée le nouveau groupe de calques :

source: The argument ``-d@filename.xml`` in this example is used to send a file as the body of an HTTP request with a POST method. The argument ``-T filename.xml`` used in the previous example was used to send a file as the body of an HTTP request with a PUT method.
fr: L'argument ``-d@filename.xml`` dans cet exemple est utilisé pour envoyer un fichier comme le corps d'une requête HTTP avec une méthode POST. L'argument ``-T filename.xml`` utilisé dans le précédent exemple a été utilisé pour envoyer un fichier comme le corps d'un HTTP demandé avec une méthode PUT.

source: This layer group can be viewed with a WMS GetMap request::
fr: Ce groupe de calques peut être visualisé avec une demande GetMap WMS::

source: Retrieving component versions
fr: Extraction des versions de composants

source: This example shows how to retrieve the versions of the main components: GeoServer, GeoTools, and GeoWebCache:
fr: Cet exemple montre comment récupérer les versions des composants principaux : GeoServer GeoTools et GeoWebCache :

source: The code block below contains a single command that is extended over multiple lines.
fr: Le bloc de code ci-dessous contient une commande unique qui s'étend sur plusieurs lignes.

source: The response will look something like this:
fr: La réponse ressemblera à quelque chose comme ceci :

source: Retrieving manifests
fr: Récupération des manifestes

source: This collection of examples shows how to retrieve the full manifest and subsets of the manifest as known to the ClassLoader.
fr: Cette collection d'exemples montre comment récupérer le manifeste complet et les sous-ensembles du manifeste comme connu pour le chargeur de classe.

source: The result will be a very long list of manifest information. While this can be useful, it is often desirable to filter this list.
fr: Le résultat sera une très longue liste d'informations de manifeste. Tandis que ceci peut être utile, il est souvent souhaitable pour filtrer cette liste.

source: Filtering over resource name
fr: Filtrage au nom de la ressource

source: It is possible to filter over resource names using regular expressions. This example will retrieve only resources where the ``name`` attribute matches ``gwc-.*``:
fr: Il est possible de filtrer sur les noms de ressources en utilisant des expressions régulières. Cet exemple permet de récupérer uniquement les ressources là où l'attribut ``name`` correspond ``gwc-.*``:

source: The result will look something like this (edited for brevity):
fr: Le résultat ressemblera à quelque chose comme ceci (édité par souci de concision) :

source: Filtering over resource properties
fr: Filtrage sur les propriétés de la ressource

source: Filtering is also available over resulting resource properties. This example will retrieve only resources with a property equal to ``GeoServerModule``.
fr: Le filtrage est également disponible dans les propriétés de ressource qui en résulte. Cet exemple récupérera uniquement les ressources avec une propriété égale à ``GeoServerModule``.

source: The code blocks below contain a single command that is extended over multiple lines.
fr: Les blocs de code ci-dessous contiennent une commande unique qui s'étend sur plusieurs lignes.

source: It is also possible to filter against both property and value. To retrieve only resources where a property named ``GeoServerModule`` has a value equal to ``extension``, append the above request with ``&value=extension``:
fr: Il est également possible de filtrer contrela propriété et la valeur. Pour récupérer les seules ressources dont une propriété nommée ``GeoServerModule`` a une valeur égale à ``extension``, ajouter cette demande avec ``&value=extension``:

source: Uploading and modifying a image mosaic
fr: Télécharger et modifier une mosaïque d'image

source: The following command uploads a :download:`polyphemus.zip` file containing the definition of a mosaic (along with at least one granule of the mosaic to initialize the resolutions, overviews and the like) and will configure all the coverages in it as new layers.
fr: La commande suivante télécharge un :download:`polyphemus.zip` du fichier contenant la définition d'une mosaïque (au moins une granule de la mosaïque pour initialiser les résolutions, les aperçus et les autres) et configure tous les couvertures dedans comme nouveaux calques.

source: The following instead instructs the mosaic to harvest (or re-harvest) a single file into the mosaic, collecting its properties and updating the mosaic index:
fr: Ce qui suit indique plutôt la mosaïque à récolter (ou re-récolter) un seul fichier dans la mosaïque, en collectant ses propriétés et mise à jour de l'index de la mosaïque :

source: Harvesting can also be directed towards a whole directory, as follows:
fr: La récolte peut également être dirigée vers un répertoire entier, comme suit :

source: The image mosaic index structure can be retrieved using something like:
fr: La structure d'index image mosaïque peut être récupérée en utilisant quelque chose comme :

source: which will result in the following:
fr: qui se traduira par le texte suivant :

source: Listing the existing granules can be performed as follows:
fr: Énumérer les granules existantes peut être exécutér comme suit :

source: This will result in a GML description of the granules, as follows:
fr: Cela se traduira par une description GML des granules, comme suit :

source: Removing all the granules originating from a particular file (a NetCDF file can contain many) can be done as follows:
fr: La suppression de toutes les granules provenant d'un fichier particulier (un fichier NetCDF peut en contenir plusieurs) peut être effectuée comme suit :

source: Creating an empty mosaic and harvest granules
fr: Création d'un vide granules de mosaïque et de récolte

source: The next command uploads an :download:`empty.zip` file. This archive contains the definition of an empty mosaic (no granules in this case) through the following files::
fr: La commande suivante télécharge un :download:`empty.zip` fichier. Cette archive contient la définition d'une mosaïque de vide (pas de granules dans le cas présent) à travers les fichiers suivants::

source: **Make sure to update the datastore.properties file** with your connection params and refresh the zip when done, before uploading it.
fr: **Assurez-vous de mettre à jour le fichier datastore.properties** avec vos paramètres de connexion et de revigorer le zip une fois terminé, avant de le télécharger.

source: The configure=none parameter allows for future configuration after harvesting
fr: La ``configure=none`` paramètre permettant la configuration future après récolte
