Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: On Ubuntu, you can add the above settings to your .bashrc file and reload the settings running
fr: Sur Ubuntu, vous pouvez ajouter les paramètres ci-dessus à votre fichier .bashrc et recharger les paramètres en cours d'exécution

source: Set up the local virtual environment for Geonode
fr: Mettre en place l'environnement virtuel pour Geonode

source: This creates a new directory where you want your project to be and creates a new virtualenvironment
fr: Cela crée un nouveau répertoire où vous souhaitez que votre projet soit et crée une nouvelle virtualenvironment

source: Get the code
fr: Récupérer le code

source: To download the latest geonode version from github, the command *clone* is used
fr: Pour télécharger la dernière version de geonode sur github, la commande *clone* est utilisée

source: If you are following the GeoNode training, skip the following command. You can find the cloned repository in /home/geonode/dev
fr: Si vous suivez la formation GeoNode, passez la commande suivante. Vous pouvez trouver le référentiel cloné dans /home/geonode/dev

source: This is required for static development
fr: Ceci est nécessaire pour le développement statique

source: If you are following GeoNode's training, nodejs is already installed in the Virtual Machine skip the first three command and jump to `cd geonode/geonode/static`
fr: Si vous suivez une formation de GeoNode, nodejs est déjà installé dans la Machine virtuelle, passer les trois premières commandes et saut `cd geonode/geonode/static`

source: Every time you want to update the static files after making changes to the sources, go to geonode/static and run 'grunt production'.
fr: Chaque fois que vous souhaitez mettre à jour les fichiers statiques après avoir apporté des modifications aux sources, allez à geonode/statique et exécuter 'grunt production'.

source: Install GeoNode in the new active local virtualenv
fr: Installer GeoNode dans la nouvelle virtualenv locale active

source: If the install fails because of an error related to pyproj not being verified (happens on pip 1.5), use the following:
fr: Si l'installation échoue en raison d'une erreur liée à pyproj qui n'est pas vérifiée (arrive sur pip 1.5), utilisez la syntaxe suivante :

source: Create ``local_settings.py``
fr: Créer des ``local_settings.py``

source: Add the ``local_settings.py`` to your GeoNode instllation
fr: Ajouter le ``local_settings.py`` à votre instllation GeoNode

source: Add the following lines to the ``local_settings.py``
fr: Ajoutez les lignes suivantes à la ``local_settings.py``

source: Compile and Start the server for the first time
fr: Compiler et démarrer le serveur pour la première fois

source: Align the DataBase structure
fr: Aligner la structure de base de données

source: If the start fails because of an import error related to osgeo, then please consult the :ref:`install_gdal_devmode`.
fr: Si le début échoue en raison d'une erreur d'importation associée à osgeo, s'il vous plaît consulter la :ref:`install_gdal_devmode`.

source: The last step is to compile GeoServer and setup
fr: La dernière étape consiste à compiler configuration / GeoServer

source: Now we can start our geonode instance
fr: Maintenant nous pouvons commencer notre instance de geonode

source: Visit the geonode site by typing http://localhost:8000 into your browser window.
fr: Visitez le site geonode en tapant http://localhost:8000 dans la fenêtre de votre navigateur.

source: If you are using a different IP address (e.g 1.1.1.1), then start paver using the command below.
fr: Si vous utilisez une adresse IP différente (par exemple 1.1.1.1), puis démarrez Finisseurs à l'aide de la commande ci-dessous.

source: type hold **Ctrl c** on your keyboard to stop the server
fr: cale de type **Ctrl c** sur votre clavier pour arrêter le serveur

source: now type:
fr: maintenant, tapez :

source: Create a superuser so you can log on to your local geonode installation at http://localhost:8000
fr: Créer un superutilisateur afin que vous puissiez vous connecter à votre installation locale geonode à http://localhost:8000

source: Start working on Geonode the next day after install
fr: Commencer à travailler sur GeoNode le lendemain après l'installation

source: With every restart of your machine, you have to restart geonode as well. That means, you will not be able to open http://localhost:8000 directly after starting your machine new. In order to be able to use geonode now, you have to activate your virtualenvironment and to start the development servers.
fr: À chaque redémarrage de votre machine, vous devez redémarrer geonode ainsi. Autrement, vous ne serez pas en mesure d'ouvrir http://localhost:8000 directement après le démarrage de votre machine à nouveau. Pour pouvoir utiliser geonode maintenant, vous devez activer votre virtualenvironment et démarrer les serveurs de développement.

source: *username* is the name of your machine and personal folder!
fr: *username* est le nom de votre machine et votre dossier personnel !

source: Activate virtualenv
fr: Activer virtualenv

source: To activate your virtualenv you just need to type
fr: Pour activer votre virtualenv il vous suffit de taper

source: or
fr: ou

source: Be careful with the path, it might not be the same for you!
fr: Soyez prudent avec le chemin d'accès, il ne serait pas la même chose pour vous !

source: Start the server
fr: Démarrer le serveur

source: Now you are able to access http://localhost:8000 again.
fr: Vous êtes maintenant en mesure d'accéder de nouveau à http://localhost:8000.

source: Remember that you have to do these steps each time you restart your machine!!
fr: N'oubliez pas que vous devez faire ces étapes chaque fois que vous redémarrez votre machine !

source: Now you've followed these installation instructions, geonode is running in development mode. This also means that you are using all the default settings of geonode. If you want to change them, e.g use Tomcat instead of Jetty, or Postgresql instead of sqlite3, you may follow the steps from the section **Configure Manually** in :ref:`geonode_install`.
fr: Maintenant que vous avez suivi ces instructions d'installation, geonode s'exécute en mode de développement. Cela signifie également que vous utilisez les paramètres par défaut de geonode. Si vous souhaitez les modifier, par exemple utiliser Tomcat au lieu de la jetée, ou Postgresql au lieu de sqlite3, vous pouvez suivre les étapes de la section **Configurer manuellement** dans :ref:`geonode_install`.

source: Install GeoNode for Development (Windows)
fr: Installer GeoNode pour le développement (Windows)

source: In order to install Geonode 2.0 in developing mode on Windows 2008r2 the following steps are required:
fr: Afin d'installer Geonode 2.0 dans le développement de mode sur Windows 2008r2, les étapes suivantes sont nécessaires :

source: install dependencies (Python and Java) and supporting tools
fr: Installez les dépendances (Python et Java) et outils de soutien

source: set up a virtual environment (virtualenv)
fr: mettre en place un environnement virtuel (virtualenv)

source: clone geonode from github and install it in the virtual environment
fr: clone de geonode de github et installez-le dans l'environnement virtuel

source: run paver to get install geoserver and start the development servers
fr: Exécutez le finisseur pour obtenir geoserver installé et démarrer les développement des serveurs

source: The following steps have to be executed in your terminal where there is a ">". The path will differ depending on installation.
fr: Les étapes suivantes doivent être exécutées dans votre terminal où il y a un ">". Le chemin d'accès varie selon l'installation.

source: Install Dependencies. All should be found in binary. Only 32 bit versions have been tested.
fr: Installer les dépendances. Toutes devraient être trouvées en binaire. Seules les versions 32 bits ont été testées.

source: Latest Python 2.7.x Windows build https://www.python.org/download/releases/2.7.7/
fr: Dernière version de Python 2.7.x Windows construire https://www.python.org/download/releases/2.7.7/

source: Install core components of GDAL http://www.gisinternals.com/sdk/PackageList.aspx?file=release-1600-gdal-1-11-mapserver-6-4.zip gdal-111-1600-core.msi
fr: Installer les composants de base de GDAL http://www.gisinternals.com/sdk/PackageList.aspx?file=release-1600-gdal-1-11-mapserver-6-4.zip gdal-111-1600-core.msi

source: Install Java for Geoserver. If you already have java installed 32 or 64 bit versions work.
fr: Installer Java pour Geoserver. Si vous avez déjà java installé 32 ou 64 bit versions fonctionnent.

source: Ant and Maven are optional for custom builds of Geoserver
fr: Ant et Maven sont facultatifs pour les versions personnalisées de Geoserver

source: Install Supporting tools
fr: Installer les outils d'appui

source: GetText (not tested yet)
fr: GetText ( pas encore testé)

source: Install node and tools for static development (not tested yet)
fr: Installez le nœud et les outils de développement statique ( pas encore testés)

source: In the command prompt do the following: Will we need to be admins?
fr: À l'invitation de commandes, effectuez les opérations suivantes : devrons-nous être admins ?

source: Get the GeoNode Code using Git.
fr: Obtenir le Code de GeoNode à l'aide de Git.

source: Open the Git bash or use your command prompt depending on how git was installed This command will download the latest version of GeoNode. For the most recent stable version type number 2.
fr: Ouvrez le bash Git ou utiliser votre invitation de commandes. En fonction de comment git a été installé cette commande va télécharger la dernière version de GeoNode. Pour le plus récent numéro du type stable version 2.

source: Install all Dependencies in a new virtual environment
fr: Installer toutes les dépendances dans un nouvel environnement virtuel

source: In the command prompt, navigate to where you want your python to be installed.
fr: Dans l'invite de commandes, accédez où vous voulez que votre python soit installé.

source: Command not found? Try adding your python scripts folder to the path environment variable. In most cases it is C:\Python27\Scripts. You will need to start a fresh command prompt to register the variables. See next common error message to add the C:\Python27 path
fr: Commande non trouvée ? Essayez d'ajouter votre dossier de scripts python pour la variable d'environnement path. Dans la plupart des cas, il est C:\Python27\Scripts. Vous aurez besoin commencer une douce invite pour enregistrer les variables. Voir le message d'erreur commune suivant pour ajouter le chemin d'accès C:\Python27

source: Errors about no package found and running python from the command prompt gives command not found, then add C:\Python27 to your path environment variable.
fr: Erreurs sur aucun paquet trouvés et exécution python à partir de l'invite de commandes affiche commande introuvable, puis ajoutez C:\Python27 à votre variable d'environnement path.

source: Initialize the virtual environment by navigating to your-virtualenv-directory/Scripts/activate
fr: Initialiser l'environnement virtuel en accédant à votre-virtualenv-répertoire/Scripts/activer

source: After you activate the virtual environment, run the following:
fr: Après avoir activé l'environnement virtuel, exécutez ce qui suit :

source: Navigate to your geonode code install and run
fr: Accédez à votre geonode code installation et exécutez

source: *Back to the parent directory*
fr: *Vers le répertoire parent*

source: Set up the Geoserver with command
fr: Mettre en place le Geoserver avec la commande

source: Visit the geonode site by typing http://localhost:8000 into your browser window.
fr: Visitez le site geonode en tapant http://localhost:8000 dans la fenêtre de votre navigateur.

source: If the start fails because of an import error related to osgeo, then ensure that the GDAL_LIBRARY_PATH is set in the Windows path.
fr: Si le début échoue en raison d'une erreur d'importation associée à osgeo, assurez-vous que le GDAL_LIBRARY_PATH se trouve dans le chemin d'accès de Windows.

source: If you get GEOSversion function not found, then need to need to change line 71 in geonode\Lib\site-packages\Shapely-1.3.0-py2.7-win32.egg\shapely\geos.py from _lgeos = CDLL("geos.dll") to _lgeos = CDLL("geos_c.dll"). See issue https://github.com/Toblerity/Shapely/issues/136
fr: Si vous obtenez GEOSversion fonction introuvable, puis devez avoir besoin de changer la ligne 71 dans geonode\Lib\site-packages\Shapely-1.3.0-py2.7-win32.egg\shapely\geos.py de _lgeos = CDLL("geos.dll") à _lgeos = CDLL("geos_c.dll"). Voir issue de https://github.com/Toblerity/Shapely/issues/136

source: type hold Ctrl c on your keyboard to stop the server
fr: taper maintenez Ctrl c sur votre clavier pour arrêter le serveur

source: Create a superuser so you can log on to your local geonode installation at http://localhost:8000
fr: Créer un superutilisateur afin que vous puissiez vous connecter à votre installation locale geonode à http://localhost:8000

source: Debugging GeoNode in the Browser
fr: débogage de Geonode dans le navigateur

source: This section covers some techniques for debugging browser and Django related response bugs using the Firefox web browser extension named Firebug. The concepts covered apply to other browser's tools but may vary in terminology.
fr: Cette section traite des techniques de débogage du navigateur et des réponse associées des bogues à l'aide de l'extension du navigateur web Firefox nommée Firebug. Les concepts traités s'appliquent aux autres outils des navigateurs mais peuvent varier selon la terminologie.

source: Another Firefox extension worth noting is 'jsonview'. This extension supports formatted viewing of JSON responses and integrates well with Firebug.
fr: Une autre extension Firefox à noter est 'jsonview'. Cette extension prend en charge le format d'affichage des réponses JSON et s'intègre parfaitement avec Firebug.

source: References:
fr: Références :

source: The net tab allows viewing all of the network traffic from the browser. The subtabs (like the selected "Images" tab) allow filtering by the type of traffic.
fr: L'onglet net permet de visualiser tout le trafic réseau depuis le navigateur. Les sous-onglets (comme l'onglet "Images" sélectionné) permettent le filtrage par type de trafic.

source: In this screen-shot, the mouse hover displays the image content and the full URL requested. One can right-click to copy-paste the URL or view in a separate tab. This is useful for obtaining test URLs. The grayed out entries show that the resource was cached via conditional-get (the 304 not modified). Other very useful advanced information includes the size of the response and the loading indicator graphics on the right. At the bottom, note the total size and timing information.
fr: Dans cette capture d'écran, le pointeur de la souris affiche le contenu de l'image et la pleine URL demandée. On peut faire un clic droit pour copier-coller l'URL ou la vue dans un onglet séparé. Ceci est utile pour obtenir des URL de test. Les rubriques grisées indiquent que la ressource mise en cache par l'intermédiaire de conditionnel-get (le 304 non modifié). Autres informations avancées très utiles comprennent la taille de la réponse et le chargement graphiques d'indicateur sur la droite. En bas, notez la taille totale et les informations de synchronisation.

source: Net Tab Exercises
fr: Net Tab Exercices

source: Go to layers/maps/search pages and look at the various requests. Note the XHR subtab. Look at the various request specific tabs: headers, params, etc.
fr: Aller aux pages de couches/cartes/Rechercher et regarder les diverses demandes. Notez le sous-onglet XHR. Demander de regarder les différents onglets spécifiques : en-têtes, params, etc..

source: Use the 'disable browser cache' option and see how it affects page loads. Discuss advantages/challenges of caching.
fr: Utilisez l'option 'désactiver le cache du navigateur' et voir comment elle affecte le chargement de la page. Discuter les avantages et les défis de la mise en cache.

source: The DOM tab displays all of the top-level window objects. By drilling down, this can be a useful way to find out what's going on in a page.
fr: L'onglet DOM affiche tous les objets de la fenêtre de niveau supérieur. En creusant, cela peut être un moyen utile pour savoir ce qui se passe dans une page.

source: In this example, the mouse is hovering over the ``app`` object. Note the high level view of objects and their fields. The console tab allows interacting with the objects.
fr: Dans cet exemple, la souris est positionnée sur l'objet ``app``. Notez la vue de haut niveau des objets et leurs champs. L'onglet de console permet d'interagir avec les objets.

source: DOM Tab Exercises
fr: DOM Tab Exercices

source: Drill down in the DOM tab.
fr: Descendre dans l'onglet DOM.

source: Use the console to interactively exercise jquery.
fr: Utilisez la console pour exercer interactivement jquery.

source: Use the console to interact with the app/map or other page objects
fr: Utiliser la console pour interagir avec l'application/carte ou d'autres objets de la page

source: The script tab allows viewing scripts and debugging.
fr: L'onglet script permet la visualisation de scripts et de débogage.

source: The screen-shot displays a breakpoint set at line 3, the current code is stopped at line 8 and the mouse hover is displaying the value of the variable 'class_list'. On the right, the 'Watch' tab displays the various variables and scopes and offers a drill down view similar to the DOM view. The stack tab displays the execution stack context outside the current frame.
fr: La capture d'écran affiche un point d'arrêt défini à la ligne 3, le code actuel s'arrête à la ligne 8, et le pointeur de la souris affiche la valeur de la variable 'class_list'. Sur la droite, l'onglet 'Watch' affiche les différentes variables et étendues et offre un zoom avant vue semblable à la vue de DOM. L'onglet pile affiche le contexte de pile d'exécution en dehors du cadre actuel.

source: Script Tab Exercises
fr: Script Tab Exercices

source: Step through some code
fr: Faire défiler un code

source: Look at various features: variables, scopes, DOM drill-down
fr: Regardez les différentes fonctionnalités : variables, scopes, DOM drill-down

source: The HTML tag allows viewing and drilling down into the DOM. This is an incredibly useful feature when doing CSS or HTML work.
fr: La balise HTML permet de visualiser et de creuser dans le DOM. Il s'agit d'une fonction extrêmement utile lorsque vous faites un travail CSS ou HTML.

source: The screen-shot displays a search result 'article' element highlighted with padding and margin in yellow and purple. The DOM structure is displayed on the left and the right panel displays the specific style rules while the computed tab displays the effective style rules. The layout tab displays rulers and property values while the DOM tab displays a debug/DOM-like view of the actual object's properties.
fr: La capture d'écran affiche un élément d' "article" ,le résultat de recherche a mis en évidence avec rembourrage et marge en jaune et violet. La structure DOM est affichée sur la gauche et le panneau de droite affiche les règles de style spécifique tandis que l'onglet calculée affiche les règles de style efficace. L'onglet mis en page affiche les règles et valeurs de propriété tandis que l'onglet DOM affiche une vue de débogage/DOM-comme des propriétés de l'objet réel.

source: HTML Tab Exercises
fr: HTML Tab Exercices

source: Identify elements, look at the tabs on the right
fr: Identifier les éléments, regardez les onglets sur la droite

source: Change styles, add new rules and styles
fr: Modifier les styles, ajouter des styles et des nouvelles règles

source: Edit existing HTML elements via the raw and tree-view
fr: Modifiez les éléments HTML existants via le raw et arborescence

source: Debugging GeoExplorer
fr: GeoExplorer débogage

source: In case you want to debug the GeoExplorer behaviour in your browser with Firebug of Chromium Developer toolbar, you may do the following:
fr: Dans le cas où vous souhaitez déboguer le comportement GeoExplorer dans votre navigateur avec Firebug de chrome Developer toolbar, vous pouvez procéder comme suit :

source: Install Boundless Suite::
fr: Installer la Suite sans limite::

source: Run GeoExplorer in debug mode::
fr: Exécutez GeoExplorer en mode débogage::

source: Check if GeoExplore is running at this url: http://localhost:9080
fr: Vérifier si GeoExplore est en cours d'exécution à cette url: http://localhost:9080

source: Edit the ``layers/templates/layers/layer_geoext_map.html`` file and replace this line::
fr: Éditez le fichier ``layers/templates/layers/layer_geoext_map.html`` et remplacez cette ligne::

source: with this one::
fr: avec celui-ci::

source: Debugging GeoServer
fr: Débogage de GeoServer

source: Resources:
fr: Ressources :

source: This section does not attempt to cover developer-level debugging in GeoServer as this is a much larger topic involving many more tools. The goal here is to provide 'black-box' techniques to help resolve and report problems.
fr: Cette section ne vise pas à couvrir le développeur au niveau du débogage dans GeoServer, puisqu'il s'agit d'un bien sujet agrandissement impliquant beaucoup plus d'outils. Le but ici est de fournir des techniques de "boîte noire" pour aider à résoudre et à signaler les problèmes.

source: Logging
fr: Journalisation

source: GeoServer logging, while sometimes containing too much information, is the best way to start diagnosing an issue in GeoNode once the other. To create a proper error report for use in requesting support, providing any contextual logging information is critical.
fr: L'exploitation forestière de GeoServer, tout en contenant parfois beaucoup trop d'informations, est la meilleure façon de commencer à diagnostiquer un problème en GeoNode une fois l'autre. Pour créer un rapport d'erreur approprié pour une utilisation à l'appui de la demande, fournir toute information contextuelle de journalisation est critique.

source: When using a standard geoserver installation, the GeoServer logs are located at :file:`/usr/share/geoserver/data/logs/geoserver.log`. The properties files that control the varying rules are also located here.
fr: Lorsque vous utilisez une installation standard de geoserver, les journaux de GeoServer se trouvent à :file:`/usr/share/geoserver/data/logs/geoserver.log`. Les fichiers de propriétés qui contrôlent les différentes règles sont également situés ici.

source: Switch logging levels for various loggers.
fr: Passer les niveaux d'enregistrement pour différents journaux.

source: Look at the different logging profiles and discuss the loggers and levels.
fr: Regardez les profils différents de journalisation et discuter des loggers et des niveaux.

source: Learn how to read stacktraces, nested or otherwise.
fr: Apprendre à lire stacktraces, imbriquées ou autrement.

source: Advanced Troubleshooting
fr: Dépannage avancé

source: JVM diagnostics and advanced troubleshooting techniques are covered in the GeoServer documents linked to above. When providing information for a bug report, these can be helpful but in-depth Java knowledge is required to fully comprehend the output from some of these tools.
fr: Diagnostic de la JVM et des techniques de dépannage avancées sont couverts dans les documents de GeoServer liés au dessus. Lorsqu'elle fournit des informations pour un rapport de bogue, il peuvent être utiles, mais des connaissances approfondies de Java sont nécessaire pour bien comprendre la sortie de certains de ces outils.

source: Look at jstack output
fr: Regardez jstack sortie

source: Using Django to Help Debug
fr: Utiliser Django à l'aide de débogage
