Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/005_dev_workshop.po
Languages: fr

source: Click the green button to merge the changes into master. Click Confirm merge. Go ahead and delete the branch, since its changes have been incorporated, with the Delete branch button in the purple box.
fr: Cliquez sur le bouton vert pour fusionner les modifications dans le maître. Cliquez sur confirmer fusionner. Allez-y et supprimer la branche, étant donné que ses modifications ont été incorporées, avec le bouton de direction de supprimer dans la boîte de pourpre.

source: If you revisit the issue you opened, it’s now closed! Because you included “fixes #1” in your Pull Request title, GitHub took care of closing that issue when the Pull Request was merged!
fr: Si vous revisitez sur la question que vous avez ouvert, il est maintenant terminée ! Parce que vous avez inclus “fixes #1” dans le titre de votre demande de tirer, GitHub a pris soin de fermer cette question lorsque la demande de tirer a été fusionnée !

source: Developers Workshop
fr: Workshop pour les Developers

source: Welcome to the GeoNode Training `Developers Workshop` documentation v\ |release|.
fr: Bienvenue à la formation de GeoNode `Developers Workshop` documentation v\ |release|.

source: This workshop will teach how to develop with and for the `GeoNode <http://geonode.org>`_ software application. This module will introduce you to the components that GeoNode is built with, the standards that it supports and the services it provides based on those standards, and an overview its architecture.
fr: Ce workshop va apprendre à développer avec et pour les `GeoNode <http://geonode.org>`_ logiciel d'application. Ce module vous fera découvrir les composants de GeoNode qui est construit avec les normes qu'il soutient, et les services qu' offre son architecture basée sur ces normes, ainsi qu'un aperçu.

source: *Prerequisites*
fr: *Conditions préalables*

source: Django's primary goal is to ease the creation of complex, database-driven websites. Django emphasizes reusability and "pluggability" of components, rapid development, and the principle of *don't repeat yourself*. Python is used throughout, even for settings, files, and data models.
fr: L'objectif principal de Django est de faciliter la création de sites Web complexes, axée sur la base de données. Django met l'accent sur les possibilités de réutilisation et de la "possibilité" de composants, un développement rapide et le principe de *ne vous répétez pas*. Python est utilisé dans l'ensemble, même pour les modèles de données, fichiers et paramètres.

source: Django also provides an optional administrative create, read, update and delete interface that is generated dynamically through introspection and configured via admin models.
fr: Django fournit également une option administrative créer, lire, mettre à jour et supprimer l'interface qui est généré dynamiquement par introspection et configuré par l'intermédiaire de modèles d'administration.

source: This module shows a step-by-step guide for the setup of a GeoNode Develeopment Environent on an Ubuntu system.
fr: Ce module indique un guide étape par étape pour l'installation d'un GeoNode élaboration Environent sur un système Ubuntu.

source: For other Linux distributions the commands are similar, the difference is mainly on the packages names.
fr: Pour les autres distributions Linux, les commandes sont semblables, la différence est principalement sur les noms de paquets.

source: GeoNode can be difficult to debug as there are several different components involved. This module shows some tecniques to debug the different parts of GeoNode.
fr: GeoNode peut être difficile à déboguer, car il est a plusieurs différents composants impliqués. Ce module montre quelques tecniques pour déboguer les différentes parties du GeoNode.

source: This module provides an overview of the core modules and libraries used by GeoNode and teach to the user how to use them through some guided examples.
fr: Ce module fournit une vue d'ensemble des modules du noyau et de la bibliothèques utilisés par GeoNode et enseignent à l'utilisateur comment les utiliser à travers quelques exemples de visites.

source: This section explain how to run the tests on GeoNode.
fr: Cette section explique comment exécuter les tests sur GeoNode.

source: Basic concepts about GitHub OpenSource Projects and best practices.
fr: Notions de base sur les projets OpenSource GitHub et meilleures pratiques.
