Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/index.po
Languages: fr

source: GeoNode Training Documentation
fr: Documentation de formation pour GeoNode

source: Welcome to the GeoNode Training Documentation.
fr: Bienvenue à la documentation de formation de GeoNode.

source: From here you can browse the documentation relative to the GeoNode Training Documentation.
fr: A partir de ici vous pouvesnaviguer dans la documentation pour la formation de GeoNode

source: The Documentation is divided in six main sections:
fr: La documentation est decoupè en six sections principales

source: This module guides the user to an overview of GeoNode and its main components.
fr: Cette section guide l'utilisateur à une introduction de GeoNode et ses principales composantes .

source: At the end of this section you will have a clear view of what GeoNode is and can do. You will be able also to use the GeoNode main functionalities and understand some of the basic concepts of the system infrastructure.
fr: A la fin de cette section vous aurez une vue claire de ce qu vous pouvez fair avec GeoNode et de ce que est GeoNode meme

source: This module is more oriented to users having some System Administrator background.
fr: Ce module est orientè vers les utilisateurs ayant des connaissances de administrateur de système

source: At the end of this section you will be able to setup from scratch the whole GeoNode infrastructure and understand how to the different pieces are interconnected and which are their dependencies.
fr: A la fine de cette section vous serez capable de configurer a partir de zéro l'ensemble de l'infrastructure de GeoNode et de comprendre comment les différentes components sont reliées entre elles et qui sont leurs dépendances .

source: Before proceeding with the reading, it is strongly recommended to be sure having clear the following concepts:
fr: Avant de procéder avece le cours, il est fortement recommandé qui on est bien sûr d'avoir clairement compris les concepts suivants

source: GeoNode and Django framework basic concepts
fr: Concepts de base sur GeoNode et sur Django

source: What is Python
fr: Qu'est-ce que Python

source: What is a DBMS
fr: Qu'est-ce qu'un SGBD

source: What is a Java Virtual Machine and the JDK
fr: Qu'est-ce qu'une machine virtuelle Java et le JDK

source: Linux OS basic shell and maintenance commands
fr: Commandes de base pur la entretien du système d'exploitation Linux

source: Basic TCP/IP and networking concepts
fr: Concepts de base sur le TCP / IP et le réseau

source: Apache HTTPD Server and WSGI Python bindings
fr: Apache HTTPD Server et les liaisons Python WSGI

source: This workshop will teach how to use the GeoNode going in depth into what we can do with software application. At the end of this section you will master all the GeoNode sections and entities from a user perspective.
fr: Ce cours vous apprendra comment utiliser le GeoNode. On va aller en profondeur dans ce que nous pouvons faire avec cette logicielle. À la fin de cette section, vous serez capable de utiliser les GeoNode du point de vue de l'utilisateur final.

source: You will know how to:
fr: Vous saurez comment vous pourrez:

source: Manage users accounts and how to modify them.
fr: Gérer les permissions des utilisateurs

source: Use and manage the different GeoNode basic resouces.
fr: Utiliser et gérer les différents ressources de base de GeoNode.

source: Use the GeoNode searching tools to find your resources.
fr: Comment on peut utiliser les outils de recherche de GeoNode pour trouver vos ressources.

source: Manage Layers and Maps, update the styles and publish them.
fr: Gérer les calques et les cartes, mettre à jour les styles et les publier.

source: Load datasets into GeoNode and keep them synchronized with GeoServer.
fr: Charger des données dans GeoNode et les garder synchronisés avec GeoServer.

source: What is a geospatial server and a basic knowledge of the geospatial web services.
fr: Qu'est-ce qu'un serveur géospatial et une connaissance de base des services Web géospatiales.

source: What is a metadata and a catalog.
fr: Qu'est-ce qu'un métadonnées et un catalogue.

source: What is a map and a legend.
fr: Qu'est-ce qu'une carte et une légende.

source: This workshop will teach how to install and manage a deployment of the `GeoNode <http://geonode.org/>`_ software application. At the end of this section you will master all the GeoNode sections and entities from an administrator perspective.
fr: Ce vous vous apprendra comment installer et gérer une installation de `GeoNode <http://geonode.org/>`_. À la fin de cette section, vous serez maître de toutes les sections sur GeoNode du point de vue de l'administrateur.

source: Use the GeoNode’s Django Administration Panel.
fr: Utiliser le Panneau d'administration de Django dans GeoNode .

source: Use the console Management Commands for GeoNode.
fr: Utilisez les commandes de gestion de la console pour GeoNode.

source: Configure and customize your GeoNode installation.
fr: Configurer et personnaliser votre installation de GeoNode.

source: GeoNode and Django framework concepts
fr: Concepts de base sur GeoNode et sur Django

source: Good knowledge of Python
fr: Bonne connaissance de Python

source: Good knowledge of what is a geospatial server and geospatial web services.
fr: Bonne connaissance de ce qui est un serveur géospatial et les services web géospatiales.

source: Good knowledge of what is metadata and catalog.
fr: Bonne connaissance de ce qui sont les métadonnées et de ce qui est un catalogue.

source: Good knowledge of HTML and CSS.
fr: Bonne connaissance de HTML et CSS.

source: This workshop will teach how to develop with and for the `GeoNode <http://geonode.org>`_ software application. This module will introduce you to the components that GeoNode is built with, the standards that it supports and the services it provides based on those standards, and an overview its architecture.
fr: Cet atelier vous apprendra comment développer avec `GeoNode <http://geonode.org>`_. Cette section vous fera découvrir les composants qui compose GeoNode meme et les normes , qu'il soutien et les services qu'il fournit sur ​​la base de ces normes. A la fin on va voir un aperçu de son architecture.

source: GeoNode is a web based GIS tool, and as such, in order to do development on GeoNode itself or to integrate it into your own application, you should be familiar with basic web development concepts as well as with general GIS concepts.
fr: GeoNode est un outil SIG basé sur le Web, donc dans le but de faire du développement sur ​​GeoNode lui-même ou de l'intégrer dans votre propre application, vous devez être familier avec les concepts de base de développement web ainsi que avec les concepts généraux de SIG.

source: This module introduces advanced tecquinques and metodologies for the management of the geospatial data and the maintenance and tuning of the servers on *Production Environments*.
fr: Ce module présente techniques et metodologies avancées pour la gestion des données géospatiales et de l' entretien et le réglage fin des serveurs sur *des environnements de production*

source: The last sections of the module will teach also you how to add brand new classes and functionalities to your GeoNode installation.
fr: Les dernières sections du module enseignera aussi comment ajouter de nouvelles classes de marques et de fonctionnalités à votre installation de GeoNode.

source: You should be familiar with GeoNode, GeoServer, Python framework and development concepts other than with system administrator and caching concepts and tecnquiques.
fr: Vous devez être familier avec GeoNode , GeoServer, le développement avec Python et avec les concepts des bas d' administrateur de système et des tecnquiques de mise en cache.

source: Editing the documentation
fr: Modification de la documentation

source: This documentation is written in `reStructuredText <https://en.wikipedia.org/wiki/ReStructuredText>`_ format and automatically build from `this GitHub repository <https://github.com/geosolutions-it/doc-geonode>`_ To edit the documentation you'll need the following tools:
fr: Cette documentation est écrit en `reStructuredText <https://en.wikipedia.org/wiki/ReStructuredText>`_ format et il est construit automatiquement à partir de `ce GitHub dépôt <https://github.com/geosolutions-it/doc-geonode>`_ Pour modifier la documentation vous avez besoin des outils suivants:

source: `Python <https://www.python.org/>`_ and `pip <https://en.wikipedia.org/wiki/Pip_(package_manager)>`_ (recent versions of Python come bundled with pip)
fr: `Python <https://www.python.org/>`_ et `pip <https://en.wikipedia.org/wiki/Pip_(package_manager)>`_ (récente version de Python fournie avec pip)

source: For installation and basic usage of the tools follow `these <./install-doc-tools.html>`_ instructions
fr: Pour l'installation et l'utilisation de base des outils il faut suivre `ces <./install-doc-tools.html>`_ instructions

source: License Information
fr: Informations sur la licence

source: Documentation is released under a :term:`Creative Commons` license with the following conditions.
fr: La documentation est publié sous une :term:`Creative Commons` license avec les conditions suivantes.

source: You are free to Share (to copy, distribute and transmit) and to Remix (to adapt) the documentation under the following conditions:
fr: Vous êtes libre de partager (copier , distribuer et communiquer) et de remix (d'adapter) la documentation dans les conditions suivantes:

source: Attribution. You must attribute the documentation to the author.
fr: Paternité. Vous devez attribuer la documentation à l'auteur.

source: Share Alike. If you alter, transform, or build upon this work, you may distribute the resulting work only under the same or similar license to this one.
fr: hare Alike . Si vous modifiez, transformez ou adaptez cette création, vous devez distribuer l' œuvre résultante sous la même licence ou similaire à celui-ci.

source: With the understanding that:
fr: Étant entendu que:

source: Any of the above conditions can be waived if you get permission from the copyright holder.
fr: Chacune de ces conditions peut être levée si vous obtenez l'autorisation du titulaire du droit d'auteur.

source: Public Domain. Where the work or any of its elements is in the public domain under applicable law, that status is in no way affected by the license.
fr: Domaine public. Lorsque le travail ou l'un de ses éléments est dans le domaine public en vertu du droit applicable, ce statut est en aucune façon affectées par la licence.

source: Other Rights. In no way are any of the following rights affected by the license:
fr: Autres droits. En aucun cas, sont l'un des droits suivants touchés par la licence:

source: Your fair dealing or fair use rights, or other applicable copyright exceptions and limitations;
fr: Votre utilisation équitable ou fair use l'homme, ou d'autres exceptions et limitations au droit d'auteur applicable;

source: The author's moral rights;
fr: Les droits moraux de l'auteur;

source: Rights other persons may have either in the work itself or in how the work is used, such as publicity or privacy rights.
fr: Droits d'autres personnes peuvent avoir soit dans le travail lui-même ou dans la façon dont le travail est utilisé , tels que les droits à la vie privée ou de publicité.

source: Notice: For any reuse or distribution, you must make clear to others the license terms of this work. The best way to do this is with a link to this web page.
fr: Avis : Pour toute réutilisation ou distribution, vous devez faire apparaître clairement au public les conditions de ce travail de licence . La meilleure façon de le faire est avec un lien vers cette page web.

source: You may obtain a copy of the License at `Creative Commons Attribution-ShareAlike 3.0 Unported License <http://creativecommons.org/licenses/by-sa/3.0/>`_
fr: Vous pouvez obtenir une copie de la licence au `Creative Commons Attribution-ShareAlike 3.0 Unported License <http://creativecommons.org/licenses/by-sa/3.0/>`_

source: The document is written in reStructuredText format for consistency and portability.
fr: Ce document est écrit au format reStructuredText pour la cohérence et la portabilité .

source: Author Information
fr: Information sur l'auteur

source: This documentation was written by GeoSolutions.
fr: Cette documentation a été écrit par GeoSolutions.

source: If you have questions, found a bug or have enhancements, please contact us through info@geosolutions.it
fr: Si vous avez des questions , trouvé un bug ou vous avez fait des améliorations, contactez-nous via info@geosolutions.it
