Repository: geosolutions-it/doc-geonode
Catalog: i18n/*/LC_MESSAGES/install-doc-tools.po
Languages: fr

source: This section of the guide cover the installation process and basic usage of the tools needed in order to make changes to the documentation.
fr: Cette section du guide couvre le processus d'installation et l'usage basique des outils necessaire pour changer la documentation

source: You are going to need the following tools:
fr: Vous allez avoir besoin des outils suivants:

source: `Python <https://www.python.org/>`_ and `pip <https://en.wikipedia.org/wiki/Pip_(package_manager)>`_ (recent versions of Python come bundled with pip)
fr: `Python <https://www.python.org/>`_ et `pip <https://en.wikipedia.org/wiki/Pip_(package_manager)>`_ (récente version de Python fournie avec pip)

source: Install Git
fr: Installez Git

source: To install Git on your machine refer to `this <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`_ guide.
fr: Pour installer Git sur votre machine faites référence a `ce <https://git-scm.com/book/en/v2/Getting-Started-Installing-Git>`_ guide.

source: For a brief introduction to Git usage refer to `this <https://git-scm.com/book/en/v2/Getting-Started-Git-Basics>`_ guide
fr: Pour une brève introduction à l'usage de Git, faites référence à `ce <https://git-scm.com/book/en/v2/Getting-Started-Git-Basics>`_ guide.

source: Install Python
fr: Installez Python

source: Python installation is pretty straight forward, refer to the `official download page <https://www.python.org/downloads/>`_ and follow the instruction for your Operating System. As stated above from Python 2.7.9 onward pip comes bundled with Python.
fr: L'installation de Python est assez simple , faites référence au download de la `page officielle <https://www.python.org/downloads/>`_ et suivez les instructions pour votre système d'exploitation. Comme cité ci-dessus par Python 2.7.9 , onward pip est fourni avec Python.

source: Open the terminal on your machine and type `python`, the output should resemble the following: ::
fr: Ouvrez le terminal de votre machine et tapez "python" , le résultat devrait être le suivant: ::

source: Type `exit()` to exit the Python interpreter
fr: Tapez `exit()` pour sortir de l'interpréte Python.

source: If you get and error back make sure the Python executable is in your `PATH`.
fr: Si vous obtenez une erreur , soyez sur que l'execution de Python est dans votre `PATH`.

source: If you are on Windows follow `theese instructions <https://docs.python.org/2/using/windows.html#excursus-setting-environment-variables>`_
fr: Si vous etes sur Windows suivez ses `instructions <https://docs.python.org/2/using/windows.html#excursus-setting-environment-variables>`_

source: If you are on Linux locate the Python binary and add it to your PATH, edit your `~/.bashrc` and add the following at the end of the file: ::
fr: Si vous etes sur Linux , localisez le binaire de Python et ajoutez le à votre PATH , éditez votre `~/.bashrc` et ajoutez le à la fin du file: ::

source: restart your terminal to make the change effective
fr: Redémarrez votre terminal pour rendre les changements efficaces.

source: Now check that you can invoke pip typing `pip --version`. The output should resemble the following: ::
fr: Maintenant vérifiez que vous pouvez faire référence à pip en tapant `pip --version`. Le résultat devrait etre comme cela: ::

source: If you get and error back make sure the pip executable is in your `PATH`.
fr: Si vous obtenez une erreur, soyez sur que le pip executable est dans votre `PATH`.

source: Install Sphinx
fr: Installez Sphinx

source: To install Sphinx on your machine, type the following in your terminal: ::
fr: Pour installer sphinx sur votre machine, tapez cela dans votre terminal: ::

source: If you are on Linux you may need to prefix the command with `sudo`
fr: Si vous etes sur Linux , vous pourrez avoir besoin de préfixer les commandes avec `sudo`.

source: Now test your installation: ::
fr: Maintenant , testez votre installation: ::

source: For a more detailed installation guide refer to `this document <http://docs.geoserver.org/latest/en/docguide/install.html>`_
fr: Pour un guide d' installation plus détaillé , faites référence à `ce document <http://docs.geoserver.org/latest/en/docguide/install.html>`_

source: Check out documentation source
fr: Vérifiez la source de la documentation.

source: Since write acecss to the main documentation repository is restricted you may want to work on your personal `fork <https://help.github.com/articles/fork-a-repo/>`_. Login on Github with your account, navigate to the `documentation reposiroty <https://github.com/geosolutions-it/doc-geonode>`_ and click on `fork`. You will be redirected to your own fork of the documentation.
fr: Vu que l'accés de l'écriture du dépot du document principal est limité , vous voulez peut être travailler avec votre `fork <https://help.github.com/articles/fork-a-repo/>`_. Login Github avec votre compte , naviguez dans le `dépot de la documentation <https://github.com/geosolutions-it/doc-geonode>`_ et cliquez sur `fork` . Vous serez redirigés sur votre propre fork de la documentation.

source: Make sure you already `configured your Git username and email address <https://help.github.com/articles/set-up-git/#setting-up-git>`_
fr: Soyez sur d'avoir déjà configuré votre `Git username et adresse email <https://help.github.com/articles/set-up-git/#setting-up-git>`_

source: Now clone your repository locally: ::
fr: Maintenant clonez votre dépot localement: ::

source: where `your-user` is your username on GitHub.
fr: Où `your-user` est votre username sur GitHub.

source: Now make the changes you want to the documentation.
fr: Maintenant , faites les changements que vous voulez à la documentation.

source: Build the documentation
fr: Construisez la documentation.

source: To build the documentation locally on your machine, open the terminal and move to the project root directory, then run the following: ::
fr: Pour construire la documentation localement sur votre machine, ouvrez le terminal et allez au projet " répertoire racine" ,puis exécutez la commande suivante: ::

source: The html version of the documentation will be build under the `build` subfolder. Use your favorite web browser to open the index file called `index.html`.
fr: La version html du document sera construite dans le sous-dossier `build`. Utilisez votre web browser favori pour ouvrir l'index filed appelé `index.html`.

source: When you make changes to the documentation re-build it periodically to make sure the end result matches what you expect.
fr: Quand vous faites des changements à la documentation , reconstruisez la périodiquement pour être sur que le résultat final reflette ce que vous attendiez.

source: Edit the documentation
fr: Editez la documentation.

source: The documentation is kept in reStructuredText format. For a quick reference refer to `this <http://docs.geoserver.org/latest/en/docguide/sphinx.html>`_ document. For a more in-depth document refer to the `official documentation <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_.
fr: La documentation est gardée dans un format de texte restructuré . Pour une rapide référence , référez vous à `cela <http://docs.geoserver.org/latest/en/docguide/sphinx.html>`_ document. Pour un document plus précis , faites référence à cette `documentation officielle <http://docutils.sourceforge.net/docs/ref/rst/restructuredtext.html>`_.

source: Submit your changes to the main repository
fr: Référez vos changements au dépot principal.

source: You are done making changes to the documentation and you are ready to submit your changes. If you are new to Git make sure you grasped the basics of it before moving on. There are many sources of information online, you can Google for it or read `this <https://git-scm.com/book/en/v2/Getting-Started-Git-Basics>`_ introduction.
fr: Vous avez terminés les modifications de la documentation et vous êtes prêt à soumettre vos changements . Si vous êtes nouveau à Git , assurez vous d'en avoir saisi les bases avant d'aller plus loin. Il y a plusieurs sources d'informations online , vous pouvez Google cela ou lire `ceci <https://git-scm.com/book/en/v2/Getting-Started-Git-Basics>` _ introduction.

source: Run `git status` and `git diff` to review the changes you made and re-build the documentation locally as explained above.
fr: Exécute git status et git diff pour revoir les changements que vous avez fait et reconstruisez la documentation localement comme expliqué ci-dessus.

source: Add the files with the changes you want to submit to the staging area ::
fr: Ajoutez les files avec les changements que vous voulez soumettre aux zones de transit ::

source: And commit the changes ::
fr: Faites les modifications ::

source: Then push them to your personal GitHub repository ::
fr: Puis poussez-les dans votre personel dépot GitHub ::

source: Open your favorite browser and navigate to your GitHub repository. You will be able to see your latest commit along with a message stating that your branch is ahead of the main repository. Click on the 'pull request' button to make a pull request against the official documentation repository.
fr: Ouvrez votre browser favori and naviguez sur votre dépot GitHub. Vous serez capable de voir le long votre dernièr commit avec un message déclarant que votre branch est devant le dépot principal. Cliquez sur le bouton 'pull request' pour faire une pull request contre le dépot officiel de la documentation.

source: Create a pull request with a brief description of what you did. The pull request will be reviewed and eventually merged into the official documentation repository.
fr: Créez une pull request avec une brève description de ce que vous avez fait. La pull request revue et eventuellement fusionné dans le dépot de la documentation officielle.
